{
  "chunk_id": "coterminal_handbook_chunk_0004",
  "source_file": "coterminal_handbook",
  "chunk_type": "coterminal_handbook_section",
  "section_id": "IV",
  "title": "IV. Academic Planning",
  "text": "Co-Terminal Degree Pairings A number of formal co-terminal degree pairings exist, and can be viewed in the Undergraduate Bulletin. These legacy degree pairings have specific curricular and shared credit requirements. Students may alternatively work with advisers to identify customized bachelor’s and master’s degree pairings, pending the approval of the prospective graduate program and the student’s undergraduate program. In these cases, shared credit is approved on an individual basis. Declaration of Intent Students who wish to enroll in a co-terminal program should file a Declaration of Intent their first semester of enrollment at the university. This declaration signals an intent to apply to a co- terminal program in the student's junior year, should academic criteria be met. This declaration is especially critical for students who wish to pursue a customized co-terminal degree pairing and will help identify any deficiencies or prerequisite courses for the prospective graduate degree program. The Office of Undergraduate Academic Affairs will monitor the student's declaration until such time as the student may apply to be fully admitted to a co-terminal master's degree in their junior year, subject to the admission policies of the graduate academic unit. Co-Terminal Shared and Non-Shared Credit Form The Co-Terminal Shared and Non-Shared Courses eForm is the vehicle for establishing each co-terminal student’s graduate degree plan with the Office of Graduate Academic Affairs. An official Co-Terminal Shared and Non-Shared Courses eForm is mandatory for co-terminal graduate degree programs and must be filed by a co-terminal student, for final approval, in the first semester of co-terminal enrollment and no later than the day after add/drop for the term. Failure to comply will result in the student being blocked from registering for the next terms courses. Co-terminal students may access eForms for Degree Works via the eForms tab within the university’s Graduate Degree Works system, located in the myIIT portal (https://my.iit.edu). The Co-Terminal Shared and Non-Shared Courses eForm should include all current and future courses needed to complete the graduate portion of the co-terminal degree. If you have completed graduate-level coursework that you would like to use toward your graduate degree requirements, you should indicate this by including those courses in the Co-Terminal Shared and Non-Shared Courses eForm. The university requires a minimum of 30 credit hours for a professional Master’s or Master of Engineering degree and 32 credit hours for a Master of Science degree; however, please consult individual co-terminal advisers for program-specific details. 6 Updated September 2020 Shared Credit Illinois Tech allows co-terminal students to share up to nine credit hours between their undergraduate and graduate programs. However, some co-terminal programs allow a smaller amount of shared credit or no shared credit. Shared courses should be included in the Co-Terminal Shared and Non-Shared Courses eForm, using the “Shared (Used in both programs)” descriptor. Shared credit courses must be completed with a grade of “C” or better to be applied to the graduate degree requirements of a co-terminal program. A minimum cumulative graduate GPA of 3.0/4.0 is required to maintain good graduate academic standing. Paired Programs For students who are enrolled in formally paired programs, the shared credits are pre- determined. Please contact your co-terminal adviser to identify what your options are. Unpaired Programs Students may pair programs that have not been previously, formally paired. Shared courses need to exist in the rules of both the undergraduate and graduate programs as stated in the undergraduate and graduate bulletins. Courses cannot be substituted within the programs. External Transfer Credit A maximum of nine graduate-level credit hours taken elsewhere and not applied toward any earned degree, subject to restrictions on shared and graduate transfer credit (http://bulletin.iit.edu/graduate/academic-policies-procedures/academic-progress/transfer- credit/), which were passed with grades of “B” or better, may be transferred towards the graduate portion of the co-terminal degree program, subject to the advance approval of the academic unit. Requested transfer credit must be verified through the submission of the official transcript outlining the requested credit. If the requested transfer credit is from a foreign institution, the official attested transcript must be sent directly from the institution to World Education Services (www.wes.org). World Education Services (WES) will submit the credential evaluation results directly to Illinois Tech. NOTE ON RESIDENCY REQUIREMENT: Co-terminal students, like Illinois Tech undergraduate students, are required to complete their last 45 hours of undergraduate coursework at Illinois Tech. These hours may include approved co-terminal shared credit hours, but not purely graduate coursework. 7 Updated September 2020",
  "metadata": {
    "section_id": "IV",
    "section_title": "IV. Academic Planning",
    "start_page": 6,
    "word_count": 731
  }
}