{
  "chunk_id": "coterminal_handbook_chunk_0003",
  "source_file": "coterminal_handbook",
  "chunk_type": "coterminal_handbook_section",
  "section_id": "III",
  "title": "III. Advising",
  "text": "Academic Advising Co-terminal students are assigned a co-terminal adviser who will oversee academic advising and course selection for their graduate degree. Co-terminal students will continue to work with their major adviser on undergraduate degree concerns. Co-terminal students should work with their co-terminal adviser to develop their plan for graduate degree completion. All questions regarding graduate course selections, concentrations, specializations, or proposed project and thesis research should be directed to the student’s co-terminal adviser. Co-terminal students are encouraged to meet with their co- terminal adviser each semester prior to registration. Students should not contact their major adviser for questions about their graduate studies. Co-terminal students with concerns about their academic status or co-terminal policies should contact the Office of Graduate Academic Affairs at cotermdegrees@iit.edu or 312.567.3024. Financial Advising All newly admitted co-terminal students who are eligible for federal financial aid are required to meet with a financial aid staff member to review the rules and regulations for financial aid as it pertains to the co-terminal program. Prior to their required meeting, students must meet with both undergraduate and co-terminal advisers to develop a projected course schedule to degree completion using the Co-Terminal Program Planning Worksheet.* This worksheet is essential for the Office of Financial Aid to adequately review how federal and institutional aid will be applied to the student’s individual co-terminal degree plan. Note that this worksheet is not your academic Co-Terminal Shared and Non-Shared Courses eForm. All newly admitted co-terminal students who are not federal aid recipients will be invited to attend a Co-Terminal Live session to review the rules and regulations for financial aid as it pertains to the co-terminal program. Details of the session will be emailed to the student by the Office of Financial Aid. Alternatively, if a student is not able to attend the live session, they may schedule an appointment to meet with a financial aid staff member to satisfy this requirement. Co-terminal students with any concerns about their financial aid should directly contact the Office of Financial Aid at finaid@iit.edu or 312.567.7219. *The Co-Terminal Program Planning Worksheet can be found on the Financial Aid website. 5 Updated September 2020",
  "metadata": {
    "section_id": "III",
    "section_title": "III. Advising",
    "start_page": 5,
    "word_count": 355
  }
}