{
  "chunk_id": "coterminal_handbook_chunk_0002",
  "source_file": "coterminal_handbook",
  "chunk_type": "coterminal_handbook_section",
  "section_id": "II",
  "title": "II. Applying",
  "text": "Students applying to co-terminal studies must have completed at least 60 credit hours of undergraduate study and a least one full-time semester at Illinois Tech. Applicants must be at least one semester (12 credit hours) away from undergraduate graduation in order to apply. Applicants must also have a GPA of at least 3.0/4.0 or 3.25/4.0; however, please note that academic units may vary in terms of their GPA admission requirements. Co-terminal applications are coordinated through Illinois Tech’s Office of Graduate Admission. The co-terminal application is accessed from the my.iit.edu portal/academics tab/undergraduate academic affairs channel. Co-terminal admission deadlines are as follows, with no exception: • Fall semester admission: August 1 • Spring semester admission: December 1 • Summer semester admission: May 1 Upon admission to co-terminal studies, students are required to meet with the Office of Financial Aid and encouraged to meet with the International Center (if applicable) to discuss the effect co-terminal studies will have on their financing and immigration status. Financial Aid Illinois Tech considers co-terminal students to be degree-seeking, full-time, undergraduate students, and most Illinois Tech undergraduate scholarships will automatically be extended to the end of a co-terminal program. However, financial aid guidelines and regulations for co- terminal students can differ from non-co-terminal students as aid may be applied differently throughout the course of the program based on student enrollment. Please consult the Office of Financial Aid website for the current financial aid guidelines for co- terminal study: http://web.iit.edu/financial-aid/policies-procedures/co-terminal-student-policy 4 Updated September 2020",
  "metadata": {
    "section_id": "II",
    "section_title": "II. Applying",
    "start_page": 4,
    "word_count": 245
  }
}