{
  "chunk_id": "coterminal_handbook_chunk_0005",
  "source_file": "coterminal_handbook",
  "chunk_type": "coterminal_handbook_section",
  "section_id": "V",
  "title": "V. Academic Standing",
  "text": "Co-terminal degrees are awarded simultaneously, but need not be completed simultaneously. The undergraduate degree requirements may be completed in advance of the graduate degree requirements. In such cases, the undergraduate degree will be held until the completion of the graduate degree. Graduate degree requirements must be completed within 12 months of the undergraduate degree requirements, or else the student will be dismissed from the co-terminal program. Co-terminal students must complete all degree requirements within six years of their undergraduate matriculation, or the student will be dismissed from the co-terminal program. Probation Co-terminal students must maintain satisfactory grade point averages and a satisfactory rate of progress towards the completion of their co-terminal degrees. Illinois Tech considers co-terminal students to have an undergraduate student status throughout the course of their studies; however, students are subject to both undergraduate and graduate student probation policies. Co-terminal students who do not earn at least a 2.0 cumulative GPA, a 1.85 term GPA, a 2.0 major GPA, or who do not maintain satisfactory academic progress in their bachelor’s program are placed on undergraduate academic probation. Co-terminal students who are placed on undergraduate academic probation will be dismissed from the co-terminal program. Graduate academic standing review will be initiated when a co-terminal student completes declared graduate or shared coursework. In order to remain in good academic standing on the graduate level, co-terminal students must maintain a cumulative GPA of 3.0/4.0 for their graduate coursework. Students who achieve a graduate cumulative GPA of less than 3.0/4.0 will be placed on graduate academic probation. Students are required to submit a G702 probation contract before they will be allowed to register each semester they are on graduate academic probation. The G702 probation contract must be approved by the student’s co-terminal adviser and department. Co-terminal students on graduate academic probation will be allowed to register for a maximum of 12 credit hours per semester in order to maintain their full-time undergraduate status and financial aid eligibility. If the co-terminal student fails to make the requisite academic progress in the graduate degree program in accordance with graduate academic standing rules, they may be dismissed in a subsequent semester. A student dismissed from co-terminal degree status may still complete the undergraduate degree following the academic rules of undergraduate study. A student who is dismissed from co-terminal degree status may apply for Accelerated Master's Program admission consideration in the future. 8 Updated September 2020 Course Repeats Co-terminal students may repeat up to two distinct courses for their graduate degree program. Co-terminal students may also repeat a maximum of three 100 and 200-level courses, and a maximum of three 300- and 400-level courses for their undergraduate degree program. If a student applies for a course repeat for a course being used for shared undergraduate and graduate degree credit, the course repeat will be double counted (counted once towards the two-course graduate course repeat maximum and again towards the three-course undergraduate upper-level course repeat maximum). Course repeats must be used for distinct courses with each course being repeated once for a change of grade. Both grades will be maintained on your student record; however only the most recent grade recorded for the repeated course will be calculated in your institutional GPA. A course repeat request must be submitted at the time of registration using the appropriate undergraduate or graduate academic affairs procedures. For the complete course repeat policy, please refer to the course repeat policy at https://web.iit.edu/registrar/registration/course-repeat-policy.",
  "metadata": {
    "section_id": "V",
    "section_title": "V. Academic Standing",
    "start_page": 8,
    "word_count": 571
  }
}