{
  "chunk_id": "Student_Handbook_chunk_0048",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "120-121",
  "page_count": 2,
  "text": "T. Use of Bathroom Facilities\nIllinois Tech strives to create a campus environment that supports and values all members\nof our community. As one aspect of creating a supportive environment is providing safe,\naccessible and convenient bathroom facilities, students as well as staff, faculty, and\ncampus guests should use the bathroom facilities that correspond to their sex or gender\nidentity or utilize bathrooms that are designated gender-neutral or gender-inclusive.\nU. Students with Disabilities\nIt is the policy of Illinois Tech to provide students with reasonable accommodations in a\ntimely manner when such accommodations are necessary to afford goods, services,\nfacilities, privileges, advantages or accommodations to students with disabilities, unless\nproviding the accommodation would fundamentally alter the nature of the good, services,\nfacilities, privileges, advantages or accommodation. To this end, students with disabilities\nmay request academic accommodations; housing and dining accommodations;\nmodifications to Illinois Tech policies, rules and regulations; environmental adjustments,\nsuch as the removal of architectural, communication or transportation barriers; and/or\nauxiliary aids and services. Requests for accommodations should be made to the Center\nfor Disability Resources, and the specific procedures for the making of such requests are\nset forth on the Center’s webpage at https://web.iit.edu/cdr/services. With respect to such\nrequests, Illinois Tech, through the Center, will conduct, as more fully detailed on the\nCenter’s webpage, an individualized assessment of each student to determine whether\nand what accommodation(s) can be made to allow students with disabilities to participate\nin the goods, services, facilities, privileges, advantages, and accommodations at Illinois\nTech.\nAny student with a disability at Illinois Tech who believes that they have received\ndiscriminatory treatment in violation of Illinois Tech’s stated policy should communicate,\neither in writing or in person, with the Director of Equal Opportunity & Affirmative Action,\nIllinois Tech Tower, 10 W. 35th Street, 19th Floor, 312.567.3134.\nV. Pregnant Students\nIllinois Tech is committed to creating an accessible and inclusive environment for pregnant\nand parenting students. Students may request reasonable accommodations as a result of\npregnancy, childbirth, or related conditions. Reasonable accommodations vary based on\nStudent Handbook 119\n\nthe student’s circumstances, but may include: academic accommodations and flexibility\n(such as breaks during class, excused absences, rescheduling of tests, extensions of\ndeadlines, and alternatives to make up missed work); leaves of absences or changes in\nwork schedules; changes to housing; or other types of accommodations. A student\nseeking such an accommodation should make such a request to the Center for Disability\nServices, which, because of its expertise in the area of accommodations, administers such\nrequests. The specific procedures for making such a request are set forth on the Center’s\nwebpage at -https://web.iit.edu/cdr/services.\nTo file a report of discrimination based on pregnancy or parental status, students should be\nmade to Illinois Tech’s Title IX Officer, Virginia Foster. Ms. Foster’s contact information is:\n312-567-5725, foster@illinoistech.edu, Room 13D6-2 of the Illinois Tech Tower, 10 West\n35th Street in Chicago.\nW. Demonstrations\nIllinois Tech is committed to freedom of inquiry, open expression, and the exchange of\nideas in a civil and inclusive manner by students, faculty and staff. Discourse is central to\nIllinois Tech’s mission, and our community of students, faculty and staff should engage in\ndialogue in a spirit of mutual respect, civility and care. Although Illinois Tech’s campus is\nnot a public forum, Illinois Tech may permit at its discretion responsible and safe\ndemonstrations and rallies organized and conducted by eligible students and recognized\nstudent groups, provided that they comply with the requirements described in this policy\nand any other applicable Illinois Tech policies. However, Illinois Tech reserves the right to\nintervene whenever it has reason to believe a demonstration presents a clear danger to\nstudents, faculty, or staff, or when a demonstration disrupts university operations, or is\ncontrary to applicable law or the university’s mission and values.\nStudents organizing or participating in demonstrations on campus and at Illinois Tech-\nsponsored events are required to abide by this policy, which requires registration and\napproval. This policy applies to all Illinois Tech property and facilities including, without\nlimitation, the Mies Campus, the Conviser Law Center, Rice Campus, Moffett Campus, and\nFulton Labs, as well as Illinois Tech-sponsored events occurring off campus.\nTo ensure that a demonstration does not violate directly or indirectly the rights of others by\npreventing or disrupting the operations of the university, all activities in the nature of a rally,\ndemonstration, protest or other coordinated event (collectively, a “Demonstration”) must\nbe registered and approved by the Office of the Dean of Students (dos@illinoistech.edu), or\ndesignee.\nStudent Handbook 120",
  "metadata": {
    "pages": [
      120,
      121
    ],
    "word_count": 750
  }
}