{
  "chunk_id": "Student_Handbook_chunk_0034",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "91-93",
  "page_count": 3,
  "text": "be related to an Illinois Tech departmental or recognized student organization\nactivity. All postings must be in English or include an English translation. Postings\nthat restrict opportunity or otherwise discriminate because of race, color, religion,\nnational origin, gender, sexual orientation, age, disability, veteran status or other\nstatutorily protected class are prohibited.\n Advertisements for events sponsored by Illinois Tech departments or organizations\nand those taking place at Illinois Tech have posting priority. Advertisements not\ndirectly connected with Illinois Tech will be posted only as space permits. An\nadvertisement must include the following information to be considered for posting:\nname of sponsoring agency, department, organization or individual; contact\ninformation in the form of phone or email; date and place of the event or meeting\nbeing announced. Programs which receive monetary allocation through the Student\nActivities Fund (SAF) must include “Sponsored by the Student Activities Fund” on all\nadvertisements.\n Advertisements may only be posted on bulletin boards specifically designed to hold\nadvertisements. These include outdoor bulletin boards and those in the main\nconcourse, classrooms, or lobbies of Illinois Tech buildings. General\nadvertisements may not exceed 11” x 17”. Exceptions are made for banners and A-\nFrame posters. Some bulletin boards located near administrative, academic, or\nstudent organization offices are controlled and maintained by those departments or\norganizations and may not be used for general advertising without their permission.\nLocked bulletin boards are not available for general advertising.\n Advertisements may not be posted on walls, chalkboards, windows, doors, light\npoles, brick, elevators, sidewalks, walkways, bathrooms, trees, fences, other signs,\nor vehicles. Any advertisement posted improperly will be removed immediately and\ndiscarded. The responsible party will be contacted to discuss the violation. Possible\nfines and further disciplinary action may be taken if appropriate. Regardless of\nlocation, overlapping, covering, removing or defacing another posting is not\npermitted.\n Postings are generally validated through the date of the event or deadline as shown\non the posting. If no date is included, the posting will be approved for two weeks. All\nparties must remove advertisements within two working days after the stamped\nexpiration date. Posting of temporary, outdoor direction and information signs must\nbe approved in advance by Illinois Tech Facilities. The sponsoring organization must\nremove these signs within one (1) working day of the event.\nStudent Handbook 90\n\n The hanging of banners is permitted only in MTCC Center Court, MTCC Commons\nand McCormick Student Village; A-Frames are utilized only in the MTCC for posters\nlarger than 11x17. All banners and posters must be approved two days in advance\nby the Office of Student Affairs/Student Life. Banners for posting in the MTCC\nCommons or Center Court may be hung only by the Campus & Conference Centers\nStaff.\nAdvertisements related to alcohol will only be accepted from Illinois Tech Dining Services,\nand only in relation to the Bog. Said advertisements will only be allowed in MTCC Center\nCourt and within Hermann Hall. No other organization, department or outside party may\nrefer to, mention or advertise alcohol in any form. This includes, but is not limited to:\nwebsites, Facebook postings and e-mail messages sponsored by Illinois Tech student\norganizations.\n2. Sanctions\nAny party violating this policy for the first time will receive an official warning. A party\nviolating this policy for the second time may lose posting privileges for at least one\nsemester. Any violation may be subject to additional penalty as determined by the Office of\nStudent Affairs.\nL. Privacy Rights and Access to Educational Records\nIllinois Tech respects the rights of privacy of its students and acknowledges the\nresponsibility to maintain confidentiality of personally identifiable educational records.\n1. FERPA - Family Educational Rights and Privacy Act\nPlease visit web.iit.edu/registrar/ferpa for Illinois Tech’s official FERPA information, policies\nand procedures; such posted version is the version that will control in all instances. For\ngeneral information about FERPA, please visit the U.S. Department of Education's website\nat www.ed.gov/policy/gen/guid/fpco/ferpa/index.html. Students can grant permission to\nrelease all or part of their record to specific individuals by completing the FERPA release\nStudent Handbook 91\n\nform at www.iit.edu/registrar/forms/view.php?id=12197. The following is a summary\ndescription of the policies and procedures that apply to such records.\n2. Accessibility of Educational Records\nIllinois Tech has adopted a policy of not disclosing personally identifiable information,\nother than directory information, from the educational records of a student without their\nprior written consent, except in the following instances:\n To school officials, including teachers, within the educational institution who have a\nlegitimate educational interest;\n To officials of another school in which the student seeks or intends to enroll,\nprovided that a documented attempt will be made to notify the student of intended\ndisclosure prior to submission of such information;\n To certain authorized representatives of the United States and state agencies who\nrequire such information to carry out lawful functions;\n In connection with the student’s application for, or receipt of, financial aid;\n To organizations conducting studies for, or on behalf of, educational agencies or\ninstitutions, if these studies are conducted in a manner that will not permit the\npersonal identification of students and if the information will be destroyed when no\nlonger needed for the purpose for which it is conducted;\n To accrediting organizations in order to carry out their accrediting functions;\n To comply with a judicial order or lawfully issued subpoena, with, except as\nprohibited by law, reasonable notice to the student of the intended disclosure prior\nto submission of such information;\n To appropriate parties in health or safety emergencies; and\n To parents of dependent Illinois Tech students, as defined in Section 152 of the\nInternal Revenue Code of 1986.\n As may otherwise be authorized by law.\nFor purposes of this section, all students enrolled at Illinois Tech shall be deemed to be\nindependent of their parents. Any parent may challenge this assumption by presentation of\nevidence that such student does qualify as a dependent for federal income tax purposes.\nStudent Handbook 92",
  "metadata": {
    "pages": [
      91,
      92,
      93
    ],
    "word_count": 995
  }
}