{
  "chunk_id": "Student_Handbook_chunk_0017",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "55-57",
  "page_count": 3,
  "text": "General bullying or uncivil behavior that is not based on a protected status may not\nfall within the purview of harassment as set forth herein, but may still violate other\nprinciples or policies set forth in this Code of Conduct or otherwise published by\nIllinois Tech, and therefore may be actionable.\n5. Endangerment\nPhysical abuse of any person; or any action (or threat of action) that endangers, threatens\nto endanger or is reasonably likely to harm the health, safety, or mental well-being of any\nsuch person (including oneself); or the failure to seek emergency assistance for an Illinois\nTech employee, faculty member, student, alumni or guest when it is reasonably clear such\nassistance is needed and the person who could seek such assistance was interacting or\notherwise involved with the activity or circumstances necessitating such assistance. The\npossession and/or use of firearms or weapons on campus, as all such terms are defined in\nthe Concealed Carry and Prohibition Regarding Firearms and Weapons on Campus Policy\n(See Article III, Section C hereof) may be considered conduct that endangers self or others.\n6. Failure to Comply\nFailure to comply with the reasonable request or instruction of an Illinois Tech official or\nemergency personnel acting in an official capacity, including, but not limited to, refusing to\nprovide identification, refusing to dispose of or turn over prohibited items, failing to\nrespond, leaving the scene of an incident or refusing to comply with instructions related to\npublic health matters. This also includes disorderly or abusive conduct toward Illinois Tech\nofficials acting in the performance of their duties. Students/guests/visitors are expected to\ncooperate with and may not knowingly give false information to an Illinois Tech employee or\nrepresentative acting within the scope of their employment or official capacity; failure to do\nso is a violation of this provision.\nStudent Handbook 54\n\n7. Fire Safety\nIn order to avoid possibly jeopardizing the safety or security of Illinois Tech and the Illinois\nTech community, the following acts are prohibited:\n Damaging or destroying property of or under the control of Illinois Tech or an Illinois\nTech affiliate, employee, faculty member, student, alumni or guest by fire or\nexplosives;\n Maintaining, constructing or operating open fires, including bonfires, fire pits,\nchimneys and the like on Illinois Tech property or property under its control;\n Creating or maintaining on Illinois Tech property or property under its control a fire\nor fire hazard (except as specifically authorized), including burning candles or\nincense or use of unauthorized (or misuse of authorized) appliances or heating\ndevices, including toasters, microwaves, hot plates, and space heaters;\n Tampering with or misuse of emergency or fire safety equipment, including\nemergency call devices, fire alarms, fire exits, firefighting equipment, smoke/heat\ndetectors, or sprinkler systems located on Illinois Tech property or property under\nits control;\n Failing to exit immediately any Illinois Tech facility or building when a fire alarm or\nother emergency notification has been sounded, or hindering or impairing the\norderly evacuation of any Illinois Tech facility, building, or premises;\n Smoking in any enclosed Illinois Tech facility, in any smoke-free designated outdoor\nareas, or within 25 feet of an entrance, open window, ventilation intake, or similar\nfeature of any enclosed Illinois Tech facility;\n Vaping or the use of e-cigarettes is prohibited in all Illinois Tech facilities;\n Violations of state or local fire and fire-related ordinances or the life safety policies\noutlined in the Residence Life handbook listed online at web.iit.edu/housing.\n8. Guest and Visitors\nKnowingly allowing one’s visitors or guests to violate Illinois Tech policies or failing to\nmonitor the behavior of one’s visitors or guests to assure their adherence to such\nstandards may result in the host student being held responsible for the actions of their\nvisitors or guests. Students living in the residence halls and sororities are expected to also\nknow and follow the guest policy outlined in the Residence Life handbook.\nStudent Handbook 55\n\n9. Hazing\nIt is the responsibility of all students and student organizations to encourage an\natmosphere of learning, social responsibility and respect for human dignity and to provide\npositive influences and constructive development for all members and aspiring members\nof the Illinois Tech community. Students and student organizations are expected to use\ngood judgment to determine the abilities of individual students as they relate to\norganization activities and requirements. Accordingly, Illinois Tech prohibits acts of hazing.\n(Illinois law also prohibits hazing. See 720 ILCS §5/12C50. Hazing can be a Class 4 felony,\nwhich carries criminal penalties of up to three years’ imprisonment and a $25,000 fine.)\nAt Illinois Tech, hazing is defined as any action taken or situation created, intentionally or\nunintentionally, whether on or off Illinois Tech premises and whether presented as optional\nor required, to produce: mental, physical, or emotional discomfort; servitude; degradation;\nembarrassment; harassment; or ridicule for the purpose of initiation into, affiliation with,\nadmission to, or as a condition for continued membership in an Illinois Tech group, team,\nor other organization, regardless of an individual’s willingness or consent to participate. To\nbe clear, Illinois Tech may hold individuals as well as groups of students and student\norganizations responsible for hazing.\nThough not intended as an exhaustive list, the following actions and situations constitute\nhazing, if they are undertaken for or in connection with the above-noted reasons and\npurposes:\n Any physical abuse expected of or inflicted upon another, including paddling,\ntattooing or branding in any form;\n Any strenuous physical activity expected of or inflicted upon another, including\ncalisthenics;\n Creation of excessive fatigue, sleep deprivation, or interference with scholastic\nactivities, including late night work sessions, meetings or sleepovers;\n Physical and psychological shocks, including line-ups, berating, verbal abuse,\nthreats and name calling;\n Sexual violations or other required, encouraged or expected sexual activity, whether\nactual or simulated;\n Prolonged exposure to severe or inclement weather;\nStudent Handbook 56",
  "metadata": {
    "pages": [
      55,
      56,
      57
    ],
    "word_count": 977
  }
}