{
  "chunk_id": "Student_Handbook_chunk_0063",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "155-157",
  "page_count": 3,
  "text": "the Illinois Tech campus or Illinois Tech Public Safety if the event is to be held on the\ncampus, must be hired, at the organization’s expense, for the duration of the event; and any\nadditional event-specific rules required by Student Life, Residence Life, the Office of\nStudent Affairs and/or Public Safety must be followed.\nVII. FRATERNITIES AND SORORITIES\nAs fraternities and sororities are student organizations recognized in accordance with and\nsubject to Article VI of this Student Handbook, the provisions of this Article VII are intended\nto be, and shall be deemed to be, in addition to, and not in lieu of, any other provisions\ncontained in this Student Handbook. In the case of any conflict, fraternities and\nsororities shall be expected to meet the strictest standard.\nIf a fraternity or sorority wants to charter on our campus, they must first be approved as a\nrecognized student organization by SGA, as well as approved by Greek Council, to be\nconsidered an Illinois Tech fraternity/sorority chapter. They cannot operate without being\napproved by both entities. If a chapter would like to recharter on Illinois Tech’s campus, the\nchapter must be inactive for at least 5 years, and the chapter must get approval from the\nDean of Students.\nIf the FSL chapter is a citywide chapter, each university participating must hold the same\namount of events per semester, and funding will only be given to events that happen on\nIllinois Tech’s campus. Events on another campus must be funded by that campus. Off\ncampus events (events that do not happen on one of the participating universities\ncampuses) must be funded by all campuses.\nA. Policies and Regulations\n1. Alcohol Policy. At all times, chapters must follow the appropriate rules, as set forth\nbelow, local and national chapter rules, the university Code of Conduct, and state and\nlocal law with regard to alcohol consumption within their houses.\nA bar monitor, that is not a current Illinois Tech undergraduate, must be identified and\napproved by the Office Student Life, and must be present throughout the party or event. All\nbar monitors must, at a minimum, have gone through TIPS or other similar training.\nStudent Handbook 154\n\nA fraternity and sorority event registration form must be submitted to the Office of Student\nLife no less than 7 calendar days prior to the event. The event information will be forwarded\nto Public Safety.\nA complete guest list of attendees who must be submitted to the Office of Student Life no\nless than 48 hours prior to the event. A post-event guest list with signatures must be turned\nin to the Office of Student Life before the end of the business day following the event.\nVisitors not listed on the approved guest list are not allowed to attend the event. Access to\nthe house must be strictly controlled at all times, and those above the age of 21 who are\neligible to consume alcohol must be identified on entry by a different wristband or marking\nthan students who are under 21. Both groups of students must wear their respective\nwristbands or markings throughout the party.\nA Public Safety officer and/or a professional staff member from the university may conduct,\nat least, one random visit during each event for the purpose of walking through the public\nareas of the event to ensure the following:\n1. All event participants are safe;\n2. Local and national organization rules, state law, and the Code of Conduct are being\nfollowed;\n3. Participants that are served and consume alcohol are wearing the appropriate\nwristband or marking; and\n4. An official bar-monitor is stationed appropriately.\nFraternities/sororities agree to not impede, delay or otherwise obstruct the Public Safety\nofficer and/or professional staff member from the university during the course of such walk\nthrough. Such personnel will also assist the chapter members as appropriate and upon\nrequest.\nStudent Handbook 155\n\nPublic Safety and/or other appropriate university staff will shut down the event within 30\nminutes if any of the requirements set forth in this Article VII, Section A(1) are observed as\nnot being followed or if they are not allowed access to the event. Failure to shut down the\nevent in the time specified will be reported and will lead to formal disciplinary proceedings\nagainst the fraternity/sorority. Public Safety and/or other university staff is not responsible\nfor the closure of an event, unless invited by the fraternity/sorority to aid them in closure.\nPublic Safety and/or other appropriate university staff may also perform informal checks by\neither driving or walking by the perimeter of where the party is being held between 1:00\na.m. and 1:30 a.m. to monitor safety during the closure of the event. Unless there is a\nsafety concern, Public Safety officers and/or other appropriate university staff will not enter\nthe house at this time as the purpose is only to monitor the orderly end to the party.\nAll events must officially end by 1:30 a.m.\nThe chapter RA, Risk Management Chair, and one other member of the executive board\nmust be identified by nametag or similar markings and present at all times at the event and\nbe alcohol free for the purpose of monitoring the event for compliance with applicable\nrules.\nThe chapter RA, Risk Management Chair or equivalent position, and executive board must\nannually receive the following training: TIPS or equivalent, conflict management, conflict\nresolution, and community building. All members of the foregoing group must have\nattended a training session on each of the foregoing topics each year prior to hosting their\nfirst event of the academic year.\nIt is recommended that post- and pre-party reports detailing any actual or potential\nincidents, problems, or violations as well as any other relevant or useful information be\nkept by all chapters. Any incidents need to be reported to the Office of Student Life within\n24 hours of occurring or the first business day after the event.\nStudent Handbook 156",
  "metadata": {
    "pages": [
      155,
      156,
      157
    ],
    "word_count": 984
  }
}