{
  "chunk_id": "Student_Handbook_chunk_0021",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "65-66",
  "page_count": 2,
  "text": "sufficient merit does not exist for an actual hearing to occur. Less serious offenses\ninvolving fraternity or sorority regulations may be heard by the Greek Council, while less\nserious offenses related to student housing may be heard by Residence Life.\nFor the avoidance of doubt, sexual misconduct offenses, exclusive of Title IX\nDiscrimination including Sex-Based Harassment, which are processed pursuant\nto Appendix A of this Student Handbook, are per se deemed serious and will be processed\nby the Office of Student Affairs as provided for in this Student Handbook.\n3. Disciplinary Proceedings\na. Notification and General Procedures\nIf a complaint is deemed to have merit, meaning the gathered evidence provides a\nreasonable basis upon which a determination that a violation of this Code of Conduct may\nhave occurred could be made, students will be notified in writing by a member of the Office\nof Student Affairs at least five calendar days before any hearing and/or at least three\ncalendar days before an investigatory meeting. In person delivery or e-mail\ncorrespondence sent to the student’s registered illinoistech.edu e-mail address will\nbe considered sufficient written notification in all instances where written notification\nis required under this Code of Conduct or Student Handbook. To be clear, email\ncorrespondence sent to the student’s registered illinoistech.edu e-mail address will\nbe considered, and will be deemed, for all purposes, sufficient delivery of written\nnotification in any and all instances where written notification is required under this\nCode of Conduct. It is the student’s sole responsibility to monitor their email. The date\nany such notification is e-mailed will serve as the start date for any time period within\nwhich or after which any subsequent action or proceeding is to commence. All meetings\nand hearings are closed to the public. Only those individuals contemplated or permitted to\nbe in attendance pursuant to the provisions of this Student Handbook and such other\nIllinois Tech officials deemed reasonably necessary to the process may attend any\nparticular hearing. Any student may waive any time period required herein by executing a\nwritten waiver to such effect.\nAs set forth herein, notification of an investigatory meeting and/or conduct hearing will be\nprovided by the Office of the Vice Provost for Student Affairs and will include: (i) in the case\nof an investigatory meeting, a summary of the alleged complaint, including, to the extent\nknown, when, where and, if applicable, against whom it occurred, possible or potential\nStudent Handbook 64\n\nviolation(s) of the Code of Conduct implicated thereby, and the time and place of the\nmeeting; and (ii) in the case of a conduct hearing, the specific violation(s) of the Code of\nConduct with which they are being charged and either a copy and/or summary of the\nevidence and witnesses that will be presented to substantiate the violation(s) and the time\nand place of the hearing. Once proper notification has been given, Illinois Tech reserves\nthe right to hold the meeting and/or hearing whether or not the student elects to\nparticipate. Notwithstanding any time period specified herein, if reasonable\ncircumstances prevent any step from occurring within an identified time frame or if there\nare unanticipated delays (school breaks, including summer, inclement weather, witnesses\nor hearing board members are unavailable, illnesses, health and safety concerns, and the\nlike), Illinois Tech’s right to adjudicate violations of the Code of Conduct shall not be\nnegated. In such instances, Illinois Tech will notify all parties of the delay and will proceed\nwith due diligence to complete the adjudication as quickly as reasonably possible given\nthe circumstances, giving due notice to all impacted parties of the revised timing for\ncompletion of the process.\nIn any investigatory meeting, as defined in Section 3(c) below, and any conduct hearing,\nwhether before the Dean of Students or their designee or the Campus Judicial Board, the\nstudent alleged to have violated the Code of Conduct will have the right (A) to attend the\nconduct hearing, (B) to be accompanied by their parents and one other advisor of their\nchoosing, and (C) at the appropriate time in the hearing, present witnesses on their\nbehalf. If a proceeding relates to an alleged sexual misconduct violation, then the student\nwho experienced such alleged sexual misconduct will also have these rights, therefore, in\nsuch cases, the accused and accuser will be notified of the time and place of the hearing\nin the same manner.\nUpon receipt of a complaint, and pending an investigation and/or a hearing, the Dean of\nStudents may issue a temporary “no contact” order to any involved party not to have any\ncontact (written, oral, electronic and/or in-person) with the accuser, accused and/or\npotential witnesses whenever the Dean determines that such order is reasonable to\nmaintain the integrity of the process, to prevent undue influence, to avoid the imposition of\nundue stress on any party to the hearing, and/or to maintain the academic environment or\nefficient administration of Illinois Tech.\nStudent Handbook 65",
  "metadata": {
    "pages": [
      65,
      66
    ],
    "word_count": 819
  }
}