{
  "chunk_id": "Student_Handbook_chunk_0059",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "146-148",
  "page_count": 3,
  "text": "applicable policies and practices of the academic unit and the Office of Undergraduate or\nGraduate Academic Affairs as appropriate; (c) consult with appropriate members of the\nCST; (d) consider any additional information or documentation presented by the student in\nsupport of return or readmission; and (e) meet with the student. Conditions may be placed\nupon the student’s return. These conditions may include, but are not limited to, continued\nmedical or mental health treatment along with a signed release to allow verification of the\nstudent’s adherence to their treatment plan, a reduced course load, and/or limitations on\nextracurricular activities.\nA student whose request is denied, pursuant to this policy may make a written request to\nthe Provost or designee for an informal proceeding to review such denial. In no event will\nthe same individual, who imposed the intervention or involuntary withdrawal, conduct this\ninformal proceeding. The informal proceeding to review the denial to return will follow the\nsame procedures outlined in Section 6 of this policy.\nCC. Transfer of College Level Credit\n1. Undergraduate Students: Official transfer credit evaluations are completed only after a\nstudent is admitted to Illinois Tech. Courses may be acceptable for transfer from\naccredited colleges and universities, provided they are comparable in nature, content and\nlevel to those offered at Illinois Tech. Credit may also be accepted, based on appropriate\ndocumentation, for Dantes, military experience, and CLEP. Illinois Tech does not grant\ncredit for vocational courses or life/work experience. In addition, technology courses will\nnot be accepted in any engineering program. Illinois Tech will accept college coursework\ntaken while still in high school from other accredited universities and colleges.\nAll college transcripts are to be submitted as part of the application for admission to the\nOffice of Undergraduate Admission, regardless of the transferability of credits. A maximum\nof 68 applicable semester hours of transfer credit is permitted from a two-year college.\nThere is no maximum number of hours of transfer credit from a four-year college; however,\nthe final 45 semester hours of any degree program must be completed at Illinois Tech.\nTransfer credit will be accepted for courses completed with the equivalent of a grade C or\nbetter. A grade of C- is not acceptable for transfer credit. Grades from transfer courses are\nnot included in the Illinois Tech cumulative or major GPA. In certain instances, the\nacademic department must approve transfer credit if a long period of time has elapsed\nsince the course was completed.\nStudent Handbook 145\n\n2. Graduate Students:\nMaster's Transfer Credit\nFor master’s degree programs, a maximum of nine applicable credit hours earned prior to\nmatriculation into an Illinois Institute of Technology graduate degree program, subject to\nthe graduate studies rules and restrictions, may be considered for:\n1. External transfer credit for graduate transfer credit use. Applicable course credit\nhours may not have been applied toward any earned degree.\n2. Internal undergraduate transfer credit from Illinois Institute of Technology.\no Shared applicable undergraduate program credit (accelerated master's\nprogram).\no Excess, applicable undergraduate course credit that has not been applied\ntoward any previous degree program.\n3. Shared co-terminal program credit (concurrent bachelor's and master's\nenrollment).\nThe combined limit of nine credit hours may not be exceeded for any master’s degree\nprogram. The credit hours must have been passed with grades of “B” or better, and are\nsubject to the approval of the academic unit and the Office of Academic Affairs.\nDoctoral Transfer Credit\nDoctoral degree candidates may transfer previously completed graduate work not applied\ntoward a prior earned degree up to a maximum of 42 credit hours beyond the\nbaccalaureate degree (which may include up to 32 credit hours from a completed master’s\ndegree) or 50 percent of their total Ph.D. program credit hour requirements, whichever is\nsmaller. The work must be judged to be relevant to the current doctoral program, must have\nbeen completed with grades of ”B” or better, and must be acceptable for graduate credit at\nthe institution where taken. The master’s degree must have been granted within the\nprevious six years. Grades for transferred credits will not be included in the student’s GPA.\nStudent Handbook 146\n\nConsistent with its past practice, research credit may not be submitted for transfer credit\nconsideration. Research credit requirements imply work that has been completed while\nenrolled in an Illinois Institute of Technology research course numbered 594 (master’s\nproject research), 591 (master of science research), or 691 (doctoral research).\nFor more information on transfer credit policies, please consult the Illinois Tech Bulletin.\nDD. Unit of Credit\nAcademic credit is recorded in credit hours. Each credit hour represents one 50-minute\nperiod per week for a 16-week semester. Illinois Tech follows the standard Carnegie Unit,\nrequiring 750 contact minutes of instruction per credit hour, regardless of the length of the\nterm. Non-degree continuing education programs award Continuing Education Units\n(CEU). In general, courses offered only for CEU credit use only Pass/Fail grading.\nEE. Withdrawal Process\n1. Undergraduate degree-seeking students who withdraw from all of their courses are in\neffect withdrawing from Illinois Tech. Non-attendance does not imply withdrawal. All\nrequests for withdrawal begin with the Office of Academic Affairs which will provide\nassistance with the successful resolution of all outstanding obligations to Illinois\nTech. International Students must also comply with additional regulations when\nwithdrawing from Illinois Tech. See https://www.iit.edu/global-services. Any undergraduate\nstudent who is not in attendance for a semester must apply for reinstatement in the Office\nof Academic Affairs.\n2. Graduate students who wish to withdraw from their program must complete a University\nWithdrawal or Leave of Absence Form online. Login to the Illinois Tech portal and look for\nthe Academic Affairs channel under the Academics tab. This must be approved by the\nacademic advisor, academic unit head and the graduate Dean, and filed with the student\nservices center. International students wishing to withdraw must also contact the\nInternational Student Center.\nStudent Handbook 147",
  "metadata": {
    "pages": [
      146,
      147,
      148
    ],
    "word_count": 978
  }
}