{
  "chunk_id": "Student_Handbook_chunk_0071",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "171-172",
  "page_count": 2,
  "text": "Where the Title IX Coordinator signs a Formal Title IX Complaint, the Title IX\nCoordinator is not a complainant or otherwise a party under this sex discrimination\npolicy.\n8. INTERNAL INVESTIGATORY REPORTS\n• A Preliminary Report will be prepared and shared with each party and their\nadvisor, if any, at the conclusion of the investigation and each party shall have 5\ncalendar days to review and provide a written response prior to the completion\nof the summary report.\n• A Summary Report will be prepared prior to the hearing, that summarizes\nevidence collected and sent to each party and their advisor, if any, 5 days before\nthe hearing for their review and written response.\n9. PARTY\nThis means a complainant or respondent.\n10. RESPONDENT\nAn individual named in a report who is alleged to have violated Illinois Tech’s\nprohibition on sex discrimination including sex-based harassment.\n11. RESPONSIBLE EMPLOYEES\nResponsible Employees have an obligation to report immediately any information\nthey come to learn regarding sex discrimination/sex-based harassment. At Illinois\nTech, Responsible Employees are to report such information to officials designated\nby Illinois Tech to have authority to institute corrective measures on the institution's\nbehalf. Illinois Tech has designated individuals holding the following titles/positions\nas Responsible Employees: Office of the Vice Provost for Student Affairs, Title IX\nCoordinator, President, Provost, Vice Presidents/Provosts and those designated to\nserve in the role of Associate and Assistant Vice Presidents/Provosts; academic\ndeans, directors and department chairs; including those serving in associate roles;\nstudent affairs directors; residential life personnel, including resident advisors; Greek\nlife coordinators; athletic administrators, including directors, assistant directors,\ncoaches, assistant coaches and trainers; student activities coordinators; faculty and\nstaff advisors to Illinois Tech recognized student organizations; academic advisors;\nand the Public Safety staff.\nIV. Faculty and staff members who do not meet any of these criteria are not considered\nResponsible Employees, though all such employees, while safeguarding an\nindividual's privacy, are encouraged to share any information that they may learn\nregarding sex discrimination/sex-based harassment so that Illinois Tech may address\nthe same.\n12. SEX-BASED HARASSMENT\nSex-based harassment is a form of sex discrimination and refers to conduct on the\nbasis of sex that satisfies one or more of the following:\n5\n\no Quid Pro Quo Harassment\nAn employee of the recipient to provide an aid, benefit, or service under\nIllinois Tech’s educational program or activity conditioning the provision\nof such an aid, benefit, or service on a person’s participation in\nunwelcome sexual behavior.\no Hostile Environment Harassment\nUnwelcome sex-based conduct, that based on a reasonable person and\nthe totality of the circumstances, is so severe, pervasive, and objectively\noffensive that it effectively denies a person equal access to Illinois Tech’s\neducation program or activity. Whether a hostile environment has been\ncreated is a fact-specific inquiry that includes consideration of the type,\nfrequency, and duration of the conduct, the parties' ages, and the degree\nto which the conduct affected the complainant's ability to access their\neducational program or activity.\no Conduct Prohibited by the Violence Against Women Act\nSexual Assault: An offense classified as a forcible or nonforcible sex offense\nunder the Federal Bureau of Investigation, Criminal Justice Information\nServices, Uniform Crime Reporting (UCR) Program, National Incident-Based\nReporting System (NIBRS), https://www.fbi.gov/services/cjis/ucr/nibrs,\nwhich includes rape, sodomy, sexual assault with an object, or fondling\ndirected against another person, without the consent thereof, including\ninstances where said other person is incapable of giving consent, as\nwell as incest and statutory rape. Consistent with the NIBRS, the following\ndefinitions of these offenses are:\ni. Rape (Except Statutory Rape): The carnal knowledge of\nanother person, without the consent of said person, including\ninstances where the person is incapable of giving consent\nbecause of their age or because of his/her temporary or\npermanent mental or physical incapacity.\nii. Sodomy: Oral or anal sexual intercourse with another person\nwithout the consent of said person, including instances where\nthe person is incapable of giving consent because of their age\nor because of their temporary or permanent mental or\nphysical incapacity.\niii. Sexual Assault with An Object: To use an object or\ninstrument to unlawfully penetrate, however slightly, the\ngenital or anal opening of the body of another person, without\nthe consent of said person, including instances where the\nperson is incapable of giving consent because of their age or\nbecause of their temporary or permanent mental pr physical\nincapacity.\niv. Fondling: The touching of the private body parts of another\nperson for the purpose of sexual gratification without the\nconsent of said person, including instances where the person\nis incapable of giving consent because of their age or because\n6",
  "metadata": {
    "pages": [
      171,
      172
    ],
    "word_count": 767
  }
}