{
  "chunk_id": "Student_Handbook_chunk_0066",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "162-163",
  "page_count": 2,
  "text": "organizations not currently affiliated with the Illinois Tech. It is also to ensure that a healthy\nand thorough process for expansion guides the growth of fraternity or sorority organizations\nat Illinois Tech both organizational and institutional. Illinois Tech affirms that professional\nand social fraternities and sororities constitute an integral part of the campus community.\nRecognizing that membership in a Greek organization is of significant educational value,\nIllinois Tech supports the concept that membership can be a worthwhile component to a\nstudent’s life. Illinois Tech and the Office of Student Life reserve the right to change the\npolicies, procedures, rules, regulations, and information at any time. If you cannot access\nthe policy via the link above and would like a copy, please contact the Assistant Director of\nStudent Life.\n12. Sexual Misconduct/Harassment. In accordance with the Illinois Tech policy on sexual\nmisconduct/harassment, including, but not limited to Title IX Sex Discrimination including\nSex-Based Harassment as defined in Appendix A of this Student Handbook, the Greek\nCouncil will not tolerate or condone any form of sexist or sexually abusive behavior on the\npart of its members, whether physical, mental, or emotional. This is to include any actions,\nwhich are demeaning to women or men. Refer to the various sexual misconduct and\nharassment policies set forth in this Student Handbook, including, but not limited to, the\nCode of Conduct and Appendix A, for more information. In addition to any action taken by\nthe Greek Council or an individual organization, Illinois Tech retains the right to take action\nagainst any sorority or fraternity or any member(s) thereof that violate its policies on sexual\nmisconduct or sexual harassment.\n13. Social Regulations. Illinois Tech expects fraternity and sorority members to accept\nboth personal and group responsibility for meeting recognized standards of good conduct,\nwhich follow all local, state and federal guidelines as well as Illinois Tech, national and/or\nalumni guidelines. Executive board leadership (defined as officers currently serving in a\nrole on the chapter’s leadership team) and any new member expected to be initiated during\nthe current academic year from each chapter are required to attend Risk Minimization\ntraining at the beginning of each semester, as scheduled by the Office of Residence Life. A\nchapter’s absence from Risk Minimization training or improperly registered social events\nmay result in judicial action by Greek Council, Office of Student Life, or the Office of\nStudent Affairs.\nStudent Handbook 161\n\nVIII. STUDENT TRAVEL POLICY\nA. Purpose\nIllinois Tech seeks to promote safe travel to events and activities occurring beyond the\nboundaries of its campuses by students and recognized student organizations. This policy\napplies to individual student travel and to recognized student organization travel, both in\ncases where the travel is sponsored by Illinois Tech and in cases where the travel is\nindependent of Illinois Tech sponsorship, but where an individual student or a recognized\nstudent organization travels on behalf of, or with the financial support of, one or more\nIllinois Tech academic or administrative units and/or recognized student organizations.\nTravel beyond the boundaries of the Illinois Tech campus but within Cook, DuPage, Lake,\nMcHenry or Will Counties, whether sponsored by Illinois Tech or not, is considered a field\ntrip and is not subject to this Policy.\nB. Definitions\nAn “appropriate administrator” is the President, Provost, an academic Dean, a Vice\nProvost, or the Dean of Students, or the authorized designee of any of the foregoing.\nA “recognized student organization” is one that has been formed for educational,\nprofessional, social, recreational or other lawful purposes, derives the majority of its\nmembership and all of its leadership from the student body of Illinois Tech, has been\napproved for recognition by the Office of Student Life and maintains a current registration\nstatus with the Office of Student Life.\nA “travel summary” is a written summary prepared by the organizing individual or group\nthat, at a minimum, details the purpose of the travel, sets forth the full travel itinerary,\nincluding all lodging and contact information, and lists all participants and their relation to\nIllinois Tech. This will be provided by students in the Dean of Students travel form.\n“Illinois Tech sponsored student travel” is travel involving a student or students that (i) is\ninitiated, actively managed, planned and arranged by a member of Illinois Tech’s faculty or\nstaff, or members of a recognized student organization with the approval of an appropriate\nadministrator; or (ii) has Illinois Tech financial, physical or administrative involvement or\noversight. Illinois Tech sponsored student travel does not include travel under the auspices\nof Illinois tech’s Department of Athletics or study abroad programs under the auspices of\nIllinois Tech’s Office of Global Services.\nStudent Handbook 162",
  "metadata": {
    "pages": [
      162,
      163
    ],
    "word_count": 775
  }
}