{
  "chunk_id": "Student_Handbook_chunk_0040",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "104-105",
  "page_count": 2,
  "text": "misconduct, delayed reporting may make it more difficult to find and convict/discipline the\naccused. Thus, an individual who experienced sexual misconduct is encouraged to\nconsider filing a report with the police; filing a report does not obligate the victim to press\ncharges or pursue legal action. In order to preserve evidence, a victim should strongly\nconsider obtaining an appropriate medical examination as soon as possible. Although\nIllinois Tech does not have the staff or facilities to do so, the emergency rooms at Mercy\nHospital (2525 S. Michigan Avenue / (312) 567-2000) and University of Chicago Hospital\n(5841 S. Maryland Avenue / (773) 702-1000) do, including conducting a forensic\nexamination. Such an examination often serves a valuable evidentiary purpose.\nCompletion of a forensic examination does not require one to file a police report.\n2. ORDER OF PROTECTION\nIf desired, one who has experienced sexual misconduct may seek an order of protection\n(750 ILCS 60/214) or no contact order (740 ILCS 22/101.1 et seq.) from an Illinois court. The\ndecision to grant such an order in any particular instance is at the discretion of the court. If\nsuch an order is issued, Illinois Tech will honor it as and to the extent required by law.\nAdditional information on orders of protection and the process for obtaining such an order\nis available on the website of the Cook County Clerk of the Circuit Court at\nwww.cookcountyclerkofcourt.org/domestic-violence-resources\nwww.cookcountyclerkofcourt.org/?section=SERVRESPage&SERVRESPage=orderprot.\n3. PROCESS\nComplaints will be investigated by the Office of Title IX Compliance, or by designated\nindividuals who have received training to conduct such investigations, or, if warranted,\ndisciplinary proceedings will be initiated according to (i) the procedures outlined in the\nCode of Conduct as supplemented by the provisions of this Section N, or (ii) if the sexual\nmisconduct qualifies as Title IX Sex Discrimination as defined in Appendix A, then the\nprocedures set forth in Appendix A. In either case, the preponderance of the evidence\nstandard will be used in all investigations and hearings pertaining to cases of sexual\nmisconduct. Sanctions for cases of sexual misconduct will vary based on the nature and\nseverity of the situation as well as the perpetrator's prior disciplinary history, if any. The full\nrange of applicable sanctions is listed under Article II Section C (Conduct Sanctions) of the\nCode of Conduct. Pursuant to applicable policy, sanctions of suspension and expulsion\nare automatically stayed and referred to the Provost for review. The Provost may make any\ndetermination outlined in the applicable appeals process, and such determination shall\nStudent Handbook 103\n\nnot be subject to further appeal on the basis that the sanction imposed was inappropriate\nto the offense.\nIf voluntarily agreed to by the parties and Illinois Tech, an allegation of sexual misconduct\nunder the Code of Conduct may be subject to informal resolution pursuant to the process\nset forth in Article IV, Section M.4.A. (An allegation of Title IX Sex Discrimination may be\nsubject to informal resolution pursuant to the process set forth in Appendix A.) Further, in\ncases of sexual misconduct under the Code of Conduct, the reporting party and\nresponding party will not be permitted to directly question one another, unless both such\nparties have agreed to such questioning in writing. In the case where such mutual\nagreement does not exist, each may suggest questions to be posed by the chair of the\nCampus Judicial Board or the Dean of Students (or designee), as the case may be. Upon\nrequest of either the reporting party or responding party, at any time during proceedings\nunder the Code of Conduct, Illinois Tech will provide reasonable accommodations to\nensure that the reporting party and responding party are separated, while still being able to\nhear one another. Both the reporting party and responding party (i) will have equal access\nto the same information to be provided pursuant to the Code of Conduct in connection\nwith a disciplinary proceeding and (ii) will be afforded the same opportunity to participate\nin the process equally, meaning the reporting party will have the same rights and options as\nare afforded to the responding party under the Code of Conduct. Finally, consistent with\nthe process and procedures and within the timeframes provided for in the Code of\nConduct, both the reporting party and responding party will have the same right to appeal a\ndecision made and/or sanction imposed in matters involving complaints of sexual\nmisconduct. (Again, please consult Appendix A to review the processes and procedures\napplicable to the Title IX Sex Discrimination Process.)\n4. CONFIDENTIALITY\na. General\nIllinois Tech will generally seek to protect the privacy of all parties to a complaint or other\nreport of sexual misconduct to the extent possible, and a number of the procedures\noutlined in this Student Handbook are intended to facilitate Illinois Tech's ability to do so.\nIllinois Tech will, to the extent permitted by law, also seek to ensure that the name and\nidentifying information of an individual who has experienced sexual misconduct is not\nincluded in any publicly available records. However, when a complaint of sexual\nmisconduct is received, Illinois Tech may well have an independent legal obligation to\nStudent Handbook 104",
  "metadata": {
    "pages": [
      104,
      105
    ],
    "word_count": 855
  }
}