{
  "chunk_id": "Student_Handbook_chunk_0014",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "48-49",
  "page_count": 2,
  "text": " Expulsion. Expulsion is the complete severance of association with Illinois\nTech. Notation of the violation of the Code of Academic Honesty is generally made\non the student’s transcript.\nIn any matter where the DDAD’s determination is to impose a sanction of suspension or\nexpulsion, the DDAD’s determination shall automatically be stayed and the matter referred\nto the Provost for review. With respect to such a proposed determination by the DDAD, the\nProvost may make any of the determinations set forth under the Appeals Procedures\nheading immediately following. Once the Provost’s review has been completed, the\nDDAD’s determination, as it may have been modified by the Provost, shall become\neffective. Notwithstanding any other provision of this Student Handbook, no matter so\nreferred to the Provost shall be subject to any further appeals on the basis that the\nsanction imposed was inappropriate to the offense.\nWith respect to any and all proceedings noted above, an individual accused of violating the\nCode of Academic Honesty will be notified of the decision of such proceeding via\nelectronic notification. The decision will be sent to their registered iit.edu e-mail address.\nSuch notification will serve as the individual’s formal and official notification of the\ndecision in the relevant proceeding. It is the individual’s sole responsibility to monitor their\nemail for the decision. The date any such decision is e-mailed will serve as the start date\nfor any time period within which a student must take action to commence any subsequent\naction, proceeding, or appeal.\nC. APPEAL PROCEDURES\nAn appeal of a decision regarding academic honesty made pursuant to Sections B.2 or B.3\nmust be submitted in writing to the Dean of Students (dos@illinoistech.edu) within five\ncalendar days of notification of the decision. Supporting information must be submitted\nwith the appeal. An appeal or submission made after this deadline will not be considered,\nand issues not raised in a timely submitted appeal will also be deemed to have been\nwaived. In both cases, this means that any decision(s) and sanction(s), as the case may\nbe, shall be final.\nStudent Handbook 47\n\nDecisions rendered by the DDAD without referral to the University Faculty Council’s\nAcademic Grievance Committee and sanctions (excluding non-punitive grades) imposed\nby a course instructor may be appealed to the Academic Grievance Committee, which in\nthe latter instance only may either affirm or overturn the finding of academic dishonesty.\nUpon such an appeal, the Academic Grievance Committee will supplement its\nmembership to form an academic disciplinary committee that is composed as described\nabove and that follows hearing procedures as described above. The decision of such\ncommittee with respect to these matters shall be final.\nDecisions of the DDAD following an academic disciplinary committee hearing may be\nappealed to the Provost, whose decision shall be final. An appeal to the Provost is limited\nto the following reasons:\n The procedures outlined above were not substantially followed and such\noccurrence reasonably could be deemed to have impacted the outcome;\n Subject to the limitation noted in Section B.3 above relative to sanctions of\nsuspension and expulsion, the sanction imposed was inappropriate for the offense;\nand\n New evidence that was not available at the time of the original decision, not due to\nthe fault or lack of diligence of the student, has become available.\nWithin 30 calendar days of receipt of the appeal, the Provost may make one of the following\ndeterminations:\n Uphold the decision and the sanction;\n Reverse the decision and/or modify, enhance or lessen, the sanction; or\n Uphold the decision, but return the matter to the DDAD to reconsider the sanction.\nII. CODE OF CONDUCT AND CONDUCT DISCIPLINE\nWith respect to matters covered by this Article II, except for the making of allegations of\nSexual Misconduct (as defined in Article II, Section A(12) and Article IV, Section N) and Title\nIX sex discrimination including sex-based harassment (as defined in Appendix A) and the\ninvestigation, adjudication and disciplining of such allegations, students enrolled in or\notherwise attending programs of Illinois Tech’s Chicago-Kent College of Law, and only such\nStudent Handbook 48",
  "metadata": {
    "pages": [
      48,
      49
    ],
    "word_count": 678
  }
}