{
  "chunk_id": "Student_Handbook_chunk_0031",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "85-86",
  "page_count": 2,
  "text": "Per applicable law, students receiving Title IV grants, loans, or federal work-study who are\nconvicted of a drug offense involving illegal drugs while enrolled at Illinois Tech will lose\ntheir eligibility for such funds.\n1. Legal sanctions. Federal and Illinois law prohibits the unlawful manufacture,\npossession, use or distribution of controlled substances, including, but not limited\nto, marijuana, narcotics, barbiturates and cocaine. Violation of such federal or\nIllinois law may result in arrest and conviction. An individual so convicted may be\nfined and/or imprisoned in accordance with applicable federal and Illinois law. The\nPolicy details the specific potential sentences and/or fine that can possibly be\nimposed for the manufacture, possession, use or distribution of various controlled\nsubstances. Illinois Tech reserves the right to contact the Chicago Police\nDepartment for assistance with respect to the violation of any Illinois law.\nTHE SALE OR DISTRIBUTION OF ALCOHOL TO OR POSSESSION OF ALCOHOL BY\nPERSONS UNDER THE AGE OF 21 IS PROHIBITED UNDER ILLINOIS LAW. A PERSON WHO\nVIOLATES THIS LAW MAY BE CHARGED AND PUNISHED ACCORDINGLY.\n Health Risks. Individuals who use illegal drugs or abuse alcohol risk adverse\nphysical and psychological effects. In general, such individuals may suffer from\nillnesses and are less productive, less reliable and more prone to accidents and\nabsenteeism. Ingestion of drugs or alcohol by a pregnant woman may cause harm\nto the fetus. A more specific explanation of the possible health effects of certain\ntypes of drugs as well as alcohol is available in the Student Health and Wellness\nCenter and in the Policy.\n Counseling. Illinois Tech has a comprehensive drug-free awareness program to\ninform students about the dangers of drug and alcohol use and to assist them in\nobtaining counseling and treatment that includes full availability of the Student\nHealth and Wellness Center to all students for counseling and/or referral for\ntreatment; educational programs for students, including forums, dissemination of\neducational materials, and awareness periods (e.g., Alcohol Awareness Week); and\nother programs and publications as needed. Students are encouraged to contact\nthe Student Health and Wellness Center for information or assistance regarding\ndrug or alcohol use. If you suspect a fellow student is involved in illegal drug or\nalcohol use, encourage them to seek assistance from the appropriate office.\n Sanctions. Any student suspected of violating this Policy is subject to disciplinary\naction in accordance with the Illinois Tech Code of Conduct. Sanctions will depend\nStudent Handbook 84\n\nupon (a) the severity of the infraction; (b) if personal injury is involved; (c) if property\ndamage occurs; (d) whether the student is a repeat offender; and (e) if the campus\nlearning environment is compromised. Students may also be subject to criminal\nprosecution where appropriate. Further, for students, a fine structure may\naccompany disciplinary proceedings for all violations of the Policy. The fine\nimposed must be paid in full in order for a student to continue in good academic\nstanding, and therefore, be allowed to register for classes and receive grades. The\nfines are as follows:\nFirst offense: $50.00\nSecond offense: $100.00\nA third documented violation of the Policy: $250 and possible immediate suspension of\ncampus housing privileges as well as suspension or expulsion from Illinois Tech.\nNotwithstanding any other provision of this Policy and in addition to any other sanction that\nmay be imposed by the Dean of Students or their designee or the Campus Judicial Board,\nthe housing contract of any student who either admits to or is found to have used or\npossessed illegal drugs in any Illinois Tech residence hall may be immediately canceled,\nand in such circumstance, the student must move out of the residence hall within 72\nhours. The student will be financially responsible for the remainder of their room and board\ncontract and their parents may be notified.\nG. Statement of Financial Responsibility\nIllinois Tech is providing you this information to ensure you understand the commitment\nthat you are making with respect to the payment of your tuition, fees and other costs during\nyour terms of enrollment at Illinois Tech, and by registering for courses at Illinois Tech, you\nare acknowledging that you have received, read and understood this information and\nagreed to these terms and conditions.\n1. Your student account includes charges and credits assessed to you during your\nenrollment at Illinois Tech, including, without limitation, tuition, room, board, fees,\nexpenses, health insurance premiums, financial aid credits and adjustments,\npayments made to your account, service charges for late payment, and various\nfines. You may view your student account at any time through the Illinois Tech\nportal.\nStudent Handbook 85",
  "metadata": {
    "pages": [
      85,
      86
    ],
    "word_count": 761
  }
}