{
  "chunk_id": "Student_Handbook_chunk_0079",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "182-183",
  "page_count": 2,
  "text": "5. AFTER THE INVESTIGATION OF A FORMAL TITLE IX COMPLAINT:\nThe Title IX Coordinator or designee and the Title IX Decision-Maker will comply with\nthe following:\nXXV. Designation of Decision-maker: The Title IX Coordinator or designee will identify\none Title IX Decision-maker for the Formal Title IX Complaint, which cannot include\nthe Title IX Coordinator or designee, or the Title IX Investigator or Title IX Informal\nResolution Facilitator, if any, assigned to the Formal Title IX Complaint.\nXXVI. Live Hearing: A live hearing will be provided as part of the sex discrimination/sex-\nbased harassment process. The live hearing will comply with the following\nrequirements:\nXXVII. The live hearing may, upon the request of either the complainant or the respondent,\nbe held virtually, with parties located in separate rooms with technology enabling the\nTitle IX Decision-Maker and parties to simultaneously see and hear the party or\nwitness answering questions. Any live hearing may, at the discretion of the Title IX\nDecision-Maker, also be held virtually as outlined above. Unless the live hearing is\nconducted virtually, all parties must be physically present in the same geographic\nlocation.\nXXVIII. All hearings will be documented through audio recording, audiovisual recording, or\ntranscript, at Illinois Tech’s discretion, and will be made available to the parties for\ninspection or review.\nXXIX. At the hearing, the Title IX Decision-Maker must permit each party’s advisor to ask\nthe other party and any witnesses all relevant questions and follow-up questions,\nincluding those that challenge credibility; such questions are referred to as “cross-\nexamination.” Only relevant cross-examination may be asked of a party or witness.\nWith respect to cross-examination:\nXXX. Questions and evidence about the complainant’s sexual predisposition or prior sexual\nbehavior are not relevant, unless such questions and evidence about the\ncomplainant’s prior sexual behavior are offered to prove that someone other than the\nrespondent committed the conduct alleged by the complainant, or if the questions\nand evidence concern specific incidents of the complainant’s prior sexual behavior\nwith respect to the respondent and are offered to prove consent.\nXXXI. The Title IX Decision-Maker must explain to the party proposing the questions any\ndecision to exclude a question as not relevant.\nXXXII. Cross-examination at the live hearing must be conducted by the party’s advisor, and\nnever by the party. If a party does not have an advisor present at the live hearing,\nIllinois Tech will provide an advisor of its choice, without charge to the party, who\nmay be, but likely not will be, an attorney to conduct cross-examination on behalf of\nthe party.\nXXXIII. If a party or witness does not submit to cross-examination at the live hearing, the Title\nIX Decision-Maker may still consider and rely on any statement of that party or\nwitness in reaching a determination regarding responsibility. However, the Decision-\nMaker cannot draw an inference about the determination regarding responsibility\nbased solely on the party or witness’s absence or refusal to answer cross-examination\nor other questions.\nXXXIV. Burdens: Illinois Tech, as the party bearing the burden of proof during the\ninvestigation and adjudication of Formal Title IX Complaints, will meet this burden\n16\n\nduring the live hearing by presenting at the live hearing the relevant evidence\ngathered by the investigator summarized in the investigative report\nXXXV. Statements: The complainant and respondent shall each be afforded the opportunity\nto make an opening and closing statement and to suggest to the Title IX Decision-\nMaker what they would consider an appropriate sanction in the event that the Title\nIX Decision-Maker were to find the respondent responsible for all or some of the\nallegations brought against the respondent. All such statements are to be made by the\ncomplainant and respondent; advisors may not make such statements on their\nbehalf.\nXXXVI. Live Hearing Procedures. The Title IX Decision-Maker may establish rules for the\nlive hearing, which may include, but are not limited to, governing decorum, setting\ntime limits for opening and closing remarks, empowering the Title IX Decision-Maker\nto take a temporary recess, and any such other rules deemed prudent for the effective\nand efficient conduct of the live hearing; provided, however, any such rules must be\nconsistent with this policy and must apply equally to the complainant and\nrespondent. Any rules applicable to the hearing will be included in the notice of\nhearing.\nXXXVII. Written Determination: Within 21 calendar days of receipt of the final written\nresponses and evidence from the parties, the Title IX Decision-Maker must issue a\nwritten determination regarding responsibility. To reach this decision, the Title IX\nDecision-Maker must apply the preponderance of the evidence standard, regardless\nof whether the respondent is a student or an employee. The written determination\nmust include:\nXXXVIII. Identification of the allegations potentially constituting sex discrimination/sex-based\nharassment;\nXXXIX. A description of the procedural steps taken from the receipt of the Formal Title IX\nComplaint through the determination, including any notifications to the parties,\ninterviews with parties and witnesses, site visits, methods used to gather other\nevidence, and hearings held; ○ Findings of fact supporting the determination;\nXL. Conclusions regarding the application of this sex discrimination/sex-based\nharassment process to the facts;\nXLI. A statement of, and rationale for, the result as to each allegation, including a\ndetermination regarding responsibility, any disciplinary sanctions Illinois Tech will\nimpose on the respondent, and whether remedies designed to restore or preserve\nequal access to Illinois Tech’s education program or activity will be provided by\nIllinois Tech to the complainant; and\nXLII. Illinois Tech’s procedures and permissible bases for the complainant and respondent\nto appeal.\nXLIII. Notice of Written Determination: The Title IX Decision-maker or a designee must\nprovide the written determination to the parties simultaneously.\nXLIV. Appeal: Both parties may appeal from either a determination regarding\nresponsibility or from Illinois Tech’s dismissal of a Formal Title IX Complaint or any\nallegations therein, on the following bases:\nXLV. Procedural irregularity or error that affected the outcome of the matter;\n17",
  "metadata": {
    "pages": [
      182,
      183
    ],
    "word_count": 984
  }
}