{
  "chunk_id": "Student_Handbook_chunk_0076",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "179-179",
  "page_count": 1,
  "text": "informal resolution processes can utilize a broad range of conflict resolution\nstrategies, including mediation, facilitated communication, and/or restorative justice\npractices.\nAs an initial matter, the Title IX Informal Resolution Facilitator typically will meet\nwith each party separately—in person, by telephone, or by videoconference in one or\nmore meetings, at the Title IX Informal Resolution Facilitator’s discretion—to\ndescribe the process, including the role of the Title IX Informal Resolution Facilitator;\nto gain an understanding of each party’s feelings, positions, and wishes with respect\nto resolution of the Title IX Formal Complaint; and to gather necessary information\nto identify any harm caused and opportunities loss. Any remaining steps of the\nprocess may be effectuated through separate or joint meetings of the parties with the\nvoluntary agreement from the parties.\nThough the facts and circumstances surrounding each Formal Title IX Complaint are\nunique, in general, the Title IX Informal Resolution Facilitator will seek to facilitate its\nresolution, and this may be accomplished by one or more of the following options,\nwhich options are intended to be exemplary, not exhaustive:\nVI. Participation in educational programming;\nVII. Changes in academic, work, and living arrangements;\nVIII. Assistance with requesting academic allowances and extensions;\nIX. Writing an impact statement;\nX. Writing a statement acknowledging harm caused; and\nXI. Restrictions of contact between the parties.\nThe Title IX Informal Resolution Facilitator does not have the power to make decision for\neither party but will attempt to help them fund a mutually agreeable resolution and create\na document for execution by all parties that summarizes the freely agreed-upon solutions.\nOnce a resolution agreement has been executed, Illinois Tech will neither resume nor\ninitiate the sex discrimination/sex-based harassment process with respect to any\nallegations resolved in therein or arising out of the same facts or circumstances as those\nallegations. If a party fails to fulfill the terms of the resolution agreement, Illinois Tech\nmay initiate a Code of Conduct violation under Article II of the Student Handbook for\nFailure to Comply with the Code of Conduct charge.\n3. DURING THE INVESTIGATION OF A FORMAL TITLE IX COMPLAINT AND\nTHROUGHOUT THIS SEX DISCRIMINATION/SEX-BASED HARASSMENT\nPROCESS:\nThe Title IX Team must:\nXII. Burdens: Ensure that the burden of proof and the burden of gathering evidence\nsufficient to reach a determination regarding responsibility rest on Illinois Tech and\nnot on the parties, provided that Illinois Tech cannot access, consider, disclose, or\notherwise use a party’s records that are made or maintained by a physician,\npsychiatrist, psychologist, or other recognized professional or paraprofessional\nacting in the professional’s or paraprofessional’s capacity, or assisting in that\ncapacity, and which are made and maintained in connection with the provision of\ntreatment to the party, unless Illinois Tech obtains the voluntary, written consent to\n13",
  "metadata": {
    "pages": [
      179
    ],
    "word_count": 457
  }
}