{
  "chunk_id": "Student_Handbook_chunk_0058",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "144-145",
  "page_count": 2,
  "text": "The Vice Provost of Student Affairs and Dean of Students or designee may communicate\nwith essential personnel regarding the proposed plan and, if such plan is adopted, will take\nnecessary steps to ensure its implementation and/or any necessary monitoring. If a\nstudent is subject to an intervention or is involuntarily withdrawn pursuant to this policy, to\nthe extent appropriate and practicable, conditions for their return to Illinois Tech may be\nspecified in writing by the Vice Provost of Student Affairs and Dean of Students or designee.\n6. Appeal of Intervention and/or Involuntary Withdrawal. A student who is subject to an\nintervention or involuntarily withdrawn pursuant to this policy may make a written request\nto the Vice Provost of Student Affairs and Dean of Students or designee for an informal\nproceeding to review the determination. To be timely, any such appeal must be received by\nthe Vice Provost of Student Affairs and Dean of Students or designee within three (3)\nbusiness days of the determination. Upon receipt of such an appeal, the Vice Provost of\nStudent Affairs and Dean of Students shall timely notify the Provost, who will conduct (or\nhave conducted) the informal proceeding as provided for herein.\nThe Provost or designee shall conduct the informal proceeding within seven (7) business\ndays of receipt of the written appeal. In no event will the same individual, who imposed the\nintervention or involuntary withdrawal, conduct this informal proceeding. The informal\nhearing is generally limited to sixty to ninety (60-90) minutes in duration, unless the Provost\nor designee, in their discretion, determines that additional time is necessary. The student\nwill be provided with the following prior to the informal proceeding: (i) a written statement\nproviding a detailed explanation of the reasons for intervention or involuntary withdrawal\nand the information relied upon; and (ii) the opportunity to review the evaluations relied\nupon by the Vice Provost of Student Affairs and Dean of Students or designee.\nAt the informal proceeding, the student may choose to be assisted by an appropriate\nadvisor, which may include a parent or guardian, a health professional of the student’s\nchoice, and/or a faculty or staff member. The student may also have legal counsel present\nfor consultation purposes only during the informal proceeding. In addition, subject to an\ninformal determination regarding relevancy by the Provost or designee, the student will be\npermitted to be heard and to present witnesses and information to dispute the reasons for\nthe intervention or involuntary withdrawal, or the information relied upon in making the\ndetermination.\nStudent Handbook 143\n\nThe student shall provide to the Provost or designee, and be responsible for identifying in\nwriting, those witnesses and the subject matter of their expected testimony five (5) days in\nadvance of the informal proceeding. The Provost or designee and the student will review\nthat identification three (3) days before the informal proceeding and will agree upon a\nmeans of participation for all persons that the Provost or designee deem relevant and\nnecessary. The student will generally be expected to secure attendance of any witnesses,\nother than Illinois Tech employees and individuals which the student is barred from\ncontacting due to the issuance of a non-contact order or similar such directive issued by\nIllinois Tech or court, which the Provost or designee will seek to secure.\nAs to an involuntary withdrawal, following the informal proceeding, the Provost or designee\nshall determine whether to (a) uphold the withdrawal; (b) reinstate the student; or (c)\nreinstate the student subject to specified conditions, including, without limitation,\nparticipation in an ongoing health treatment program, acceptance of and compliance with\na behavioral contract, a housing relocation, reduced course load, or any combination\nthereof. The Provost or designee may modify the conditions of readmission at any time. The\ndecision of the Provost or designee shall be final.\n7. Return to Illinois Tech. A student who has been removed from Illinois Tech or\nwithdrawn from Illinois Tech pursuant to this policy, who wishes to be considered for return\nto Illinois Tech shall contact the Vice Provost of Student Affairs and Dean of Students or\ndesignee and provide: (i) a statement from the student describing the reasons they believes\nthey should return to school; (ii) a release to allow the Student Health and Wellness Center\nto obtain information from the student’s treatment provider; (iii) an assessment by the\ntreatment provider regarding the student’s readiness to return to classes, and (iv)\nappropriate documentation to demonstrate compliance with the conditions for returning, if\nany are imposed, and the applicable reinstatement and/or readmission policies of the\nOffice of Undergraduate or Graduate Academic Affairs as appropriate. The student may\nalso present any relevant documentation or information which the student believes\nsupports their request to return.\nIn making a decision, the Vice Provost of Student Affairs and Dean of Students or designee\nwill review the request to return as follows: (a) review and investigate compliance with the\nconditions of return, if any; (b) consult with the appropriate academic unit to determine\nwhether the student is eligible for return based upon the student’s academic record and\nStudent Handbook 144",
  "metadata": {
    "pages": [
      144,
      145
    ],
    "word_count": 847
  }
}