{
  "chunk_id": "Student_Handbook_chunk_0043",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "110-111",
  "page_count": 2,
  "text": "engage in specific sexual or intimate conduct by one not suffering from incapacitation (as\ndefined below). Consent must be all of the following:\nKnowing: Consent must demonstrate that all individuals are in a state of mind to\nunderstand, to be aware of, and to agree to the \"who\" (same partners), \"what\" (same acts),\n\"where\" (same location), \"when\" (same time), and \"how\" (the same way and under the\nsame conditions) of sexual or intimate activity.\nActive: Consent must be communicated in clearly understandable words or actions that\nreveal one's expectations and agreement to engage in specific sexual or intimate activity.\nThis means that silence, passivity, submission, or the lack of verbal or physical resistance\n(including the lack of a \"no\") should not - in and of itself - be understood as consent.\nConsent cannot be inferred by an individual's manner of dress, the giving or acceptance of\ngifts, the extension or acceptance of an invitation to go to a private room or location, or\ngoing on a date.\nVoluntary: Consent must be freely given and cannot be the result of force (violence,\nphysical restraint, or the presence of a weapon); threat or coercion (defined below); or\nfraud (misrepresentation or material omission about oneself or the present situation in\norder to gain permission for sexual or intimate activity).\nPresent and ongoing: Consent must exist at the time of the sexual or intimate activity.\nConsent to previous sexual or intimate activity does not imply consent to later sexual or\nintimate acts; similarly, consent to one type of sexual or intimate activity does not imply\nconsent to other sexual or intimate acts. Consent may also be withdrawn at any time by the\nperson making known, by articulated word or concrete action, his or her intention to\nwithdraw it, and thereupon, the sexual or intimate activity should immediately cease.\nThreat or Coercion: The direct or implied threat of force, violence, danger, hardship, or\nretribution sufficient to persuade a reasonable person one would have to submit. Coercive\nbehavior differs from seductive behavior based on the type of pressure someone uses to\nget consent from another. A person's words or conduct cannot amount to coercion unless\nthey wrongfully impair the other's freedom of will or ability to choose whether or not to\nStudent Handbook 109\n\nengage in sexual activity. When someone makes it clear that they do not want to engage in\nsexual activity, that they want to stop, or they do not want to go past a certain point of\nsexual interaction, continued pressure beyond that point can be threatening or coercive.\nIncapacitation:\ni. The inability to understand the nature of the activity or to give knowing consent;\nii. The inability to understand the \"who, what, when, where, and how\" of a situation;\niii. When a person is sufficiently intoxicated, high, intellectually disabled or the like such\nthat the\nperson is not capable of understanding and appreciating what is happening; or\niv. The legal inability to give effective consent because of age or declared incompetent.\nb. Specific Acts of Sexual Misconduct\nAs set forth in the Code of Conduct, Illinois Tech prohibits sexual misconduct. Such\nconduct violates the community values and principles of Illinois Tech and disrupts the\nliving, learning, and working environment for students, faculty, staff and other community\nmembers. Therefore, Illinois Tech's Code of Conduct prohibits the actions noted in the\nCode of Conduct as the same are defined below. An attempt to commit any such act, as\nwell as assisting or willfully encouraging any such act, is also considered a violation of the\nCode of Conduct. An act may violate one or more provisions of the Code of Conduct; thus,\nIllinois Tech reserves the right to bring multiple charges against an individual for a single\nact. As circumstances warrant, a student may also be held responsible for the misconduct\nof their visitors and guests. The terms and definitions below are important components of\nIllinois Tech's Code of Conduct. The definitions are intended to give meaning to these\nterms in the context of the Illinois Tech community.\ni. Sexual Assault\nThe following each are considered a form of sexual assault:\n Sexual Penetration without Consent (e.g., rape): Any penetration of the sex organs\nor anus of another person when consent is not present, or any penetration of the\nmouth of another person with a sex organ when consent is not present. This\nStudent Handbook 110",
  "metadata": {
    "pages": [
      110,
      111
    ],
    "word_count": 731
  }
}