{
  "chunk_id": "Student_Handbook_chunk_0032",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "87-88",
  "page_count": 2,
  "text": "2. Each semester, a billing statement will be made available to you and such other\nresponsible party that you designate (e.g., parent or guardian) through the Illinois\nTech portal. The bill will detail charges, payments and other credits to your account,\nincluding the amount you must pay and the date such payment is due. All\nnotifications of new billing statements will be sent via email to your Illinois Tech\nemail address. You are expected and you agree to monitor your Illinois Tech email\naccount regularly.\n3. If any payments that you make overpay the charges on your account, a credit will be\nplaced on your student account to be applied toward future charges, unless you\ncontact the Student Accounting Office to request a refund of the overpayment or\nyou cease to be enrolled.\n4. By registering for classes, you are expressly promising to assume and to take\nfinancial responsibility for the payment of all your education related charges and\nfees that become a part of your student account, when those charges are due,\nregardless of your expected reliance on third-party resources such as financial aid,\nfamily gifts, employer reimbursement, private loans, outside scholarship, grants,\nawards or sponsorships. Any balance due as the result of adjustments made to your\nestimated or confirmed financial aid or your refusal to apply for any or all of your\nfinancial aid or your inability to complete the financial aid verification shall be your\nresponsibility to pay. You agree to supply the Financial Aid Office with any\nreasonable information or documents that they may request to complete the\nverification process in a timely manner.\n5. By registering for classes, you acknowledge and agree that any outstanding balance\ndue on your student account that is not timely paid when due is subject to service\ncharges in the amounts or at the rates established and published by Illinois Tech\nfrom time to time and that, to the fullest extent allowed by law, you will be prevented\nfrom registering for additional courses at Illinois Tech or obtaining official\ndocuments such as diplomas or transcripts until that outstanding balance has been\npaid in full. You also acknowledge that failure to pay any amount due by the due\ndate may result in an unfavorable report with credit bureaus and collection activities\nagainst you, including litigation and that Illinois Tech has the right to recover any\ncollection and/or litigation costs so incurred.\nStudent Handbook 86\n\nH. Health Insurance Requirement Policy\nAll students registered for one academic credit or more are required to have health\ninsurance. Additionally, Illinois Tech requires all international students to purchase Illinois\nTech's health insurance, provided through Aetna Student Health. All students will be\nenrolled in the Student Health Insurance Plan (SHIP) when they register for at least one\ncredit hour during the academic year.\nThe premium for the insurance will be added to student tuition and fees as a charge. To\navoid this charge, a student must submit proof of comparable coverage online, before the\ndeadline of the first semester you wish to waive coverage for at\nhttp://web.iit.edu/shwc/insurance. To be clear, the onus is on the student to demonstrate\nthat they have comparable coverage and to make the required submission by the\ndeadline. If such information is submitted after that date, the student will be liable for the\nsemester’s health insurance charge regardless of the fact that they may in fact have\ncomparable coverage.\nIllinois Tech automatically enrolls international students registered for at least one credit\nhour or more into Illinois Tech's health insurance plan, provided through Aetna Student\nHealth. Waivers for comparable health insurance plans may apply. Please review our\nwaiver policy. Please direct questions to student.health@illinoistech.edu.\nI. Media Policy\nAll engagements with media representatives by Illinois Tech students on campus and/or on\nbehalf of Illinois Tech, should be coordinated with the Office of Marketing and\nCommunications at least three full business days in advance, in order to promote and\nprotect the public reputation of Illinois Tech, build openness and accountability, and\nrespect the media's role. It is Illinois Tech’s responsibility to provide accurate and\nconsistent information to the media and avoid any misunderstanding, misinterpretation, or\nconfusion.\nThe Office of Marketing and Communications should be notified about all media inquiries.\nAll Illinois Tech press releases, media notices, media outreach and advisories must be\ncoordinated and approved by the Office of Marketing and Communications. Students have\nno right to invite or allow media representatives in Illinois Tech facilities or on Illinois Tech\nproperty. Media representatives may only access, use or otherwise conduct business in\nStudent Handbook 87",
  "metadata": {
    "pages": [
      87,
      88
    ],
    "word_count": 759
  }
}