{
  "chunk_id": "Student_Handbook_chunk_0055",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "137-139",
  "page_count": 3,
  "text": "provider’s assessment, conditions may be placed upon a student who returns from a\nmedical leave of absence. These conditions may include, but are not limited to, a reduced\ncourse load, and continued medical or mental health treatment along with a signed\nrelease to allow verification of the student’s adherence to their treatment plan.\nX. Registration Holds and Controls\nStudents with unpaid balances, disciplinary sanctions, unmet immunization requirements,\nor other such conditions to warrant a registration hold are prevented from enrolling in\nclasses until the condition is resolved and the hold is removed.\nRegistration controls including prerequisites, co-requisites, maximum hours, level, and\nprogram restrictions may also exist to limit or prevent registration in specific\ncircumstances. Students should consult their adviser, resolve all holds, and take note of\nany registration restrictions that pertain to their student status and course selection, prior\nto their appointed registration date for an upcoming term.\nFor more information, go to iit.edu/registrar/registration.\nY. Reinstatement To Illinois Tech\nStudents who have withdrawn or taken a leave of absence and now wish to return to Illinois\nTech must submit an application for reinstatement to the Office of Academic Affairs. The\ndeadlines for reinstatement are June 15 for the fall semester, November 15 for the spring\nsemester and April 15 for the summer term. Students must submit official transcripts from\nall colleges and universities attended since last enrolled at Illinois Tech. In some cases,\nadditional interviews may be required for Reinstatement. International students must\ncontact the Office of Global Services in addition to submitting an application for\nReinstatement/Readmission. See iit.edu/global-services for more information.\nStudents who were on academic probation when they stopped attending or were placed on\nAcademic Suspension will be reinstated on probation if approved. In these cases, students\nmust submit a personal statement explaining what led to them being placed on\nprobation/suspension, and a plan for future success. The application will be reviewed by\nthe major department and an interview may be required. Students who wish to change\ntheir major must adhere to all university academic policies and procedures.\nStudent Handbook 136\n\nStudents who are returning from a medical leave will need to submit appropriate\ndocumentation from their health care provider with their application. See section W.2 for\nmore information.\nWith respect to both undergraduate and graduate students, if they were suspended for\ndisciplinary reasons, the student’s reinstatement application must be reviewed by the\nOffice of Student Affairs.\nZ. Repeating a Course\nUndergraduate students may repeat a course for a grade exclusion. A request to repeat a\ncourse for a grade exclusion must be submitted through the online form\n(iit.edu/ugaa/services), during registration. Both grades will be recorded on all transcripts\nissued. Only the second grade will be used to compute the GPA, even if the second grade is\nlower, except when the second grade is I, R, S, U, W, X, or AU. The course repeat policy is as\nfollows:\n A course repeated for a grade change must be taken within one calendar year after\ninitial enrollment in that course or the next time it is offered (whichever is longer).\n The same course may be repeated only once for a change of grade.\n A maximum of three 100-level and 200-level courses may be repeated for a change\nof grade. A maximum of three 300-level and 400-level courses may be repeated for a\nchange of grade. Course repeats not used for 100 and 200 level courses cannot be\ncarried forward to 300 and 400 level courses.\n Re-registration for courses in which a student received a C grade or better grade\nrequires the approval of the student's academic advisor.\n If a course is no longer offered by Illinois Tech, the provision to repeat the course for\na grade change does not apply.\nGraduate Students may repeat up to three distinct courses with each course being\nrepeated once. Both grades will be recorded and the grade used in the calculation of the\nStudent Handbook 137\n\nGPA will be the latest recorded. The Course Repeat Form on the Office of the Registrar’s\nwebsite should be used to request a repeat (see\nhttps://www.iit.edu/registrar/registration/course-repeat-policy). All repeat requests are\nreviewed by Academic Affairs prior to approval. The original course grade earned will\nremain on the student’s academic transcript.\nAA. Residence Requirements\n1. Undergraduate: All undergraduate degree-seeking students must observe the following\nresidence requirements:\nOnce enrolled at Illinois Tech, a student is not permitted to enroll at another institution\nwithout obtaining permission. A student must submit an academic petition to the Office of\nUndergraduate Academic Affairs for approval prior to registration at another institution.\nA course completed (passed or failed) at Illinois Tech must be repeated at Illinois Tech. No\ntransfer credit will be awarded for any course equivalent to a course completed at Illinois\nTech.\nFor a bachelor’s degree, the final 45 semester hours of work must be completed in\nresidence at Illinois Tech. Any proficiency examinations or enrollment at another institution\nmust be completed before this period.\n2. Graduate: Degree-seeking graduate students are required to register every fall and\nspring semester unless they receive special permission in writing from the Office of\nAcademic Affairs for a leave of absence. In addition, doctoral students must spend a\nminimum of one year of full-time study at the university. That year must occur within six\nyears prior to awarding the degree.\nThe College of Architecture and the Institute of Design have academic residence\nrequirements for master’s degrees. To be eligible to receive a doctorate in any discipline at\nIllinois Tech, a student must spend a minimum of two regular semesters or three quarters\nin full-time study on campus. In special cases, two summers of research or other day\nStudent Handbook 138",
  "metadata": {
    "pages": [
      137,
      138,
      139
    ],
    "word_count": 948
  }
}