{
  "chunk_id": "Student_Handbook_chunk_0036",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "96-97",
  "page_count": 2,
  "text": " Home address and phone number of student;\n Positions held, place of employment, and extension number of students employed\nby Illinois Tech;\n Department of specialization and educational level (undergraduate; non-degree-\nseeking student; graduate student in masters or Ph.D. program) and most recent\ninstitution previously attended;\n Membership in officially recognized campus organizations and on teams; offices\nheld in such organizations;\n Degrees earned and special awards and recognition given, including, without\nlimitation, Dean’s List and scholarships awarded based on academic or other\nachievement (as opposed to those based on need); and\n Photograph of student.\nSuch directory information available from educational records kept by Illinois Tech may\nalso be released concerning former students at Illinois Tech for the time during which they\nwere registered as students at Illinois Tech.\n5. Procedures for Requesting Amendment of Educational Records\nA student may request that their educational records be amended if the student believes\nthe records contain information that is inaccurate, misleading or in violation of the\nstudent’s privacy rights. The request should be made in writing to the Illinois Tech official\nmaintaining the record and state specifically which part of the records should be amended\nand explain why the student believes such part is inaccurate, misleading or a violation of\ntheir privacy rights. The Illinois Tech official will review the request and respond to the\nstudent within a reasonable amount of time. If there is a decision to amend the record, the\nstudent will be informed of such in writing.\nIf the Illinois Tech official decides against amending the record, the student may request a\nhearing on the matter. The request for a hearing must be in writing and be directed to the\nRegistrar, who shall appoint a hearing officer to decide the matter. The hearing officer, a\ndisinterested person in the matter, will conduct a hearing during which the student may be\nassisted, but only in an advisory fashion, by an advisor of their choosing. The hearing\nStudent Handbook 95\n\nofficer shall prepare a written decision based on the hearing, which will contain a summary\nof what was presented and the reasons for the decision. The decision of the hearing officer\nshall be final and non-appealable. If there is a decision to amend the record, the student\nwill be informed of such in writing. If the hearing officer denies the student’s request to\namend their record, the student will be notified in writing of their right to place in the record\na statement commenting on the challenged information or stating why the student\ndisagrees with the decision. This statement will remain a part of the student’s record along\nwith the contested portion of the record for as long as the record is maintained. The\nstatement will be disclosed whenever the contested portion of the record is disclosed.\nStudents must complete an Educational Record Amendment FERPA Form to request\nchanges to their records, which can be found on the Registrar’s website.\n6. FERPA Complaint Procedure\nStudents and eligible parents have the right to file a complaint with the U.S. Department of\nEducation concerning alleged failures by Illinois Tech to comply with requirements of\nFERPA. In many situations, complaints relative to FERPA can be resolved within Illinois\nTech on an informal basis. Any student who wishes to discuss a FERPA complaint may\ncontact the Office of the Registrar, located at 10 W. 35th Street, 2nd Floor, Chicago, IL\n60616.To file a FERPA complaint with the U.S. Department of Education, contact the Office\nthat administers FERPA at: Family Policy Compliance Office, U.S. Department of\nEducation, 400 Maryland Avenue, SW., Washington, DC, 20202-5920. For additional\ninformation, refer to https://studentprivacy.ed.gov\nM. Policy and Procedures on Sexual Harassment\n1. General Statement Against Sexual Harassment\nIllinois Tech is committed to ensuring an environment for all members of its community\nthat is fair, humane, and respectful - an environment that supports and rewards student,\nfaculty and staff performance on the basis of relevant considerations such as ability and\neffort. Behaviors that inappropriately assert sexuality as relevant to student, faculty or staff\nperformance damage this environment. Sexual harassment by any member of the Illinois\nTech community is prohibited. Sexual harassment includes peer harassment among\nstudents, staff or faculty. Sexual harassment by a faculty member or teaching assistant of a\nstudent over whom they have authority or by a supervisor of a member of the faculty or\nstaff can be particularly serious. Such conduct may easily create an intimidating, hostile or\nStudent Handbook 96",
  "metadata": {
    "pages": [
      96,
      97
    ],
    "word_count": 745
  }
}