{
  "chunk_id": "Student_Handbook_chunk_0077",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "180-180",
  "page_count": 1,
  "text": "do so from that party. During the investigation, Illinois Tech will meet its burden by\nundertaking a search for the relevant, available facts and evidence pertaining to a\nparticular case, while operating under the time frames, constraints and procedures\nset for in this sex discrimination/sex-based harassment process and without the\npower to subpoena. Such conditions may limit the extensiveness and\ncomprehensiveness of Illinois Tech’s ability to gather evidence.\nXIII. Equal Treatment – Evidence Presentation: Provide an equal opportunity for the\nparties to present any inculpatory or exculpatory evidence, including fact and expert\nwitnesses. Illinois Tech will not restrict the ability of either party to discuss the\nallegations under investigation or to gather and present relevant evidence.\nXIV. Equal Treatment – Advisors: Provide the parties with the same opportunity to be\naccompanied to any related meeting or proceeding by an advisor of choice, who may\nbe, but is not required to be, an attorney, and not limit the choice or presence of an\nadvisor for either the complainant or respondent in any meeting or proceeding.\nDuring an investigation, advisors are free to act as a support for the party, but they\ncannot speak on behalf of the party in any way. During the live hearing, the advisor’s\nprimary role is to conduct the cross-examination. They may provide other forms of\nsupport for the party, but they cannot represent or speak on behalf of the party during\nthe live hearing unless engaged in cross-examination. If a party wishes, Illinois Tech\nwill provide an advisor of its choice, without charge to the party, who may be, but\nlikely not will be, an attorney to conduct cross-examination during the hearing on\nbehalf of the party\nXV. Written Notice of Meetings: Provide, to a party whose participation is invited or\nexpected, including, without limitation, the complainant and respondent and witness,\nwritten notice of the date, time, location, participants, and purpose of all investigative\ninterviews and other meetings, with sufficient time for the party to prepare to\nparticipate, which in no case shall be less than 48 hours.\nXVI. Equal Opportunity – Evidence Review: Provide both parties and their advisors, if\nany, an equal opportunity to inspect and review any evidence obtained as part of the\ninvestigation that is directly related to the allegations raised in a Formal Title IX\nComplaint, including evidence upon which Illinois Tech does not intend to rely in\nreaching a determination regarding responsibility and inculpatory or exculpatory\nevidence whether obtained from a party or other source, so that each party can\nmeaningfully respond to the evidence prior to conclusion of the investigation. Prior\nto completion of the investigative report, the Title IX Investigator(s) must send to\neach party and the party’s advisor, if any, the evidence subject to inspection and\nreview in an electronic format or a hard copy, and the parties must have at least five\ncalendar days to submit a written response, which the Title IX Investigator(s) will\nconsider prior to completion of the Summary Investigative Report.\nXVII. Investigative Report: Within 90 Business Days of receipt of the Formal Title IX\nComplaint, the Title IX Investigator will create a Summary Investigative Report that\nfairly summarizes relevant evidence and, at least five calendar days prior to a live\nhearing or other time of determination regarding responsibility, send to each party\nand the party’s advisor, if any, the investigative report in an electronic format or a\nhard copy, for their review and written response.\n14",
  "metadata": {
    "pages": [
      180
    ],
    "word_count": 574
  }
}