{
  "chunk_id": "Student_Handbook_chunk_0035",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "94-95",
  "page_count": 2,
  "text": "The term school officials shall include parties such as: professors; instructors;\nadministrators; health staff; counselors; attorneys; clerical staff; trustees; members of\ncommittees and disciplinary boards; and a contractor, volunteer or other party to whom\nthe school has outsourced institutional services or functions. A school official generally\nhas a legitimate educational interest if the official needs to review an education record in\norder to fulfill their professional responsibility as an employee of Illinois Tech; provided\nhowever, the records reviewed shall be limited to those needed to fulfill the particular\nresponsibility at issue.\n3. Student Accessibility of Educational Records\nUpon written request, students and former students of Illinois Tech shall be granted access\nto their personally identifiable educational records originated at and maintained by Illinois\nTech or submitted to Illinois Tech in connection with their admission, employment or the\ngranting of financial assistance with the following exceptions:\n Notes or records of instructors, advisors or counselors that would not be shown to\nany other individual except another faculty member, an advisor or a teaching\nassistant;\n For records involving other individuals (e.g., course grade lists, disciplinary reports)\nonly that portion applicable to the respective student will be disclosed;\n Records or statements supplied by the individuals within or outside Illinois\nTech and other educational institutions or agencies that have been submitted under\nthe assumption of confidentiality in connection with the admission, employment\nor provision of financial assistance, including financial statements provided\nby parents for purposes of supporting the student’s application for financial\naid; and letters of recommendation written, for which the student has signed a\nwaiver of the right to inspect the letter; and\n Records of medical or psychological tests or treatment. The student nevertheless\nhas the right to obtain a professional explanation of information in such records and\nto request that the records be referred for inspection to another qualified\nprofessional of the student’s choice.\nStudent Handbook 93\n\nFor records originating at Illinois Tech, any person or organization having the right of access\nto any educational record may also obtain a copy of that record at a reasonable fee. In\ngeneral, Illinois Tech will not provide to anyone, other than authorized faculty and staff at\nIllinois Tech or as required by law, copies of any items in a student’s educational record\nthat have been submitted by individuals or organizations outside Illinois Tech; such copies\nshould be requested from the source from which the record originated. An exception may\nbe made in instances when the student can demonstrate that the original record has been\nlost, destroyed or is otherwise unavailable (e.g., international students from schools no\nlonger in existence or the death of a person from whom a reference was obtained). A\ncumulative record of all individuals or organizations other than the individual student and\nauthorized faculty and staff at Illinois Tech who are granted access to and/or copies of a\nspecific educational record will be maintained along with that record. On making a\nrequest, a student may inspect the cumulative list of all those who have been granted\naccess to their educational record.\nThe right to inspect educational records does not apply to applicants for admission until\nsuch time as the applicant may be admitted, has completed registration and is in\nattendance at Illinois Tech.\nStudents and former students of Illinois Tech may make an appointment to inspect\nindividual educational records during regular office hours. To make an appointment, please\ncontact the Office of the Registrar at 312.567.3100 or registrar@illinoistech.edu, located at\n10 W. 35th street Tower 2C8-1 Chicago IL 60616.\n4. Directory Information\nIllinois Tech reserves the right, absent submission of a written request by the student to the\nOffice of the Registrar indicating that they do not want Illinois Tech to release their directory\ninformation, to release at its own discretion the following items of directory information\nabout any student registered during a given term. Directory information includes:\n Name of student;\n Date and place of birth;\n Dates of attendance at Illinois Tech;\n Local address, phone number and e-mail address of student;\nStudent Handbook 94",
  "metadata": {
    "pages": [
      94,
      95
    ],
    "word_count": 680
  }
}