{
  "chunk_id": "Student_Handbook_chunk_0072",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "173-174",
  "page_count": 2,
  "text": "of their temporary or permanent mental or physical\nincapacity.\nv. Incest: Nonforcible sexual intercourse between persons who\nare related to each other within the degrees wherein marriage\nis prohibited by law.\nvi. Statutory Rape: Nonforcible sexual intercourse with a person\nwho is under the statutory age of consent.\nDating Violence – Violence committed by a person: (1) who is or has\nbeen in a social relationship of a romantic or intimate nature with\nanother person, and (2) where the existence of such a relationship\nshall be determined based on a consideration of the length of the\nrelationship, the type of relationship, and the frequency of\ninteraction between the persons involved in the relationship. 34\nU.S.C. §12291(a)(10).\nvii. Domestic Violence – Any felony or misdemeanor crimes of\nviolence committed by (i) a current or former spouse or\nintimate partner of a person, (ii) someone with whom a\nperson shares a child in common, (iii) a person who is\ncohabitating with or has cohabitated with another as a spouse\nor intimate partner, (iv) a person similarly situated to a\nspouse under the domestic or family violence laws of the\njurisdiction, or (v) any other person against an adult or youth\nwho is protected from that person’s acts under the domestic\nor family violence laws of the jurisdiction. 34 U.S.C.\n§12291(a)(8).\nStalking – Engaging in a course of conduct, whether in-person or via\nany electronic, telephonic computer or digital means, directed at the\nTitle IX Complainant that would cause a reasonable person to: (1)\nfear for his or her safety or the safety of others, or (2) suffer\nsubstantial emotional distress. 34 U.S.C. §12291(a)(30).\n13. STUDENT EMPLOYEE\nA student whose primary relationship with the Illinois Tech is to receive an education,\nand the student works for the Illinois Tech, and while performing work-related\nservices learns of conduct that may constitute sex discrimination/sex-based\nharassment under Illinois Tech’s Title IX policy has a duty to report the alleged\nconduct to the Office of Title IX Compliance.\nAll Illinois Tech employees (including student employees) and graduate students\nwith teaching or supervisory authority are obligated to promptly report sex\ndiscrimination, or sex-based harassment, of which they become aware in the scope of\ntheir work for Illinois Tech to the Office of Title IX Compliance.\n14. SUPPORTIVE MEASURES\nWhen Illinois Tech is notified of conduct that reasonably may constitute Title IX sex\ndiscrimination/sex-based harassment the Title IX Coordinator or designee may offer\nand coordinate non-disciplinary, non-punitive, individualized services offered as\n7\n\nappropriate, and as reasonably available, without fee or charge to a complainant or\nrespondent. Such measures are designed to restore or preserve equal access to the\nuniversity’s education program or activity without unreasonably burdening the other\nparty, including measures designed to protect the safety of all parties or the\nuniversity educational environment and deter Title IX sex discrimination/sex-based\nharassment. Supportive Measures may include but are not limited to counseling,\nextensions of work assignment deadlines, modification of work schedules, campus\nescort services, mutual restrictions on contact between the parties, changes in work\nlocations, leaves of absence, work and housing changes and other similar measures.\nThe Title IX Coordinator or designee will be responsible for coordinating the effective\nimplementation of supportive measures; provided, however, the Title IX Coordinator\nmay designate other Illinois Tech Officials to assist with implementing Supportive\nMeasures. Illinois Tech will maintain as confidential any supportive measures\nprovided to the complainant or respondent, to the extent that maintaining such\nconfidentiality would not impair the ability of Illinois Tech to provide the supportive\nmeasure. Illinois Tech may not impose any disciplinary sanctions or other actions that\nare not supportive measures against a respondent until a determination of\nresponsibility has been issued as required by Title IX and its regulations.\n15. TITLE IX APPELATE DECISION-MAKER\nAn individual designated by Illinois Tech to conduct an appeal required by\nthe Title IX sex discrimination/sex-based harassment process. The Title IX\nAppellate Decision-maker cannot be the Title IX Coordinator, Title IX\nInvestigator, Title IX Decision-maker or Title IX Informal Resolution\nFacilitator assigned to the same Formal Title IX Complaint, must be free\nfrom conflicts of interest or bias against complainants and respondents\ngenerally and against an individual complainant or respondent, and must be\ntrained to properly implement Illinois Tech’s Title IX grievance procedures\nand to serve impartially.\n16. TITLE IX COORDINATOR\nThe individual designated and authorized by Illinois Tech to coordinate its efforts to\ncomply with and carry out its responsibilities under the regulations implementing\nTitle IX at 85 Fed. Reg. 30026, 30026-30579. The identity of and contact information\nfor the Title IX Coordinator is as follows: Virginia Foster, foster@illinoistech.edu,\n312-567-5725 and is also available on the Title IX Office website at\nhttps://www.iit.edu/title-ix/title-ix-compliance. The Title IX Coordinator may\ndelegate authority to perform any task under this Title IX sex discrimination/sex-\nbased harassment to any duly trained individual.\n17. TITLE IX DECISION-MAKER\nAn individual designated by the Title IX Coordinator or designee to reach a\ndetermination regarding responsibility in a Formal Title IX Complaint by applying\nthe preponderance of the evidence standard of proof in a proceeding conducted\nin accordance with this Title IX sex discrimination/sex-based harassment\n8",
  "metadata": {
    "pages": [
      173,
      174
    ],
    "word_count": 854
  }
}