{
  "chunk_id": "Student_Handbook_chunk_0044",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "112-113",
  "page_count": 2,
  "text": "includes penetration or intrusion, however slight, of the sex organs or anus of\nanother person by an object or any part of the body, specifically including\ncunnilingus, fellatio, vaginal intercourse, and anal intercourse.\n Sexual Contact without Consent (e.g., fondling): Knowingly touching or fondling a\nperson's genitals, breasts, thighs, groin, or buttocks, or knowingly touching a person\nwith one's own genitals, breasts or buttocks, when consent is not present. This\nincludes contact done directly or indirectly through clothing, bodily fluids, or with an\nobject. It also includes causing or inducing a person, when consent is not present,\nsimilarly to touch or fondle oneself or someone else.\n Incest: Sexual intercourse between persons who are related to each other within\nthe degrees wherein marriage is prohibited by the laws of the state in which the\nincident occurred.\n Statutory Rape: Sexual intercourse with a person who is under the statutory age of\nconsent under the laws of the state in which the incident occurred, which, under the\nlaws of the State of Illinois, the age of consent is 17.\nii. Sexual Exploitation\nTaking sexual advantage of another person for the benefit of oneself or a third party in any\nof the following ways or by any of the following means, including via electronic means,\nmethods or devices, includes but not limited to:\n Sexual voyeurism or permitting others to witness or observe the sexual or intimate\nactivity of another person without that person's consent;\n Indecent or lewd exposure or inducing others to expose themselves when consent\nis not present;\n Recording or taking, without regard to any distribution, photos, imagines, video or\nthe like of (i) any person engaged in sexual or intimate activity or who is naked or\notherwise in a state of undress, (ii) who is in a private space or a place where the\nperson has a reasonable expectation of privacy, and (iii) without that person's\nconsent;\n Distributing in any format, including electronic and via social media, and without\nregard to who took or created the same, sexual information or photos, images,\nvideos or the like, of the type described in 3 above, about or of another person\nwithout that person's consent;\nStudent Handbook 111\n\n Recruiting, harboring, transporting, providing, or obtaining another person for the\npurpose of sexual exploitation;\n Inducing incapacitation in another person with the intent to engage in sexual\nconduct, regardless of whether prohibited sexual conduct actually occurs.\niii. Stalking\nThe following elements constitute stalking:\n1. Engaging in a course of conduct, meaning two or more acts, that is directed at a\nspecific person; and\n2. In which a perpetrator – directly, indirectly or through third parties – by any action,\nmethod, device or means, including electronic: follows, monitors, observes,\nsurveils, threatens or communicates to or about said person or interferes with said\nperson's property; and\n3. Such that a reasonable person, meaning one under similar circumstances and with\nsimilar identities to the person to whom in the conduct is directed, would: fear for\ntheir safety or the safety of others; or suffer substantial emotional distress, meaning\nsignificant mental suffering or anguish regardless of whether such anguish does or\ndoes not require medical or other professional treatment or counseling.\nProvide all of the foregoing elements are satisfied, the following is a non-exhaustive list of\nexamples of acts that could constitute stalking: following a person; being or remaining in\nclose proximity to a person; entering or remaining on or near a person's property,\nresidence, or place of employment; using electronic devices to monitor, observe or\nconduct surveillance of a person; threatening, by word or deed, a person; unwelcome,\nincessant electronic or telephonic communication or electronic posting to or about a\nperson; giving gifts or objects to or leaving items for a person; and interfering with or\ndamaging a person's possessions or pets.\niv. Dating/Domestic Violence\nA pattern of physical or psychological actions by one person directed at another in the\ncontext of a dating family of household relations. The following are an example of such\nacts: Intimidation; harassment; physical abuse, including hitting, slapping, shoving,\nStudent Handbook 112",
  "metadata": {
    "pages": [
      112,
      113
    ],
    "word_count": 684
  }
}