{
  "chunk_id": "Student_Handbook_chunk_0012",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "44-45",
  "page_count": 2,
  "text": "3. The acquisition, without permission, of tests, answer sheets, problem solutions or\nother academic material when such material has been withheld from distribution by\nthe instructor;\n4. Deliberate and harmful obstruction of the studies, research or academic work of\nany member of the Illinois Tech community;\n5. Making a material misrepresentation in any submission to or through any office of\nIllinois Tech to a potential employer, agency, professional society, meeting, or\norganization, which includes, without limitation, any unauthorized access to Illinois\nTech’s digital or electronic systems for the purposes of altering or seeking to alter or\nsubmitting or seeking to submit false, misleading or inaccurate information; or\n6. The intentional assistance of others in the violation of the standards set forth in this\nCode of Academic Honesty.\nB. ACADEMIC DISCIPLINE\n1. General. Any member of the Illinois Tech community who is aware of a violation of the\nCode of Academic Honesty, or who has evidence that a violation has occurred, is urged to\ninform the appropriate course instructor, academic unit head or dean or send an email to\nacademichonesty@illinoistech.edu. Faculty members or administrators who are aware of\na violation, or who have good faith evidence of a violation, must report the infraction to the\nDesignated Dean of Academic Discipline (DDAD) via\nhttps://web.iit.edu/ugaa/academic-honesty (both graduate and undergraduate) or at\nacademichonesty@illinoistech.edu. As discussed below, punitive actions on the part of\nthe course instructor in relation to academic honesty must also be reported to the DDAD.\nFor the Mies Campus, the Rice Campus, the Moffett Campus, and Institute of Design, the\nDDAD is the Vice Provost for Academic Affairs. For Chicago-Kent College of Law, the DDAD\nis the Assistant Dean of Students, and for the Stuart School of Business, it is the Dean.\n2. Action by a Course Instructor. If a course instructor believes that a violation described\nin Section A.1, A.2 or A.3, or that is otherwise prohibited by this Code of Academic\nDishonesty and directly relates to a course has occurred, they are advised to meet with the\nstudent. During the meeting, the instructor must inform the student of the nature of the\nStudent Handbook 43\n\ninfraction and explain why it is an issue of academic honesty. After that allowance, the\nstudent has an opportunity to respond to the alleged violation. Following the meeting, if the\ncourse instructor determines the violation occurred, they are required to report the\nviolation, a summary of the facts evidencing the violation (including the course syllabus\nand or course materials that explain or point to sources that explain academic honesty and\nplagiarism appropriate to the discipline) and the sanction to the DDAD. Appropriate\nsanctions include:\n Reduction in grade. A reduction in grade for the assignment or exam involved or for\nthe course may be applied.\n Expulsion from a course. The student is assigned a punitive failing grade of ‘E’ for\nthe course and can no longer participate in the course or receive further evaluation\nof coursework from the instructor; provided, however, the course instructor may\nonly impose this sanction after discussing it with and securing the written\nagreement of the DADD.\nA course instructor may consult with the unit head or dean for the appropriate unit or\nfaculty colleague during the process so long as they do not disclose personally identifiable\ninformation about the student. This consultation is expected to be for the sole purpose of\nseeking input to assist in making an equitable decision based on the infraction and\nsupporting evidence.\n3. Duties of and Actions by the DADD. The DDAD will provide a record of all incidents to\nthe Office of Student Affairs. A student who believes that their record is factually\ninaccurate must inform the Dean of Students (dos@illinoistech.edu) within seven calendar\ndays of the date they become aware or should have become aware of such inaccuracy.\nAssuming timely notification, the Dean of Students or designee will investigate, as they\ndeem appropriate, and, if they determine necessary, in their sole discretion, will correct\nany factual inaccuracies in the record. The decision of the Dean of Students as to such\nmatters shall be final.\nIn addition to any punitive action taken by a course instructor pursuant to Section B, if a\nstudent has been found to have committed one or more prior violations under this Code of\nStudent Handbook 44",
  "metadata": {
    "pages": [
      44,
      45
    ],
    "word_count": 718
  }
}