{
  "chunk_id": "Student_Handbook_chunk_0061",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "151-152",
  "page_count": 2,
  "text": "D. Organization Property\nAll property, equipment and supplies purchased for a student organization by Illinois Tech\nand/or with organizational funds shall be defined as Illinois Tech property in the care of the\norganization and organization leaders. Organization leaders and members are responsible\nfor the proper care and appropriate use of such property. If an organization becomes\ninactive for any reason, the property must be returned and surrendered to Illinois Tech. The\nOffice of Student Life has space available in the basement of the MTCC for the storage of\nIllinois Tech owned property. Contact a staff member of the Office of Student Life for more\ninformation.\nE. Disciplinary Procedures\nIllinois Tech expects student organizations, including fraternities and sororities, and their\nrespective members to accept both personal and group responsibility for meeting\nrecognized standards of good conduct. Organizations are expected to conduct their\nbusiness in an honest, ethical fashion and to cooperate with Illinois Tech officials as\nrequested. Officers must accept responsibility for control of organization events and\nensure proper behavior of students and guests in attendance. Organizations shall operate\nin accordance with (i) any policy, procedure, process or protocol, temporary or otherwise,\nthat Illinois Tech may adopt, and (ii) any directive of an Illinois Tech official, which is\nintended to minimize the risk to Illinois Tech and its faculty, students, staff, alumni and\nvisitors from an epidemic, pandemic, other public health matter or federal, state or city\nemergency declaration. Organizations will be held responsible for damages to Illinois Tech\nproperty and/or equipment resulting from their use. Organizations are expected to follow\nall Illinois Tech and SGA/Finance Board procedures, rules and policies as well as all\napplicable laws of city, state and federal governments.\nAnyone may initiate a complaint against a student organization. (A complaint may be filed\nusing this link and can also take the form of an Illinois Tech Department of Public Safety\nincident report regarding inappropriate behavior or misconduct.) Disciplinary action may\nbe taken against organizations, including fraternities and sororities, for failure to follow any\nof the procedures, rules or policies delineated in this Student Handbook, including, but not\nlimited to, those related to events (as defined in Section G below) and violations of the\nCode of Conduct. Such action may also be taken against organizations that no longer are\nfulfilling the purpose upon which their recognition was based. In its discretion, the Office of\nStudent Handbook 150\n\nStudent Affairs or Office of Student Life may process infractions that either deems to be\nminor. If the organization wishes to appeal the decision of the Office of Student Affairs or\nOffice of Student Life with respect to such infractions or if the infraction is deemed not to\nbe minor by the Office of Student Affairs or the Office of Student Life, then an\nadministrative hearing will be held before the Vice Provost and Dean of Students, or\ndesignee, in accordance with the procedures for such a hearing established under the\nCode of Conduct (see, generally, Article II, Section B above for details of such process).\nSanctions for infractions may include, but are not limited to, one or more of the following:\nConduct Warning. An official written notification that an organization’s behavior is in\nviolation of Illinois Tech regulations or standards, which also clarifies expected behavior in\nthe future. This sanction may or may not carry with it conditions or restrictions of\nprivileges.\nConduct Probation. This is a form of probation placed upon an organization for its\nmisconduct. The intent of Conduct Probation is for an organization to correct its behavior\nand return to good standing within the Illinois Tech community. Certain restrictions and/or\neducational sanctions may also apply to this form of probation. Conduct Probation is to be\ndesignated to remain in effect for a specified duration.\nDisciplinary Probation: This is the most serious form of probation issued by Illinois Tech.\nA student organization placed on Disciplinary Probation is required to correct their\nbehavior immediately in order to remain a member of the Illinois Tech community. This\nform of probation may also include additional restrictions and/or educational sanctions\nand is designated to remain in effect for a specified time (e.g., one semester, one academic\nyear).\nRestitution. An organization is required to make monetary restitution for theft of or\ndamage to Illinois Tech property or to that of a member of the Illinois Tech community, or\nfor expenses incurred as a result of the organization’s actions.\nFines. Illinois Tech reserves the right to assess against an organization a fine for\nmisconduct. The amount of any fine will be determined based on the severity of the\ninfraction(s), whether the organization has been found responsible for prior infractions, and\nthe need for deterrence of future infractions.\nSuspension of Social Event Privileges. An organization may not sponsor or partner in any\nevent involving alcohol on or off campus. Any proposed event involving guests in affiliation\nwith the organization, with or without alcohol, must receive approval from the Dean of\nStudent Handbook 151",
  "metadata": {
    "pages": [
      151,
      152
    ],
    "word_count": 828
  }
}