{
  "chunk_id": "Student_Handbook_chunk_0030",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "83-84",
  "page_count": 2,
  "text": "After composition of the Grievance Committee to hear a specific grievance has been\ndetermined, the Grievance Committee shall select a chair from among its membership.\n3. Grievance Committee Procedure\nAt the initial meeting of the Grievance Committee, where the chair is selected by the\nCommittee’s members, the Grievance Committee will also establish a hearing date. The\nchair will communicate to the parties the date of the hearing and names of the members of\nthe Grievance Committee. Notice of the hearing date and members must be provided to\nthe parties within at least five calendar days of the date for the hearing. Any involved party\nwho believes a member of the Grievance Committee may have a conflict of interest may\nrequest that such person be excused; provided that the party must do so within two\ncalendar days of receipt of the notice or the party will be deemed to have waived their right\nto so object. Such a request must be submitted in writing with reasons for the request to\nthe Provost or designee, who will decide whether or not to grant the request. If the decision\nis made to excuse that person, a replacement will be appointed in the same manner as the\nperson who was excused.\nEach involved party may be accompanied by an advisor of their choosing, but the advisor is\nlimited to advising and may not participate in presenting the case, questioning witnesses,\nor making statements during the hearing. At the hearing, the grievant and the involved\nparties will be given an opportunity to make a statement as to the facts and circumstances\nsurrounding the alleged discriminatory practice. Each party may present any witnesses\nwhose statements would be helpful in presenting or defending the charge. At the discretion\nof the Grievance Committee, additional witnesses may be granted the opportunity to make\nstatements. The Grievance Committee may question any of the participants in the hearing,\nas it deems such inquiry necessary to its determination of the issues involved. An audio\ntape recording of the hearing will be made. The tape will remain the property of Illinois\nTech. No other recording of the proceeding may be made.\nAfter the hearing, the Grievance Committee will review the grievance and submit a written\nreport to the Provost. Such determination will include a summary of the operative facts and\nan opinion as to the validity of the grievance. The report may include a recommendation as\nto any further action to be taken.\nStudent Handbook 82\n\nThe Provost will then consider the Grievance Committee’s findings and decide on feasible\nand appropriate action for Illinois Tech to take in the disposition of the charge. Such\ndecision shall be communicated to the grievant, the charged party and the Director. In the\nevent that the Provost should be named in the grievant’s charge, the President shall\ndesignate the Provost’s replacement for implementing these procedures. The decision of\nthe Provost shall be final, except that the grievant or the charged party may request, within\nfive calendar days of the decision’s communication, that the Provost reconsider their\ndecision; provided, however, any such request must be based only on one or both of the\nfollowing considerations: (i) the procedures outlined above were not substantially followed\nand such occurrence reasonably could be deemed to have impacted the outcome; and (ii)\nnew evidence that was not available at the time of the original decision, due to no fault or\nlack of diligence of the grievant, has become available.\n4. General Rules\n Illinois Tech will not be responsible for any expenses incurred by students pursuing\nany grievances.\n Students will have the right to present a grievance without prejudice or retaliation.\n The time limitations established herein are deemed to be binding on all parties\ninvolved and will not be waived without the written consent of all parties.\nF. Policy on Drugs and Alcohol\nIllinois Tech is committed to preventing the use of illicit drugs and abuse of alcohol by\nmembers of its community. In accordance with this commitment and in compliance with\nthe Drug Free Schools and Campuses Act of 1989, Illinois Tech has adopted a Policy on\nDrugs and Alcohol that affirms its goal to maintain an environment that is free of illegal\nusage of drugs and alcohol. This Policy is at the following link:\nweb.iit.edu/sites/web/files/departments/general-counsel/policies/Drug-FreeSchoolsPolicy.pdf, and the\nterms of the policy are expressly incorporated into this Student Handbook by this\nreference. All students are expected to comply with this Policy. The following is intended\nto provide a summary introduction to this Policy as well as to establish the fine structure\nnoted below, which is one of the sanctions that may be imposed for violations of this\nPolicy. In the event of any conflict between the provisions of this Section F and the Policy,\nthe Policy shall control.\nStudent Handbook 83",
  "metadata": {
    "pages": [
      83,
      84
    ],
    "word_count": 802
  }
}