{
  "chunk_id": "Student_Handbook_chunk_0068",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "166-167",
  "page_count": 2,
  "text": " Any travel undertaken without submission of a complete and accurate travel\nsummary or not in accordance with an approved travel summary or otherwise in\nviolation of this Student Travel Policy may result in individual and/or organizational\ndiscipline as outlined in this Student Handbook, together with such additional\naction as may be deemed appropriate under the circumstances. All travel\nparticipants are expected to comply with the standards set forth in this Student\nHandbook and with applicable Illinois Tech policies, procedures and rules.\nViolations of the foregoing requirements may subject participants and sponsoring\norganizations to disciplinary action as outlined in this Student Handbook.\n The faculty member or administrator responsible for the travel shall communicate\nto the participants that Illinois Tech does not provide medical insurance for any\nstudent's participation in travel. All student participants shall be responsible for\nmedical costs they incur during and/or as a result of the travel.\n When travel is specific to a Student Life recognized student organization, the\norganization will be responsible for attending a mandatory travel presentation (once\nper semester). All attendees traveling on behalf of a recognized student organization\nmust also complete the Student Organization Travel Behavioral Agreement,\navailable on the Office of Student Affairs website.\n Unless express permission has been granted by the appropriate administrator,\nfriends and family members of Illinois Tech students, faculty and staff are not\neligible to participate in Illinois Tech sponsored student travel.\nStudent Handbook 165\n\nAPPENDIX A\nTITLE IX SEX DISCRIMINATION\nEFFECTIVE JANUARY 9, 2025\n2020 TITLE IX FINAL RULE\nNON-DISCRIMINATION POLICY\nThe Title IX Educational Amendments of 1972 prohibits discrimination based on sex in\neducation programs and activities that receive federal assistance. No person shall, on the basis\nof sex, be excluded from participation in, be denied the benefits of, be subjected to\ndiscrimination under any education program or activity receiving federal financial assistance.\nIt is the intention and commitment of Illinois Tech to not discriminate on the basis of sex in\nour educational program or activities. The types of discrimination that are covered under Title\nIX include but are not limited to: sex-based harassment, sexual violence (sexual assault,\ndomestic and dating violence, and stalking), admission, employment, disability, marital or\nparental status including pregnancy or related conditions, and access to and treatment in the\nprograms and activities of Illinois Tech. This policy is effective as of January 9, 2025, and will\nalso be used to resolve reports before January 9, 2025.\nA. TITLE IX DEFINITIONS\nThe following terms have the following definitions as used in this Title IX sex\ndiscrimination/sex-based harassment grievance process:\nI. ACTUAL KNOWLDEGE\nActual Knowledge in Title IX refers to the notice of alleged sex discrimination/sex-\nbased harassment to the Title IX Coordinator or designee or to any Responsible\nEmployee at Illinois Tech. Assumption of knowledge based solely on Illinois Tech’s\nstatus as an employer or other presumption under the law does not constitute Actual\nKnowledge. The standard of Actual Knowledge is not met when the only Responsible\nEmployee with knowledge of alleged sex discrimination/sex-based harassment at\nIllinois Tech is the Respondent. “Notice” as used here includes, but is not limited to,\na report or complaint of sex discrimination/sex-based harassment to the Title IX\nCoordinator or any Responsible Employee in person, by mail, by telephone, by email\nor by any means that results in the Title IX Coordinator or the Responsible Employee\nreceiving a verbal or written report. A Responsible Employee with Actual Knowledge\nmust contact the Title IX Coordinator, Virginia Foster via email at\nfoster@illinoistech.edu, or by phone at 312.567.5725.\n1. BUSINESS DAYS\nDays on which the Illinois Tech main office is open.\n2. COMPLAINANT",
  "metadata": {
    "pages": [
      166,
      167
    ],
    "word_count": 604
  }
}