{
  "chunk_id": "Student_Handbook_chunk_0037",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "98-99",
  "page_count": 2,
  "text": "offensive environment. Accordingly, Illinois Tech strives to provide for its students, faculty\nand staff an educational and employment environment free of sexual harassment.\n2. Definition of Sexual Harassment\nSexual harassment is defined as unwelcome sexual advances, requests for sexual favors\nand other verbal or physical conduct or communications as defined and otherwise\nprohibited by local, state and federal law. Sexual harassment can be overt and\nunambiguous or subtle and indirect. Sexual misconduct, as defined in Section N of this\nArticle, and Title IX Sex Discrimination, as defined in Appendix A, Section, are forms of\nsexual harassment. (As a reminder, complaints of and the investigation, adjudication and\nsanction of Title IX Sex Discrimination are exclusively handled pursuant to the processes\nand procedures set forth in Appendix A.) In general, sexual advances, requests for sexual\nfavors or sexually-directed remarks constitute harassment when either:\n1. The conduct directed against an individual persists despite its rejection; or\n2. Submission to the conduct is used or threatened to be used as the basis for academic or\nemployment decisions or is accompanied by an offer or reward or threats of reprisal.\nSexual harassment can take many forms. Some of these are overt and unambiguous, while\nothers may be more subtle and indirect. Direct forms of sexual harassment include sexual\nassault and sexual advances accompanied by an offer or reward or threats of reprisal.\nSuch behavior constitutes serious misconduct, and a single incident may well establish\ngrounds for a complaint. Other forms of sexual harassment include sexual advances,\nphysical or verbal, that are repeated and unwanted. Sexual harassment can also include\nbehavior or a pattern of behavior that creates a hostile environment, which generally\nincludes harassing conduct that is sufficiently severe, pervasive and objectively offensive\nthat it alters the conditions of employment or limits, interferes with or denies educational\nbenefits or opportunities, from both the perspectives of the person reporting harassment\nand from a reasonable person’s standard.\nRomantic relationships that might be appropriate in other contexts may, within a university,\ncreate the appearance or fact of an abuse of power or of undue advantage. Moreover, even\nwhen both parties have consented at the outset to a romantic involvement, such consent\ndoes not preclude a subsequent charge of sexual harassment against the instructor or\nsupervisor.\nStudent Handbook 97\n\n3. Possible Individual Actions Other than Complaint\nWith respect to students, in circumstances where it would not jeopardize personal safety,\njob status or academic status, a student subjected to unwelcome attention may\ncommunicate clearly to the offender that the behavior is not welcomed and should cease\nimmediately.\nQuestions regarding the Sexual Harassment policy can be directed to:\nThe Title IX Coordinator, 312.567.5725, foster@illinoistech.edu;\nThe Director of Equal Opportunity and Affirmative Action, 312.567.3134;\njdiemer@illinoistech.edu\nThe Vice Provost for Student Affairs and Dean of Students, 312.567.3080,\nkstetz@illinoistech.edu;\nAssociate Dean for Academic Affairs at Chicago Kent, 312-906-5125, jtierney1@illinoistech.edu;\nAssistant Dean for Student Affairs at Chicago Kent, 312-906-5005, jabhijeet@illinoistech.edu\n4. Making a Complaint; Investigatory Possibilities\nA student who believes that they were subject to sexual harassment may file a complaint\nalleging violation(s) of this Policy with the Title IX Coordinator, or Office of Student Affairs\n(contact information for both is noted above), or online at www.iit.edu/incidentreport. The\nprivacy of the student-reporting party and those accused of violating this Policy will be\nprotected throughout proceedings to the extent possible, and proceedings, meetings and\nhearings concerning harassment will, consistent with the relevant policies pursuant to\nwhich they are conducted, be closed. All reasonable measures will be taken to assure that\nno one involved in any complaint, investigation, or remedy shall suffer retaliation as a\nresult of the proceedings, as Illinois Tech policy expressly forbids any such\nretaliation. Action will generally not be initiated without the consent of the reporting party.\nHowever, Illinois Tech must retain, and hereby retains, the right to conduct an investigation\nwithout the consent of the reporting party if it determines that such investigation is\nnecessary to protect the interests of others or Illinois Tech or to maintain the educational\nenvironment. A reporting party who wishes to proceed with their complaint has two\noptions: informal resolution, or formal process.\nStudent Handbook 98",
  "metadata": {
    "pages": [
      98,
      99
    ],
    "word_count": 689
  }
}