{
  "chunk_id": "Student_Handbook_chunk_0078",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "181-181",
  "page_count": 1,
  "text": "4. THE PROCESS USED TO INVESTIGATE AND RESOLVE A FORMAL TITLE IX\nCOMPLAINT WILL ALSO MEET THE FOLLOWING ADDITIONAL\nREQUIREMENTS:\nXVIII. The process used must treat complainants and respondents equitably in all manners,\nincluding by providing remedies to a complainant where a determination of\nresponsibility for sex discrimination and sex-based harassment has been made\nagainst the respondent, and by following this sex discrimination and sex-based\nharassment process before the imposition of any disciplinary sanctions or other\nactions that are not Supportive Measures against a respondent.\nXIX. No evidence that constitutes or seeks disclosure of information protected under a\nlegally recognized privilege will be required, allowed, or relied on unless the person\nholding such privilege has waived the privilege.\nXX. The Title IX Investigator and the Title IX Decision-Maker will objectively review all\nrelevant evidence, including both inculpatory and exculpatory evidence, and\ncredibility determinations will not be based on a person’s status as a complainant,\nrespondent, or witness.\nXXI. All members of the Title IX Team will operate under a presumption that the\nrespondent is not responsible for the alleged conduct until a determination regarding\nresponsibility is made at the conclusion of this grievance process.\nXXII. Remedies may include, but are not limited to, the same individualized services\ndescribed as Supportive Measures in this policy but need not be non-disciplinary or\nnon-punitive and need not avoid burdening the respondent. Student discipline can\ninvolve a range of consequences, which may include, but are not limited to,\nSupportive Measures, a warning, probation, suspension and expulsion, depending on\nthe severity of the action and circumstances of the student(s) involved. For the\navoidance of doubt, the Title IX Decision-maker may impose any sanction provided\nfor in this policy upon which a respondent is found responsible, after a live hearing,\nfor sex discrimination/sex-based harassment. Discipline for employees also includes\na range of options, including, but not limited to, a letter of reprimand, reassignment,\nsuspension with or without pay, discharge or recommendation for discharge,\nnotifying appropriate legal authorities and/or taking legal action against the\nemployee.\nXXIII. The Title IX Coordinator or designee may consolidate Formal Title IX Complaints as\nto allegations of sex discrimination/sex-based harassment against more than one\nrespondent, or by more than one complainant against one or more respondents, or\nby one party against the other party, where the allegations of sex discrimination/sex-\nbased harassment arise out of the same facts or circumstances.\nXXIV. E-mail correspondence sent to a student’s registered iit.edu e-mail address (or, in the\ncase of a non-Illinois Tech student, such e-mail address as they shall provide) will be\nconsidered sufficient written notification in all instances where written notification\nis required under this policy. It is the party’s sole responsibility to monitor their\nemail. The date any such notification is e-mailed will serve as the start date for any\ntime period within which or after which any subsequent action or proceeding is to\ncommence. Illinois Tech’s sole obligation is to send notice to the complainant and\nrespondent and witness; Illinois Tech shall have no obligation also to communicate\nwith the advisors or parents or other representatives of such parties.\n15",
  "metadata": {
    "pages": [
      181
    ],
    "word_count": 518
  }
}