{
  "chunk_id": "Student_Handbook_chunk_0027",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "77-78",
  "page_count": 2,
  "text": " Subject to the restriction set forth in Section C(3) above, the sanction imposed was\ninappropriate for the offense; and\n New evidence that was not available at the time of the original decision, due to no\nfault or lack of diligence of the student, has become available.\n3. Determinations\nWithin 30 calendar days of receipt of the appeal, the decision-maker may make one of the\nfollowing determinations:\n Uphold the decision and the sanction;\n Reverse the decision and/or modify (enhance or lessen) the sanction; or\n Uphold the decision and return the case to the Campus Judicial Board or the Dean\nof Students to reconsider the sanction.\nE. Information for Crime Victims about Disciplinary Proceedings\nWith respect to hearings related to an alleged violation(s) of sexual misconduct, the Dean\nof Students will simultaneously notify both the accused and the accuser of (i) any results of\nthe hearing, any sanctions imposed and the general rationale for the results and sanctions,\n(ii) any available appeal options, (iii) any changes as a result of the appeal, and (iv) when\nthe result has become final.\nUpon written request, Illinois Tech will disclose to the alleged victim of any crime of\nviolence, or a non-forcible sex offense, the results of any disciplinary proceeding\nconducted by it against the student who is the alleged perpetrator of such crime or offense.\nIf the alleged victim is deceased as a result of the crime or offense, the information shall be\nprovided, upon request, to the next of kin of the alleged victim.\nIII. Title IX Sex Discrimination Policy and Process\nThe university has adopted a Title IX Sex Discrimination Policy that addresses the reporting\nand processing of complaints of “Title IX Sex Discrimination,” as defined therein in\nStudent Handbook 76\n\nAppendix A. Any person may report Title IX Sex Discrimination under that Policy, whether or\nnot the reporting party is the person alleged to be the victim of the conduct. The Title IX Sex\nDiscrimination Policy is attached in Appendix A, and is incorporated herein by reference.\nMore information is also available on the Title IX Office website at https://www.iit.edu/title-\nix/title-ix-compliance.\nIV. POLICIES AND PROCEDURES\nA. Alcohol Use for Campus Events Policy\nIllinois Tech students are subject to the laws of the State of Illinois. PERSONS UNDER 21\nYEARS OF AGE CANNOT POSSESS OR DRINK ALCOHOLIC BEVERAGES. IT IS ALSO\nILLEGAL TO PROVIDE, SELL OR DISTRIBUTE ALCOHOL TO PERSONS UNDER 21 YEARS\nOF AGE. Inappropriate behavior resulting from the consumption of alcohol, such as\ndisorderly conduct, intoxication and harassment, will constitute an independent violation\nof the Code of Conduct and will result in appropriate sanctions. As stated in Section F\nbelow, all students should review and must adhere to Illinois Tech’s Policy on Drugs and\nAlcohol. Further, any student organization that will host any event (as defined in Article VI,\nSection G) at any location at which any alcohol will be served and/or consumed must\nfollow the rules established in Illinois Tech’s policy governing the Serving of Alcohol, which\nare incorporated by this reference, at\nweb.iit.edu/sites/web/files/departments/generalcounsel/policies/procedure_c4_service_of_alcoholic_beverages.pdf.\nAll questions regarding the use or sale of alcohol should be directed to the Office of\nStudent Affairs (312.567.3081).\nB. Certification of Immunization Policy\nIn accordance with Illinois law, all students born on or after January 1, 1957 who are taking\nat least half-time credit hours per semester must supply evidence documented by a health\ncare provider of vaccination for diphtheria, tetanus, meningitis, measles, rubella and\nmumps and such other vaccination as the State of Illinois elects to mandate. In addition,\nInternational students must provide a recent Interferon Gamma Assay (IGRA) through T\nSPOT or Quantiferon Gold serum testing prior to their arrival to the United States. Blood\nStudent Handbook 77",
  "metadata": {
    "pages": [
      77,
      78
    ],
    "word_count": 621
  }
}