{
  "chunk_id": "Student_Handbook_chunk_0025",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "73-74",
  "page_count": 2,
  "text": "and/or in person), a public presentation or research paper on a designated topic, assigned\ncampus and/or community service, participation in a workshop for alcohol, drug-related or\nsexual misconduct or completion of an on-line tutorial.\nMutual No Contact Order (MNCO): Mutual No Contact Orders are designed so that\nstudents do not have communication, interact or come into contact with one another, to\nminimize further incidents. Specific details are provided in the Mutual No Contact Order\nthat is received by the involved student(s). An interim Mutual No Contact Order can be put\nin place by the Vice Provost and Dean of Students or designee if deemed reasonably\nappropriate and/or prudent to maintain the educational environment of Illinois Tech and/or\nthe parties. Unless otherwise noted in the order, MNCOs will be reviewed each semester to\ndetermine the appropriate expiration date.\nConduct probation. This is a form of probation imposed on a student for misconduct\nwithin the Illinois Tech community. The intent of Conduct Probation is for a student to self-\ncorrect their behavior and learn to become a productive member of the Illinois Tech\ncommunity. Certain restrictions and/or educational sanctions may also apply to this form\nof probation. Conduct Probation also is designated to remain in effect for a specified\nduration (e.g., one semester or one academic year).\nDisciplinary probation. This is the most serious form of probation issued by Illinois Tech. A\nstudent placed on Disciplinary Probation is required to correct their behavior immediately\nin order to remain a member of the Illinois Tech community. This form of probation may\nalso include additional restrictions and/or educational sanctions and is designated to\nremain in effect for a specified time (e.g., one semester, one academic year).\nPending a hearing, the Dean of Students may place a student on temporary disciplinary\nprobation when the facts and circumstances of the allegations against them are sufficient\nto reasonably assume, given the academic and/or campus environment, immediate,\npreventative action is advisable to maintain the safety or efficient operation of the campus\nor the physical, mental, and emotional health of one or more members of the campus\ncommunity. Allegations that are sufficiently alarming include, but are not limited to,\nviolations of the Policy on Drugs and Alcohol, Policy and Procedures on Sexual\nHarassment, incidents involving felony-level criminal charges, incidents of Sexual\nMisconduct and matters that reasonably pose a risk to the safety of other students, Illinois\nTech property and/or the efficient administration of Illinois Tech. Failure to comply with\ndisciplinary probation sanctions could result in recommendation for Suspension or\nExpulsion from Illinois Tech. (See Suspension and Expulsion.) Imposition of temporary\ndisciplinary probation will be based upon a review of the particular facts and\nStudent Handbook 72\n\ncircumstances and reasonable efforts, given the circumstances, will be made to meet with\na student prior to such imposition so that they may present their case as to why such\naction should not be taken. A student may appeal the imposition of temporary disciplinary\nprobation in writing to the Provost within three calendar days of its imposition. The student\nwill remain on temporary disciplinary probation during the appeal, and the Provost’s\ndecision regarding the matter will be final. If an appeal is not filed by the student within the\nrequisite time period, the right to appeal will be deemed waived, and the decision to\nimpose temporary disciplinary probation will stand.\nDisciplinary probation also impacts a student's ability to participate in certain Illinois Tech\nactivities. Students on disciplinary probation may not hold an office within a student\norganization (see Student Organization policies) or travel on behalf of Illinois Tech or in\nconnection with any Illinois Tech sanctioned event or activity (see Travel Policy).\nRelocation/Suspension/Ban from Campus Housing. A student is required to relocate, for\ndisciplinary reasons, to another residence hall or other campus housing. The timing of\nsuch relocation is at the discretion of the party imposing this sanction, but it may be\nimmediate. A student may also be prohibited from entering the residence hall/campus\nhousing from which they were relocated or which was otherwise connected or related to\nthe violation. The timing of such prohibition is also at the discretion of the party imposing\nthis sanction, but it may be immediate. Further, a student may be denied, for disciplinary\nreasons, housing in the residence halls, in campus apartments or in fraternities or\nsororities. Notwithstanding any other provision of this Conduct Discipline and in addition\nto any other sanction imposed by the Dean of Student or their other designee or the\nCampus Judicial Board, the housing contract of any student who either admits to or is\nfound to have used or possessed illegal drugs in any Illinois Tech residence hall may be\nimmediately canceled, and such student must move out of the residence hall as promptly\nas possible, but in any event within 72 hours.\nSuspension. Suspension is a status assigned for various periods of time in which a\nstudent’s enrollment is interrupted. A suspended student may not attend day or evening\nclasses, including classes taught on-line, or participate in student activities. A suspended\nstudent may only be present in or on property owned by Illinois Tech with written approval\nfrom the Dean of Students or their designee. A suspended student may apply for\nreinstatement at the end of the period of suspension. If reinstated, the student may be\nplaced on disciplinary probation for a period of time.\nStudent Handbook 73",
  "metadata": {
    "pages": [
      73,
      74
    ],
    "word_count": 897
  }
}