{
  "chunk_id": "Student_Handbook_chunk_0016",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "52-54",
  "page_count": 3,
  "text": "web.iit.edu/sites/web/files/departments/general-counsel/policies/Drug-FreeSchoolsPolicy.pdf.\nThis Policy is incorporated herein, and any violation of its terms is a violation of this\nprovision. In addition, the actions listed below are also considered a violation of this\nPolicy’s principles and, thus, this Code of Conduct:\n(a) Misconduct related to alcohol and alcoholic beverages that occurs on Illinois Tech\nproperty or property under its control or at an Illinois sponsored event or activity including:\n Use or possession of alcohol or containers that previously contained alcohol, by\nindividuals under the age of 21 (or the age of majority in the jurisdiction);\n Manufacturing alcoholic beverages on Illinois Tech property, premises or facilities,\nexcept as specifically authorized by Illinois Tech, regardless of age;\n Providing or distributing alcohol to individuals under the age of 21;\n Severe intoxication resulting in disruptive behaviors or concern for the student’s\nwell-being, regardless of age;\n Driving under the influence of alcohol or while intoxicated;\n Possession of open containers of alcohol on Illinois Tech property and public ways\nimmediately adjacent there to, in Illinois Tech facilities, or in Illinois Tech vehicles or\ntransportation, except as specifically authorized by Illinois Tech;\n Violations of other Illinois Tech alcohol policies pertaining to alcohol; and\n When a student is on campus or at an event affiliated with Illinois Tech or an Illinois\nTech student organization, (i) possession of kegs or other large storage devices,\nquantity dispensing containers, or common sources of alcohol, except as\nspecifically authorized by Illinois Tech, regardless of age; (ii) drinking practices or\ngames that encourage participants to consume alcohol or promote intoxication and\nany paraphernalia that supports such activities are prohibited, regardless of age; (iii)\nin any dry or alcohol-free spaces on campus including, but not limited to,\ndesignated fraternity/sorority houses and areas in the residence halls and academic\nbuildings; or (iv) in a manner inconsistent with the Residence Life Policy related to\nalcohol which can be found online at web.iit.edu/housing.\nStudent Handbook 51\n\n(b) Misconduct related to drugs (i.e., all illegal drugs and controlled substances) listed in\nthe Policy, that occurs on Illinois Tech property or property under its control or at an Illinois\nsponsored event or activity including:\n Possession or use of illegal drugs or controlled substances, except as expressly\npermitted by all levels of legal authority and provided such use and possession is\nconsistent therewith;\n Sale, manufacturing, or distribution of illegal drugs or controlled substances;\n Sale, possession, use or distribution of drug paraphernalia, which includes, but is\nnot limited to, hookah, bongs, pipes, rolling papers, deseeding trays, roach clip,\nscales, or any item used to inhale/digest illegal substances or any item used to\ndisguise the use of drugs;\n Driving under the influence of any illegal drug or controlled substance;\n Being in the presence of the use of illegal drugs or controlled substances on\ncampus; and\n Violations of other Illinois Tech drug policies pertaining to illegal drugs and\ncontrolled substances.\n(c) Although Illinois’ Compassionate Use of Medical Cannabis Pilot Program Act and the\nIllinois Cannabis Regulation and Tax Act respectively allows patients to possess and\nconsume limited amounts of marijuana for certain medical conditions and allows legal\npossession of marijuana by those over the age of 21, these state laws conflict with federal\nlaws governing marijuana. Illinois Tech is subject to the federal Drug-Free Schools and\nCommunities Act Amendments, which mandates that campus communities be free of\ncontrolled substances (including marijuana). Therefore, the use, possession, manufacture,\ncultivation, dissemination, or being under the influence of medical marijuana on Illinois\nTech property or at Illinois Tech-related activities is and shall remain prohibited.\n2. Destruction of Property\nDestroying, damaging, defacing, or vandalizing (or attempting to do any of the foregoing)\nproperty of Illinois Tech, property under Illinois Tech’s control or belonging to an Illinois\nTech affiliate, employee, faculty member, student, alumni or guest.\nStudent Handbook 52\n\n3. Defamation\nlibel and slander\n4. Discrimination and Harassment\nDiscrimination by any member of the Illinois Tech community against any individual on the\nbasis of race, color, religion, national origin, sex, pregnancy, sexual orientation, gender\nidentity, gender expression, parental status, marital status, age, disability, citizenship\nstatus, veteran status, genetic information, or any other classification protected by\napplicable law (each a “status”) in matters involving admissions, employment, housing,\nservices, or in the educational programs or activities the university operates is prohibited.\nHarassment, whether verbal, physical, electronic, including, without limitation, texting and\nsocial media, or visual, which is based on any of the above-referenced status is a form of\ndiscrimination. This includes harassing conduct affecting tangible job benefits, interfering\nunreasonably with an individual’s academic or work performance, or creating what a\nreasonable person would perceive to be an intimidating, hostile or offensive environment.\nProhibited sex discrimination includes sexual harassment and sexual violence. (For more\ninformation about Title IX sex discrimination including sex-based harassment please\nsee Appendix A, and Article IV, Sections E, M and N, the terms of which are hereby\nincorporated into this provision.)\nExamples of harassment may include, but are not limited to:\n Teasing or practical jokes directed at a person based on the person’s status;\n Jokes or epithets about a person’s status or about sex or gender specific traits;\n Displaying or circulating written materials or pictures that degrade a person or group\nbased on their status;\n Verbal abuse or insults about, directed at, or made in the presence of an individual\nor group of individuals of a particular status;\n Suggestive comments, insults, or sexual propositions; and\n Electronic or written media including any of the above.\nStudent Handbook 53",
  "metadata": {
    "pages": [
      52,
      53,
      54
    ],
    "word_count": 927
  }
}