{
  "chunk_id": "Student_Handbook_chunk_0051",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "127-129",
  "page_count": 3,
  "text": "3. Co-terminal Students: Co-terminal students are held to the academic standing\nrequirements of all of their degree programs. Please consult the Co-terminal handbook for\nmore information.\nD. Advising\nEach undergraduate student is assigned a faculty and/or professional academic advisor\nwho is available to discuss opportunities and career plans in the student’s chosen field\nand to plan and approve coursework to meet departmental and university requirements.\nDepartment advisers and advisers in the Office of Academic Affairs are also available to\nanswer questions and interpret policies regarding university requirements and academic\nprocedures.\nA graduate student is required to complete any necessary forms with the approval of the\nappropriate staff of the Office of Academic Affairs. Special advisors are available to\ncounsel undergraduates on preparation for entry into advanced programs in law, medicine,\nand education. Special advisors will be assigned to students working in combined\nundergraduate/graduate degree programs with the associated medical schools, Chicago-\nKent College of Law, the Graduate College or Stuart School of Business. Stuart School of\nBusiness graduate students are assigned academic advisors from the Stuart Office of\nAcademic Advising. It is the sole responsibility of the student to know, understand, and\nsatisfy all departmental, college, and university academic requirements relevant to their\ndegree.\nE. Application for Degree Conferral - web.iit.edu/commencement\nA student must submit an application to express their intent to have their degree conferred\nat the beginning of the semester in which they plan to graduate. Failure to do so may result\nin the postponement of the student’s graduation. The application deadline to have a degree\nconferred at the end of a given term can be found in the Academic Calendar on the\nregistrar’s website. Students can consult the Office of Academic Affairs for degree\ncheckout planning. Stuart graduate students can contact the Stuart Office of Academic\nAdvising. Students are required to be actively enrolled in the semester they intend to\ngraduate.\nStudent Handbook 126\n\nF. Change or Declaration of Additional Majors\nStudents considering either a change of major or concurrently pursuing a second\nundergraduate degree or major should consult the departmental associate chair regarding\nprogram requirements and career opportunities in the new degree program.\nStudents may also review requirements for the new degree program by performing a “What\nIf” audit using Degree Works. Students may access Undergraduate Degree Works through\nthe Undergraduate Academic Affairs channel in the Illinois Tech portal (portal.iit.edu).\nAn adviser in the Office of Academic Affairs can also assist a student in the selection of a\nsuitable major. A student who wishes to change or declare a major or concurrently pursue\nan additional undergraduate degree program must obtain these forms iit.edu/ugaa.\nApproval from the intended major department is required.\nG. Change of Grade\nThe change of grade request form is available on the Office of the Registrar's portal site.\nThis form is intended for the exclusive use of Illinois Tech faculty and authorized academic\nadministrators to request a student's official final grade be changed. Online submissions of\nfinal grades are due on the published deadline following final exams. Grades of \"X\" are\nposted for all missing (blank) grades at that time and are resolved through this grade\nchange process. All grade changes are initiated by the instructor of record or authorized\nacademic officer. Using this form, temporary grades of \"I\", \"R\", and \"X\" can be changed by\nthe instructor directly with the Office of the Registrar to a final letter grade of: \"A\", \"B\", \"C\",\n\"E\", or \"S/U\" if the class has a pass/fail grading basis of satisfactory/unsatisfactory.\nTemporary grades of \"I\" or \"R\" cannot be changed by the instructor to another temporary or\nnon-letter, administrative grade of \"I\", \"R\", \"NA\", \"AU\", \"W\", or \"X. Other grade changes may\nrequire an additional level of approval by an academic officer or appeals committee. The\nstudent should check with their academic college dean's office for details. Changes to final\ngrades cannot be made once a degree has been posted for the career in which the course\nwas taken, or in the case of a student's involuntary separation from the university. Grade\nchange submissions through this form are recorded in Banner once the submitting\ninstructor and/or administrative academic authorization is verified. The instructor is\nnotified when the process is complete.\nStudent Handbook 127\n\nH. Change of Status\nStudents who wish to change a classification and/or registration status must complete the\napplicable procedures listed below no later than two weeks prior to registration.\nStudents changing from full-time degree-seeking status to part-time degree-seeking status\nmust notify the Office of Financial Aid if they are receiving financial aid. International\nstudents with student visas must be registered as full-time students and are not permitted\nto change to part-time status.\nStudents changing from part-time degree-seeking status to full-time degree-seeking status\nmust inform their department and obtain the necessary adviser’s approval for a full-time\ncourse load. Also, students in this category who wish to apply for financial aid must notify\nthe Office of Financial Aid regarding their change of status.\nStudents changing from non-degree status to full-time or part-time degree-seeking status\nmust contact the Office of Academic Affairs. Students must have completed at least one\nsemester of relevant coursework at the university and must be in academic good standing\nin order to be eligible for changing their status.\nStudents changing from graduate status to undergraduate full-time or part-time status\nmust submit an application for reinstatement to the Office of Academic Affairs.\nI. Class Attendance and Registration\nStudents are required to be registered for all classes in which they participate, attend,\nand/or submit coursework for evaluation. No credit will be granted for any course for which\nthe student did not properly register before the last day to add a class for the semester.\nStudents are required to be registered to make use of university facilities. Students who are\nin an exchange, study abroad, or cooperative education program also must be registered\nfor their particular programs.\nStudent Handbook 128",
  "metadata": {
    "pages": [
      127,
      128,
      129
    ],
    "word_count": 984
  }
}