{
  "chunk_id": "Student_Handbook_chunk_0050",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "124-126",
  "page_count": 3,
  "text": "and provisions of the referenced Bulletins and other materials shall control and govern.\nIllinois Tech retains the right, in its sole discretion, to modify, from time-to-time, any\nacademic rule, regulation policy or procedure, which modification shall become effective\nupon the online publication thereof; this includes the absolute right to modify the means,\nmethods and/or location of instruction, extracurricular activities and related Illinois Tech\nservices and offerings\nA. Academic Loads\n1. Undergraduate Students: The average full-time academic load during the fall or spring\nsemester is 15 credit hours. The minimum registration required for full-time status for\nthose semesters is 12 credit hours. Full-time degree-seeking students who wish to enroll\nfor more than 18 credit hours or part-time degree-seeking students who wish to enroll in\nnine to eleven credit hours must obtain permission from their academic dean.\nStudents who wish to enroll in more than two courses during the summer term at Illinois\nTech must obtain permission from their academic dean. Non-degree students requesting a\ncourse overload (more than eight credit hours) must obtain permission from the Office of\nAcademic Affairs.\n2. Graduate Students: The minimum registration required for full-time status for the fall or\nspring semester is 9 credit hours. Non-degree graduate students are limited to a maximum\nof 9 credit hours prior to a formal admission decision. Graduate students who wish to\nenroll for more than 15 credit hours in a semester, or more than two courses during the\nsummer session, must obtain written permission from Academic Affairs.\nB. Academic Program Audit, Undergraduate\nAn academic audit provides a summary of a student’s academic status to date and lists the\ncourses to be completed in order to receive a degree. Students can request an official\nacademic audit from the Office of Academic Affairs after they have earned a minimum of\n60 credit hours or 90 credit hours for architecture students and have completed at least\none semester at Illinois Tech. Students may request an official academic audit through the\nUndergraduate Academic Affairs channel in the Illinois Tech portal (portal.iit.edu). Students\nStudent Handbook 123\n\nmay also review academic progress towards their degree through Undergraduate Degree\nWorks in the Undergraduate Academic Affairs channel in the Illinois Tech portal. Please\nnote that Degree Works is not an official report for academic progress.\nC. Academic Progress, Probation and Dismissal\nThe following are general Illinois Tech policies and procedures. Individual colleges and\ndepartments may have their own policies and procedures, which, if violated, may lead to\nprobation or dismissal from the applicable academic program.\n1. Undergraduate Students: All students who are degree candidates are expected to\nmaintain satisfactory academic progress. This includes earning satisfactory grade point\naverages and maintaining a satisfactory rate of progress toward the completion of their\ndegree programs. Students who do not earn at least a 2.00 cumulative GPA, a 1.85 term\nGPA, or a 2.00 major GPA are placed on academic probation. Further, degree-seeking\nstudents are required to maintain a satisfactory rate of progress as noted below.\nFull-time students must earn a minimum of 12 credit hours per semester applicable to\ntheir degrees.\nPart-time students must maintain a satisfactory rate of progress which will enable them to\ngraduate within 12 academic years after achieving degree-seeking status.\nStudents who do not maintain a satisfactory rate of progress in a given semester may be\nplaced on probation upon the recommendation of the student's academic advisor,\ndepartment associate chair (or designee), and academic dean (or designee). Probation\nmay affect financial aid. Students on probation are not permitted to:\n Register for more than 16.5 (15 hours plus 1.5 hours of GLS) credit hours per\nsemester unless they receive approval from the associate dean of their college (or\ndesignee).\nStudent Handbook 124\n\n Hold an elected or appointed office in any student organization. Probation does not\naffect membership in a student organization\n Participate in the Cooperative Education Program unless approved by the Academic\nStanding Committee.\n Academic probation may affect a student's eligibility to participate in varsity athletic\nsports.\nStudents who are enrolled in a dual degree program and are placed on academic probation\nmust schedule a meeting with the Office of Academic Affairs.\nStudents who are on academic probation for two consecutive semesters are candidates\nfor academic dismissal from Illinois Tech.\nThe progress of non-degree students also is reviewed, and any student who does not\nmaintain good academic standing is subject to being placed on probation or academic\ndismissal. A student placed on academic dismissal by Illinois Tech may petition the\nAcademic Standing Committee to review the dismissal. The student must present\nsubstantial academic or other relevant new evidence not available at the time of dismissal\nin support of the petition for reinstatement. The chair of the Academic Standing Committee\nwill determine whether the new documentation warrants a further review of the case.\n2. Graduate Students: A student whose cumulative GPA falls below 3.0/4.0 is no longer in\ngood standing. Probationary students who receive “E” grades will be required to repeat\ncourses, subject to the limits specified within this bulletin, to improve the cumulative\nand/or program GPA. Registration is restricted to nine credit hours during the probationary\nperiod.\nDismissal will occur when a student fails to make the requisite academic progress during\nthe probationary period. Students may not register for an internship while on academic\nprobation. If a student’s GPA in their program is below 3.0 after all course requirements are\ncompleted, then graduate courses (approved by the adviser, academic unit, and Academic\nAffairs) may be added to the program until the corresponding GPA is at least 3.0.\nStudent Handbook 125",
  "metadata": {
    "pages": [
      124,
      125,
      126
    ],
    "word_count": 927
  }
}