{
  "chunk_id": "Student_Handbook_chunk_0057",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "142-143",
  "page_count": 2,
  "text": "professional, and Vice Provost of Student Affairs and Dean of Students or designee is\nrequired in any review.\n5. Safety Intervention and Involuntary Withdrawal Process. Any member of the Illinois\nTech community who has reason to believe that a student poses a violent threat or a threat\nto public safety should contact the Public Safety office or the local police department.\nAny member of the Illinois Tech community who has reason to believe that a student poses\na credible substantial risk of harm to the Illinois Tech community and thus may meet the\ncriteria for Safety Intervention and/or Involuntary Withdrawal may contact the Vice Provost\nof Student Affairs and Dean of Students or designee who will conduct an informal review of\nthe information presented. All reports made pursuant to this policy will be handled in a\nconfidential manner, with information released only on a need-to-know basis in\naccordance with applicable federal and state laws and regulations.\nUpon completion of the informal review, the Vice Provost of Student Affairs and Dean of\nStudents or designee may recommend that a student be subject to a safety intervention or\ninvoluntary withdrawal for reasons under the criteria set forth in Section 2 above. In\ndetermining whether the student presents a credible substantial risk of harm to the Illinois\nTech community, the Vice Provost of Student Affairs and Dean of Students or designee will\nmake an individualized assessment based on a reasonable judgment that relies upon\ncurrent medical or other specialized knowledge or the best available evidence to ascertain:\n(i) the nature, duration, and severity of the risk; (ii) the probability that potential injury\nand/or harm will occur; (iii) whether the student substantially impeded the educational\nprocess or functions of other members of the Illinois Tech community; and (iv) whether\nreasonable modifications of policies, practices or procedures significantly mitigate the\nrisk. In making this individualized assessment, the Vice Provost of Student Affairs and Dean\nof Students or designee may consult with the CST.\nAs part of this individualized assessment, the student may be required to undergo an\nevaluation, including a medical or psychological evaluation, by an independent and\nobjective health professional, including Illinois Tech’s Student Health and Wellness Center,\ndesignated by Illinois Tech. The student may also be required to execute necessary\nreleases so that the report from the evaluation may be provided to the CST, and other\nStudent Handbook 141\n\nadministrators if appropriate, for the purposes of determining whether the student should\nbe subject to an intervention or involuntary withdrawal. In addition, the Vice Provost of\nStudent Affairs and Dean of Students or designee will consider any medical or other\nrelevant information submitted by the student, including but not limited to a medical or\npsychological evaluation by a health professional of the student’s choice.\nInherent to this decision-making process is Illinois Tech’s commitment to consider an\nindividual’s past and ongoing condition, which may have contributed to the risk of harm\nthat is in question. The Vice Provost of Student Affairs and Dean of Students or designee\nmay seek the assistance of the CST or other resources, as needed, to determine if the\nstudent is a qualified individual with a disability and whether a reasonable accommodation\nwill allow that student to meet their essential academic and university community\nresponsibilities, while abating the risk of harm and maintaining a safe educational\nenvironment for all students. This determination shall also evaluate whether such\naccommodation can be provided without fundamentally altering the essential functions of\nthe educational program provided by Illinois Tech, lowering academic standards, and/or\ncreating undue hardship to Illinois Tech.\nMoreover, whether or not the student is a qualified individual with a disability, the Vice\nProvost of Student Affairs and Dean of Students or designee will generally attempt to\nengage in an interactive dialogue with the student to discuss the manner in which the\nstudent plans to abate the risk of harm presented by the student. As part of this interactive\nprocess, the student and/or their medical provider are encouraged to suggest possible\nmethods to abate the risk of harm, and the Vice Provost of Student Affairs and Dean of\nStudents or designee will request the student’s suggestions. The Vice Provost of Student\nAffairs and Dean of Students or designee and student may also choose to engage\nprofessionals or Illinois Tech administrators in formulating a proposed plan. The Vice\nProvost of Student Affairs and Dean of Students or designee may then further consult with\nthe CST to determine if the proposed plan devised as a result of the interactive dialogue\nappropriately addresses the risk of harm that formed the basis for the decision to intervene\nwith or involuntarily withdraw the student. If the CST finds the proposed plan is\ninappropriate or insufficient to address the risk of harm, the Vice Provost of Student Affairs\nand Dean of Students or designee may resume the interactive process with the student.\nStudent Handbook 142",
  "metadata": {
    "pages": [
      142,
      143
    ],
    "word_count": 815
  }
}