{
  "chunk_id": "Student_Handbook_chunk_0049",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "122-123",
  "page_count": 2,
  "text": "Approval Process: All demonstrations must have an Illinois Tech-affiliated sponsor,\nwhether one or more currently enrolled student in good standing or an authorized officer of\na university-recognized student organization (“Sponsor”). The Sponsor must submit a fully\ncompleted application no less than ten (10) calendar days in advance of the proposed\nDemonstration date in a form approved by the Office of the Dean of Students. The Dean of\nStudents, or designee, in consultation with other Illinois Tech officials as they deem\nnecessary, shall consider the time, place, and manner of the proposed demonstration and,\nin their collective discretion, may approve, conditionally approve, or deny the request. If an\napplication is conditionally approved, the Office of the Dean of Students and applicant\nshall work together in an attempt to resolve outstanding concerns before the application\ncan be fully approved. The Demonstration must be conducted consistent with all special\nconditions reflected in the approval, the guidelines set forth herein, all applicable Illinois\nTech policies including, without limitation, the Student Code of Conduct, as well as\napplicable federal, state and municipal laws. The Sponsor is responsible for taking all\nnecessary steps to ensure compliance with these requirements by all participants, and\nmay be held accountable for violations by any person involved in the Demonstration.\nConduct of Demonstration. Illinois Tech reserves the right to regulate the time, place and\nmanner of a proposed Demonstration, and to withhold approval if it reasonably appears\nthat the Demonstration is to be organized by or on behalf of individuals or organizations\nthat are not affiliated with Illinois Tech, or which are intended or deemed likely to disrupt or\ninterfere with Illinois Tech operations or the mission of the university. By way of example\nonly, Demonstrations, even those that have received prior approval, involving any of the\nfollowing activities will not be permitted:\n Prevent, delay, impede or disrupt university functions or activities, such as classes,\nlectures, meetings, ceremonies, performances, or other similar events, or the\nconduct of university business.\n Obstruct the legitimate movement of any person or vehicle on Illinois Tech\npremises;\n Be within 200 feet of another Demonstration;\n Be near places where minors or other vulnerable populations are present including,\nwithout limitation, the Student Health and Wellness Center;\n Be violent or harassing, or create, or have the potential to create, a hostile or\nthreatening environment, or threaten individual or public health and safety;\nStudent Handbook 121\n\n Deface or damage, or pose a reasonable possibility to damage, Illinois Tech\nproperty or personal property, including but not limited to buildings and their\ncontents, utilities, security systems, vehicles, signage, artwork and landscaping;\n Involve burning objects or combustible substances;\n Involve the construction or placement of structures, however temporary, including\nencampments;\n Use sound amplification equipment;\n Result in unauthorized access to an Illinois Tech facility, or obstruction of the\nentrance or exit to a university facility or roadway; or\n Failure to follow the reasonable instructions of an Illinois Tech representative\nincluding, without limitation, an order to vacate university property or a university\nfacility.\nThe Sponsor is responsible for all associated costs of the Demonstrations (including\nsecurity if deemed necessary by Illinois Tech in its sole discretion), as well as securing any\npermits required by applicable law. Organizing or participating in a Demonstration without\nprior authorization may result in disciplinary action.\nV. ACADEMIC AND DEPARTMENT REGULATIONS\nRules and regulations are a necessary part of life, even in an academic environment, for\nthey define boundaries of conduct that allow an individual the maximum degree of\nfreedom consistent with the effective functioning of that community. The following\nregulations, derived from applicable laws and regulatory requirements and the experience\nof operating and maintaining an institution of higher education, summarize some of the\nacademic-related boundaries at Illinois Tech. It is important that all students familiarize\nthemselves with this material. In addition, undergraduate students should become\nfamiliar with the regulations and procedures listed in the current Undergraduate Bulletin\nand other publications from the Office of Undergraduate Academic Affairs; graduate\nstudents should become familiar with the regulations and procedures listed in the current\nGraduate Bulletin and other publications from the Office of Graduate Academic Affairs.\nLaw students should become familiar with the regulations and procedures listed in the\ncurrent Chicago-Kent Bulletin and Chicago-Kent Student Handbook. It is the responsibility\nof all students to know and to adhere to relevant academic regulations and procedures\noutlined in these publications. In the event of any conflict between the provisions of Article\nV of this Student Handbook and the referenced Bulletins and other materials, the terms\nStudent Handbook 122",
  "metadata": {
    "pages": [
      122,
      123
    ],
    "word_count": 764
  }
}