{
  "chunk_id": "Student_Handbook_chunk_0081",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "186-188",
  "page_count": 3,
  "text": "• Provide the parties a reasonable and equal opportunity to make a statement in\nsupport of, or challenging, the outcome; and\n• Send notification to the complainant of the outcome of the appeal and the\nrationale for the result and notify the respondent only if a Notice of Allegation\nwas sent;\nIf a Formal Title IX Complaint is dismissed, Illinois Tech will, at a minimum:\n• Offer supportive measures to the complainant as appropriate;\n• If the respondent has been notified of the allegations, offer supportive measures\nto the respondent as appropriate; and\n• Take other prompt and effective steps as appropriate, through the Title IX\nCoordinator to ensure that sex discrimination/sex-based harassment does not\ncontinue or recur within Illinois Tech’s education program or activity.\nRECORD-KEEPING\nThe Title IX Coordinator or designee will maintain, for a period of at least seven years, records\nof:\n• Each complaint of sex discrimination/sex-based harassment, records\ndocumenting the Informal Resolution process or grievance procedures, and if\napplicable the resulting outcome and documentation showing that Illinois\nTech’s response was not deliberately indifferent, and document that it has taken\nmeasures designed to restore or preserve equal access to an Illinois Tech\neducation program of activity.\n• Each determination regarding responsibility and any disciplinary sanctions\nimposed on the respondent, and any remedies provided to the complainant\ndesigned to restore or preserve equal access to Illinois Tech’s education\nprogram or activity; (a) any appeal and the results therefrom; (b) any informal\nresolution and the result therefrom.\n• All materials used to train Title IX Coordinators, their designees, Title IX\nInvestigators, Title IX Decision-Makers, Title IX Appellate Decision-Makers, and\nTitle IX Informal Resolution Facilitators.\nREQUIRED TRAINING\nAny person serving as the Title IX Coordinator or a designee, Title IX Investigator(s), Title\nIX Decision-maker(s), Title IX Appellate Decision-maker(s), or Title IX Informal\nResolution Facilitator, will be trained regarding the definition of sex discrimination,\nincluding sex-based harassment, on how to conduct impartial investigations, the\ninformal resolution process, reviewing appeals, and if applicable, how to serve\nimpartially, including by avoiding prejudgment of the facts at issue, conflicts of interest,\nand bias, and issues of relevance and credibility. Any person serving as a Title IX\nInvestigator will receive training on issues of relevance to create an investigative report\nthat fairly summarizes relevant evidence.\n20\n\nAny materials used to train the Title IX team must not rely on sex stereotypes and must\npromote impartial investigations and adjudications of complaints and will be made\navailable upon request. Illinois Tech will make all materials used to train Title IX Team\nmembers publicly available on its website.\nCONFIDENTIALITY\nIllinois Tech must keep confidential and not disseminate to the public the identity of any\nindividual who participates in the Title IX process, which includes: any individual making\na report or complaint of Title IX sex discrimination, including sex-based harassment; any\nperson who has filed a Formal Title IX Complaint of Title IX sex discrimination/sex-based\nharassment; any Title IX Complainant; any individual who has been reported to be the\nperpetrator of sex discrimination/sex-based harassment; any Title IX Respondent; and\nany witness, except as may be permitted or required by law or to conduct any\ninvestigation, informal resolution, hearing, appeal or other proceeding arising under this\nTitle IX sex discrimination/sex-based harassment process. When an exception is\napplicable, Illinois Tech will use its best efforts not to disseminate identifying information\nbeyond those who have a need to know, which generally may include the parties to the\nFormal Title IX complaint, their advisors, investigators, Decision-Makers, appeal\nDecision-Makers, informal resolution facilitators and witnesses. This includes instances\nin which the Title IX Coordinator files a Formal Title IX Complaint when an individual\nwho has made a report or complaint of sex discrimination/sex-based harassment elects\nnot to participate in the Title IX sex discrimination/sex-based harassment process. In\nfurtherance of the foregoing, only the Title IX complainant and respondent, their\nrespective advisors, witnesses and any needed language translators or aides necessary to\nprovide reasonable accommodations will generally be allowed into the live hearing.\nRETALIAITON\nProhibited No person may intimidate, threaten, coerce, or discriminate against any individual\nfor the purpose of interfering with any right or privilege secured by the State or federal\nConstitution, State or federal statute, Illinois Tech policy, this Title IX sex discrimination/sex-\nbased harassment process, or because the individual has made a report or complaint, testified,\nassisted, or participated or refused to participate in any manner in an investigation, proceeding,\nor hearing under this Title IX sex discrimination/sex-based harassment process.\nCharging an individual with a Code of Conduct violation for knowingly making a materially\nfalse statement or knowingly providing false information in the course of an investigation under\nthis Title IX sex discrimination/sex-based harassment process is not prohibited retaliation;\nprovided, however, that a determination regarding responsibility, alone, is not sufficient to\nconclude that any party made a materially false statement or knowingly provided false\ninformation. Complaints alleging retaliation may be filed under the process and procedures set\nforth in Article II of this Student Handbook, entitled Code of Conduct and Conduct Discipline.\nDEADLINES\nAll timeframes under this Title IX sex discrimination/sex-based harassment process may\nbe temporarily extended for good cause by the Title IX Coordinator or a designee. Good\ncause may include considerations such as the absence of a party, a party’s advisor, or a\n21\n\nwitness; concurrent law enforcement activity; the need for language assistance or\naccommodation of disability; and other circumstances reasonably outside of the\ninstitution’s control, such as, but not limited to, campus closures; public health\nemergencies; illness, death or family emergencies experienced by key participants in the\nprocess or other such circumstances. The Title IX Coordinator or a designee shall notify\nthe parties in writing when a timeframe is extended.\n22",
  "metadata": {
    "pages": [
      186,
      187,
      188
    ],
    "word_count": 952
  }
}