{
  "chunk_id": "Student_Handbook_chunk_0013",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "46-47",
  "page_count": 2,
  "text": "Academic Honesty or if the DADD is made aware of a violation set forth in Section A.4, A.5\nor A.6 or that is otherwise prohibited by this Code of Conduct and has occurred outside of\na particular course, the DDAD will consult with the Chair of the Academic Grievance\nCommittee of the University Faculty Council to determine whether the matter should be\nreferred to a hearing before the Academic Grievance Committee for further sanctions. The\nDDAD’s decision to refer a matter to the Academic Grievance Committee shall be made in\ntheir sole discretion and shall be final. If the matter is referred for a hearing, the Academic\nGrievance Committee shall supplement its membership as necessary so that said\nCommittee includes at least one faculty member from the Academic Honesty Committee\nof the academic unit where the violation occurred, one faculty member from the student’s\nmajor, one other faculty member, two students, and the Dean of Students or their\ndesignee. The Academic Grievance Committee so supplemented will form an academic\ndisciplinary committee for the purpose of investigating the matter and making findings and\na recommendation to the DDAD. The chair of the Academic Grievance Committee shall\nchair this academic disciplinary committee.\nA student who is to appear before such an academic disciplinary committee shall be\nnotified in writing of the charges placed against them and the time and place of the\nhearing. This notice will come from the Office of Student Affairs and shall be delivered to\nthe student at least five calendar days before the hearing. A student appearing before the\nacademic disciplinary committee has the right to be accompanied by an advisor of their\nchoosing, witnesses on their behalf, and/or their parents/guardians. The advisor and\nparents/guardians are limited to advising the student and may not participate in presenting\nthe case, question witnesses, or make statements during the hearing. A student shall have\nthe right to make an oral statement both at the start and the conclusion of the hearing and\nto submit written evidence to the academic disciplinary committee. Further, as a general\nrule, a student shall have the right (i) to present and to question any witnesses of their\nchoosing that have information relevant to the charges against them; provided that the\nchair may, in their sole discretion, disallow witnesses whose testimony would be\nredundant or not germane to the charges; and (ii) to cross-examine any witness that is\ncalled to testify in support of the charges; provided that the chair may, in their sole\ndiscretion, limit such cross-examination to the extent it is not germane to the charges, is\nredundant or becomes abusive or harassing. Members of the academic disciplinary\ncommittee may, as each deems appropriate, ask questions of anyone providing testimony\nto the committee or regarding any evidence submitted. To the extent deemed necessary to\nmaintain decorum or to protect students from harassment or to ensure the integrity of the\nStudent Handbook 45\n\nprocess, the chair may require a student to direct questions to the chair who will then ask\nthem of a witness or witnesses.\nAn electronic recording of the hearing will be made. The recording will remain the sole\nproperty of Illinois Tech. No other record of the hearing may be made.\nOnce proper notification has been given, Illinois Tech reserves the right to hold the hearing\nwhether or not the student elects to participate. Email correspondence sent to the\nstudent’s registered iit.edu e-mail address will be considered, and will be deemed for\nall purposes, sufficient delivery of written notification in any and all instances where\nwritten notification is required by or under this Code of Academic Honesty. It is the\nstudent’s sole responsibility to monitor their email. The date any such notification is\nemailed will serve as the start date for any time period within which or after which any\nsubsequent action or proceeding is to commence.\nUpon receipt of the findings of the academic disciplinary committee, which findings may\ninclude recommended sanctions, the DDAD shall determine the appropriate action to be\ntaken and shall notify the student. The academic disciplinary committee may recommend,\nand the DDAD may impose, any of the following sanctions:\n Expulsion from a course. The student is assigned a punitive failing grade of ‘E’ for\nthe course and can no longer participate in the course or receive an evaluation of\ncoursework from the instructor.\n Corrective action. Action that aims to remedy the academic honesty violation and,\nto the extent feasible, rectify any consequence of the violation, while deterring\nfuture violations, which actions could include a disciplinary warning, conduct\nprobation, fine and/or education sanctions, all as defined in Article II, Section C of\nthis Handbook.\n Suspension. Suspension is a status assigned for a specific period of time in which a\nstudent’s enrollment is interrupted. A suspended student may not attend day or\nevening classes, participate in student activities, or live in campus housing. A\nsuspended student may apply for reinstatement at the end of the period of\nsuspension. If reinstated, the student may be placed on disciplinary probation for a\nperiod of time designated by the DDAD.\nStudent Handbook 46",
  "metadata": {
    "pages": [
      46,
      47
    ],
    "word_count": 853
  }
}