{
  "chunk_id": "Student_Handbook_chunk_0045",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "114-115",
  "page_count": 2,
  "text": "grabbing, pinching, biting, hair pulling or any act that would constitute a crime of violence\nunder state law; sexual abuse, including rape, attacks on sexual parts of the body, forcing\nsex after physical violence, treating one in a sexually demeaning manner, coercing or\nattempting to coerce any sexual contact or behavior without consent; psychological or\nemotional abuse, including any pattern of behavior undermining an individual's sense of\nself-worth or self-esteem through constant criticism, diminishing one's abilities, name-\ncalling or damaging one's relationship with one's children; or interference with personal\nliberty of any person by someone in an intimate relationship, as described below.\n In the case of Dating Violence, the following initiated relationships are covered:\npersons who have or have had a dating relationship; and persons who have or have\nhad a social relationship of a romantic or intimate nature. The existence of such a\nrelationship is determined based on the reporting party's statements and with\nconsideration to the length of the relationship, the type of relationship and the\nfrequency of interaction between persons involved in the relationship.\n In the case of Domestic Violence, the following intimate relationships are covered:\ncurrent and former spouses; current and former domestic partners; intimate\npartners or dating partners who share or formerly shared a common dwelling;\npersons who otherwise have a child in common or share a relationship through a\nchild; and any other person protected by the domestic and family laws of the State\nof Illinois.\n7. RETALIATION\nIllinois Tech strictly prohibits any material adverse action against any individual for, in good\nfaith, reporting, providing information, exercising one's rights or responsibilities under this\nSection N or the Code of Conduct, or otherwise being involved in the process of responding\nto, investigating, or addressing allegations of sexual misconduct. (The Title IX sex\ndiscrimination including sex-based harassment process contains its own prohibition on\nretaliation. See Appendix A) All reasonable measures will be taken to assure that no one\ninvolved in any complaint, investigation, or remedy suffers retaliation as a result of the\nproceedings. To this end, any retaliatory actions, including, but not limited to, intimidation,\nthreats, coercion, denial of benefits or the like, against any such individual for having\nengaged in good faith in any of the above activities is prohibited and will be addressed in\nthe most serious way by Illinois Tech. Anyone who suffers retaliation or is aware of possible\nretaliation or has other concerns regarding the response to a complaint of sexual\nmisconduct should report such concerns to the Title IX Coordinator or the Dean of\nStudents; either party will investigate the matter and make findings so Illinois Tech can take\nStudent Handbook 113\n\nappropriate actions to address such conduct in a fair and impartial manner. The Title IX\nCoordinator may be reached at 312.567.5725 or foster@illinoistech.edu. The Dean of\nStudents may be reached at 312.567.3081 or dos@illinoistech.edu\n8. AMNESTY FOR SEXUAL MISCONDUCT REPORTING PARTY AND WITNESSES\nIllinois Tech encourages reporting of sexual misconduct and seeks to remove any barriers\nto an individual making a report. To this end, Illinois Tech recognizes that an individual who\nwas drinking or using drugs at the time of such an incident may be hesitant to make a\nreport because of potential consequences for their own conduct. Accordingly, an\nindividual(s) who, in good faith, reports sexual misconduct that was directed at them or\nanother person, either as a reporting party or a third party witness, will not be subject to\ndisciplinary action by Illinois Tech solely for their own personal consumption of alcohol or\ndrugs.\nO. Sexual Offender Registration Act Compliance\nAny student who is required by the Illinois Sexual Offender Registration Act (730 ILCS 150/1\net seq.) to register is expected to do so promptly in accordance with the terms of the Act.\nWith respect to registering with Illinois Tech, such student is to register with Illinois Tech’s\nDirector of Public Safety (or designee), and appointments to so register may be made by\ncontacting the Department of Public Safety at (312) 808-6300 or by visiting its office, which\nis located at 3424 South State Street, Suite 115. Notwithstanding any other provision of this\nStudent Handbook to the contrary, Illinois Tech reserves the right to expel or take other\ndisciplinary action provided for herein, including, but not limited to, temporary suspension,\nagainst any student who is required to register and fails to do so.\nP. Smoking Policy\nIllinois Tech is subject to the Illinois Clean Indoor Air Act and Chicago Clean Indoor Air\nOrdinance, which stipulates that smoking, including the use of e-cigarettes and\ncomparable devices, is banned in all enclosed public places and places of employment as\nwell as student residence halls. On Illinois Tech campuses, these places include:\n Any Illinois Tech residential building;\n All enclosed workplaces;\nStudent Handbook 114",
  "metadata": {
    "pages": [
      114,
      115
    ],
    "word_count": 798
  }
}