{
  "chunk_id": "Student_Handbook_chunk_0015",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "50-51",
  "page_count": 2,
  "text": "students, are subject to the policies, procedures and provisions of the Illinois Tech\nChicago-Kent College of Law Student Handbook\n(www.kentlaw.edu/depts/acadadm/handbook.html), and all such students should refer to\nthe Illinois Tech Chicago-Kent College of Law Student Handbook for policies, procedures\nand provisions applicable to them. For the avoidance of doubt, any allegations of Sexual\nMisconduct and Title IX Sexual Harassment to be made against any student of Illinois Tech,\nincluding students enrolled in or otherwise attending Chicago-Kent College of Law, must be\nmade, investigated adjudicated and disciplined only in accordance with this Article II and\nAppendix A, as applicable, and other provisions of this Student Handbook relevant thereto.\nIllinois Tech is a community of scholars that strives to strike a balance between the\nfreedom to pursue intellectual endeavors and a respect for the rights of all community\nmembers to enjoy such freedom to the same extent.\nA. Code of Conduct\nBecoming a member of the Illinois Tech community is a privilege, and by joining in this\ncommunity, Illinois Tech students assume an obligation to conduct themselves in a civil\nand responsible manner compatible with Illinois Tech’s function as an educational\ninstitution. Remaining as a member of the Illinois Tech community requires and is\nconditioned upon each student continuously complying with the policies governing\nstudents’ academic progress, social interactions, health and safety issues, and personal\nbehavior. By this Code of Conduct, Illinois Tech aims to foster an environment of learning\nthrough respect, honesty and integrity for both individuals and organizations alike, and all\nstudents are expected to follow and to uphold the policies set forth in this Code of\nConduct. Individuals are held responsible for their own actions. Representative officers of\nany student organization are held responsible for the group action of the organization to the\nfullest degree they are judged to have control of such action.\nTo the extent provided for in the Code of Conduct, Illinois Tech reserves the right to\ninvestigate and resolve any report or incident in which a student, multiple students, or a\nstudent organization affiliated with Illinois Tech or any of its schools or departments\n(undergraduate or graduate) is alleged to have violated any of the principles or policies set\nforth in this Code of Conduct or otherwise published by Illinois Tech regardless of the\nlocation where the incident occurs; provided such alleged violation occurred at any time\nafter a student’s application for admission has been accepted but prior to the actual\nStudent Handbook 49\n\nawarding of a degree. For the avoidance of doubt, Illinois Tech will not investigate and\nresolve incidents that occur prior to or after this time period. Illinois Tech reserves the right\nto investigate and resolve such an alleged violation regardless of whether it occurred on\ncampus, off campus or via the Internet or other electronic means. In addition, students are\nexpected to follow the policies and procedures of institutions that they may visit, including,\nwithout limitation, during international travel.\nIllinois Tech and residence hall guests are expected to follow all Illinois Tech policies,\nincluding without limitation, those in this Code of Conduct. Student hosts are accountable\nfor the conduct of their guests and may be subject to disciplinary action as the responsible\nparty for violations of Illinois Tech policy resulting from the conduct of their guests. This\napplies to individuals, groups and student organizations.\nStudents are encouraged to alert Illinois Tech officials of emergencies and of behavior that\nis inconsistent with this Code of Conduct and published Illinois Tech policies. All\nemergencies should be reported to the Department of Public Safety at 312-808-6363; all\nsuch behavior may be reported to any of the officials listed in Article II Section B (2). All\nmembers of the Illinois Tech Community may also file an electronic incident report, which\ncan be filed anonymously. The reporting form is found online\nat\nwww.iit.edu/incidentreport.\nThe Following Actions Constitute Violations of the Code of Conduct:\n1. Alcohol and Other Drugs\nA caring, safe, and well-informed community fosters an environment in which we can all\nlive and learn. To that end, the Illinois Tech community aims to share responsibility for\npromoting healthy behavior. In an effort to support each individual’s health and wellbeing,\nwe assist students, staff and faculty in understanding the risks associated with consuming\nalcohol and other drugs while seeking to minimize the harm to self and others caused by\nthe misuse and abuse of these substances. To this end, Illinois Tech has adopted a Policy\non Drugs and Alcohol, which is detailed in Article III, Section F of this Student Handbook\nand is posted at\nStudent Handbook 50",
  "metadata": {
    "pages": [
      50,
      51
    ],
    "word_count": 762
  }
}