{
  "chunk_id": "Student_Handbook_chunk_0047",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "118-119",
  "page_count": 2,
  "text": "associated therewith will be determined in accordance with the applicable terms and\nprovisions of the sponsorship agreement. In such instances, the ownership of and the\nrights to use the work will generally vest with Illinois Tech and/or the sponsoring entity, not\nthe student. Any invention, creation or copyrightable work, including software, stemming\nfrom a sponsored research project must be disclosed to Illinois Tech in accordance with\nthe procedures set forth in Appendix K of the Illinois Tech Faculty Handbook. Appendix K\ncan be found at -\nweb.iit.edu/general-counsel/faculty-handbook.\nIn general, because IPROs are done for course credit, IPROs are not considered sponsored\nor funded research projects. This means that the ownership of and the rights to use works\ncreated in connection with an IPRO are governed by the preceding Section Q(1), Work Done\nfor Course Credit. So an entity supporting a particular IPRO would need to negotiate with\nthe student or students that created a work to secure ownership of or the right to use a\nwork coming out of an IPRO.\n3. Work Done Outside of Course Credit\nTo the extent that any work created by a student or students is other than for course credit\nor to satisfy a degree requirement and qualifies as “personal research”, as defined in\nAppendix K of the Illinois Tech Faculty Handbook, such work belongs to the student or\nstudents and any other individuals, including, but not limited to, Illinois Tech faculty\nmembers, who created it. The rights in any such work will be determined by applicable\npatent, copyright or other intellectual property rights statutes and the facts and\ncircumstances of any particular collaborative effort. As such, anyone wishing to use such\nwork must obtain the student’s or students’ or others’ consent, which they may grant as\nthey deem appropriate.\nTo the extent that any work created by a student or students and any other individuals,\nincluding, but not limited to faculty members, is other than for course credit or to satisfy a\ndegree requirement and qualifies as “university research”, as defined in Appendix K of the\nIllinois Tech Faculty Handbook, such work belongs to Illinois Tech, and the rights of the\nstudent or students and others with respect to such work are as set forth in Appendix K.\nAny invention, creation or copyrightable work, including software, stemming from\nuniversity research must be disclosed to Illinois Tech in accordance with the procedures\nset forth in Appendix K. Appendix K can be found at\nweb.iit.edu/general-counsel/faculty-handbook.\nStudent Handbook 117\n\n4. Illinois Tech Policy\nThe rules established by this Section shall apply across all academic units of Illinois Tech.\nAlthough academic units may adopt policies that supplement, but not contradict or limit,\nthe rules established by this Section, in the event of any conflict between the rules of this\nSection and the policies of an academic unit, the rules of this Section shall for all purposes\ngovern and control.\nR. Use of Technology Resources Policy\nIllinois Tech’s information technology resources are provided with the understanding that\nall members of the Illinois Tech community will use them in a spirit of mutual cooperation.\nResources are limited and must be shared. All users are required to abide by the terms and\nprovisions of Illinois Tech’s policies regarding the Use of Technology Resources, and Use of\nUniversity-Provided Mobile Internet which are incorporated by this reference, posted at\nhttps://web.iit.edu/general-counsel/resources/policies-and-procedures, sections Q3 and\nQ10. In sum, use of Illinois Tech’s technology resources and access to its networks are\nprivileges granted by Illinois Tech to authorized users and may be suspended with or\nwithout notice when, in Illinois Tech’s judgment, continued use of these resources may\ninterfere with the work of others, place Illinois Tech or others at risk, or violate federal, state\nor local laws, including without limitation, those related to copyright protection, or Illinois\nTech policy.\nS. Prohibition Against Retaliation\nIllinois Tech expressly prohibits any employee, including a student employee, or faculty\nmember from taking any retaliatory action against a student because they, acting in good\nfaith, (i) disclose, threaten to disclose or are about to disclose an activity, policy or practice\nthat the student reasonably believes violates the law or Illinois Tech policy or procedures;\nor (ii) initiate or to initiate any complaint, process or procedure provided by Illinois Tech\npolicies. This prohibition against retaliation also prohibits a student from taking any\nretaliatory action against another student because they, acting in good faith: (i) initiated a\ncomplaint, process or procedure under the Illinois Tech Code of Conduct and Conduct\nDiscipline; (ii) participated in an investigation of a complaint; or (iii) testified at a hearing\nregarding the complaint.\nStudent Handbook 118",
  "metadata": {
    "pages": [
      118,
      119
    ],
    "word_count": 770
  }
}