{
  "chunk_id": "Student_Handbook_chunk_0033",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "89-90",
  "page_count": 2,
  "text": "Illinois Tech facilities or on Illinois Tech property with the permission of the Vice President\nfor External Affairs, or their designee.\nJ. Non-Discrimination Policy\nIt is the intention of Illinois Tech to act in accordance with all regulations of the federal,\nstate and local governments with respect to providing equality of opportunity in\nemployment and in education, including, but not limited to, all student-related programs\nand activities, graduate and undergraduate, full-time and part-time, insofar as those\nregulations may pertain to Illinois Tech. Illinois Tech prohibits and will act to eliminate\ndiscrimination on the basis of race, color, religion, national origin, gender, sexual\norientation, age, disability, veteran status or other statutorily protected classes. Pursuant\nto the foregoing, it is the policy of Illinois Tech to comply with the Americans with\nDisabilities Act of 1990, as amended, and Section 504 of the Rehabilitation Act.\nFurthermore, reasonable accommodations will be provided to qualified individuals with\nphysical or mental disabilities. Inquiries regarding reasonable accommodations should be\ndirected to the Center for Disability Resources: Illinois Tech Tower, 10 W 35th Street 3rd\nFloor Suite 3F3-1, Chicago, IL, Tel: 312.567.5744, TDD: 312.567.5135, Fax: 312.567.3845,\ndisabilities@illinoistech.edu.\nAny student or applicant of Illinois Tech who believes that they have received inequitable\ntreatment because of discrimination violating Illinois Tech’s stated policy of equal\nopportunity in employment and in education should communicate, either in writing or in\nperson, with the Director of Equal Opportunity and Affirmative Action, Illinois Tech Tower,\n10 W. 35th Street, 19th Floor, 312.567.3134. See Section E above for additional details and\ninformation.\nIn addition, Illinois Tech does not discriminate on the basis of sex and prohibits sex\ndiscrimination in any educational program and activity it operates, as required by Title IX\nand its regulations, including admission and employment. Title IX Coordinator is\nresponsible for monitoring Illinois Tech’s overall implementation of and compliance with\nTitle IX and its regulations. Inquiries about Title IX may be referred to Illinois Tech’s Title IX\nCoordinator, Virginia Foster. Ms. Foster’s contact information is: 312-567-5725,\nfoster@illinoistech.edu, Room 13D6-21 of the Illinois Tech Tower, 10 West 35th Street in\nChicago. Inquiries regarding Title IX may also be directed to the Office of Civil Rights of the\nU.S. Department of Education, whose website is\nwww2.ed.gov/about/offices/list/ocr/index.html.\nStudent Handbook 88\n\nIllinois Tech’s nondiscrimination policy and grievance procedures can be located in the\nStudent Handbook, the Office of Title IX’s website, the Human Resources website, and in\nthe Faculty Handbook.\nTo report information about conduct that may constitute sex discrimination or make a\ncomplaint of sex discrimination under Title IX, contact the Title IX Coordinator, Virginia\nFoster. Ms. Foster’s contact information is: 312-567-5725, foster@illinoistech.edu, Room\n13D6-2 of the Illinois Tech Tower, 10 West 35th Street in Chicago. Reporting conduct or\nmaking a complaint of sex discrimination may be submitted electronically by completing\nIllinois Tech’s Community Report Form (Incident Report) at www.iit.edu/incidentreport\nK. Posting Policy - Use of Bulletin Boards and Posting of Campus Wide Information\nIllinois Tech provides various posting fixtures and locations that may be used to advertise\norganizations, programs, events and services of interest to the Illinois Tech\ncommunity. Any party wishing to advertise is solely responsible for the content of its\nadvertisement and must follow the policies listed below. Illinois Tech in no way endorses or\napproves the content of the advertisement or the program or services that a posting\npromotes.\n1. Guidelines\nPosting must be made in compliance with the following guidelines. Postings not in\ncompliance with these guidelines will not be approved for posting and will be\nremoved. Campuses other than the Mies Campus may have additional rules and\nrestrictions. Questions, complaints, reports of violations, or appeals regarding the policy\nshould be directed to the Office of Student Affairs (dos@illinoistech.edu).\n All items for posting including, but not limited to, flyers, posters, table tents,\nleaflets, handbills or similar material must receive prior approval from the Office of\nStudent Affairs/Student Life. Additionally, student organization election materials\nare subject to these general regulations, as well as any election rules of the Office of\nStudent Life and/or appropriate governing organization. Postings that, in the opinion\nof Illinois Tech, are deemed to be offensive, indecent, or oppressive to others or that\nare incompatible with the educational mission or legal obligations of Illinois Tech\nare prohibited as are postings that contain material inconsistent with copyright,\ntrademark and other such laws. Leaflets, handouts and table tent materials are to\nStudent Handbook 89",
  "metadata": {
    "pages": [
      89,
      90
    ],
    "word_count": 734
  }
}