{
  "chunk_id": "Student_Handbook_chunk_0024",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "71-72",
  "page_count": 2,
  "text": "witnesses whose testimony would be redundant or not germane to the charges; and (ii) to\ncross-examine any witness that is called to testify in support of the charges, provided that\nthe chair may, in their discretion, limit such cross-examination to the extent it is not\ngermane to the charges, is redundant or becomes abusive or harassing. Members of the\nCampus Judicial Board may, as each deems appropriate, ask questions of any witness\ncalled or regarding any evidence submitted. To the extent deemed necessary to maintain\ndecorum or to protect students from harassment or to ensure the integrity of the process,\nthe chair, in their sole discretion, may require a student to direct questions to the chair who\nwill then ask them of a witness or witnesses. Further, for the same reasons, the chair may\nseparate and/or shield parties from one another, and such actions shall be permissible as\nlong as the parties can hear and respond to one another in real time.\nA recording of the hearing will be made and will remain the sole property of Illinois Tech. No\nother record of the hearing may be made. Students will be notified in writing of the\ndecision of conduct proceedings, including sanctions imposed. For additional information\non the hearing process, contact the Office of Community Standards (312.567.5172).\nSolely with respect to any conduct hearing, whether before the Dean of Students or their\ndesignee or the Campus Judicial Board, concerning an alleged sexual misconduct\nviolation, the foregoing procedures shall be supplemented by those set forth in Article IV,\nSection N of this Handbook.\niv. Admission by Student: Notwithstanding any other provision of this Disciplinary\nProceeding section, if a student admits in writing to a violation of the Code of\nConduct and waives their right to a hearing, then the Dean of Students or their\ndesignee may impose such sanction as they deem appropriate without any hearing\nbut after affording the student an opportunity to explain their actions, including any\nmitigating factors that the student may deem relevant; provided, however, if the\nviolation could result in a sanction of suspension or expulsion, then the student’s\nwritten admission and waiver must acknowledge this fact. If the violation concerns\nsexual misconduct, then the person who experienced the misconduct will be\nprovided the opportunity to meet with the Dean of Students or designee to discuss\nthe matter, including its impact on them. In such cases, the student should be\nadvised of the sanction(s) imposed within seven calendar days of receipt of their\nwritten admission and waiver.\nStudent Handbook 70\n\nv. Student Withdrawal from School: A student who withdraws from school while\ndisciplinary action is pending, or who is involved in misconduct after withdrawal\nthat would subject them to disciplinary action, may be required to appear in a\ndisciplinary proceeding under this Article II with respect to such action before\npermission to resume studies is granted.\nC. Conduct Sanctions, Including Temporary Conduct Sanctions\n1. Sanctions\nSanctions that may be applied by the Greek Council are described in its Constitution.\nSanctions that may be applied by the Office of Residence Life are described in the\nResidence Life Handbook. The Dean of Students or their designee or the Campus Judicial\nBoard is authorized to impose one or more of the following sanctions when a violation or\nviolations of the Code of Conduct has been found to have occurred; provided, however, the\nDean of Students may only impose suspension or expulsion if the student has received the\nnotice required above and waived their right to a hearing before the Campus Judicial Board:\nDisciplinary Warning. An official written notification that a student’s behavior is in\nviolation of Illinois Tech regulations or standards, which will also clarify expected behavior\nin the future. This sanction may or may not carry with it conditions or restrictions of\nprivileges.\nRestitution. A student is required to make monetary restitution for theft of or damage to\nIllinois Tech property or to that of a member of the Illinois Tech community, or for expenses\nincurred as a result of the student’s actions.\nFines. Illinois Tech reserves the right to assess a fine for misconduct.\nSuspension of network access. A student’s access to the Illinois Tech computer network\nor the web may be denied for violations that involve the use, directly or indirectly, of the\nnetwork. Offenses to which this sanction may apply include, but are not limited to,\nviolation of the Use of Technology Resources and Use of University Provided Mobile\nInternet policies, harassment and stalking.\nEducational sanctions. A student is required to perform one or more educational\nsanction(s) appropriate to the offense. These may include a formal apology (in writing\nStudent Handbook 71",
  "metadata": {
    "pages": [
      71,
      72
    ],
    "word_count": 777
  }
}