{
  "chunk_id": "Student_Handbook_chunk_0019",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "61-62",
  "page_count": 2,
  "text": "15. Unauthorized Access\nUnauthorized access or entry to, presence in or use of Illinois Tech properties, physical and\nvirtual, including the following:\n Illinois Tech facilities, property, electronic or digital systems, or services;\n Roofs, balconies or fire escapes of any Illinois Tech building or facility for any\npurpose except in case of an emergency;\n Hosting an event in an Illinois Tech-owned or Illinois Tech-operated facility, property\nor space that exceeds policies governing that space, including capacity or time\nrestrictions; and\n Possession, duplication, distribution or use of keys, access codes, access cards or\nother means of entry or access to any Illinois Tech property, premises or location.\n16. Violation of Published Regulations\nViolation of published Illinois Tech regulations, including, without limitation, the Use of\nTechnology Resources, Use of University Provided Mobile Internet, Concealed Carry and\nProhibition Regarding Firearms and Weapons on Campus, No Smoking Policy and policies\nand regulations relating to entry and use of Illinois Tech facilities. (See, for example,\nResidence Life Handbook, Illinois Tech Bulletins, Illinois Tech Policies & Procedures\nManual, and such similar policies and manuals of general applicability.) All of the\nforegoing policies and regulations are hereby incorporated into this Code of Conduct. It is\nthe expressed obligation of all students to familiarize themselves with these policies and\nregulations. To this end, all are available on the Illinois Tech website.\n17. Violation of Law\nViolations of federal, state or municipal laws that occur on or off campus and that impact\nthe operations of Illinois Tech, disrupt the education environment of Illinois Tech or are\nperpetrated against Illinois Tech or an Illinois Tech affiliate, employee, faculty member,\nstudent, alumni or guest.\nStudent Handbook 60\n\n18. Complicity\nEncouraging, assisting, conspiring, or hiring another to engage in, or being an accessory to\nany conduct prohibited by this Code of Conduct will be considered a violation of this\npolicy.\nB. Conduct Discipline\nThe student conduct process, which exists in order to maintain the safe and efficient\noperations of Illinois Tech and to aid in advancing its academic mission, is based on the\nassumption that disciplinary procedures, when required, should aim to be an educational\nprocess, while also maintaining the safe and efficient operations of Illinois Tech and\nprotecting its community. Disciplinary sanctions are primarily imposed to help students\ndevelop individual responsibility and encourage self-discipline, to foster a respect for the\nrights of others, and to protect the rights, freedoms and safety of all members of the Illinois\nTech community. Hearings or appeals processes are not courts of law and are not\ngoverned by criminal or civil court procedures; however, the processes aim to provide for\nthe timely, fair and impartial investigation and resolution of each matter. In adjudicating\nany alleged violation(s) of the Code of Conduct, the preponderance of the evidence\nstandard is employed, meaning the facts and circumstances and reasonable inferences\ndrawn therefrom indicate that it is more likely than not the violation occurred. The only\nprocess to which a student is entitled is the process provided for in this Student\nHandbook. However, because some violations of the Code of Conduct are also violations\nof the law, students may be accountable to both law enforcement agencies and Illinois\nTech for their actions. Illinois Tech’s student discipline process will normally proceed\nnotwithstanding any external civil or criminal proceeding.\n1. Amnesty Policy\nIn an effort to encourage students to help one another by contacting the appropriate\nadministrative department or authority in critical situations (Public Safety, Residence Life,\nOffice of Student Affairs, Student Health & Wellness Center) or 911 Emergency Assistance,\na student who seeks assistance for another student, who is experiencing a drug or alcohol\nemergency, will generally not be subject to disciplinary action by the Office of Student\nAffairs. This provision applies only to individuals, not organizations. To be clear, this policy\nis not meant to promote unlawful drug or alcohol use among students. Rather, it is\nintended to provide a provision within the Code of Conduct to encourage responsible\nreporting to an appropriate authority when a student is in need of help. Accordingly, it is\nStudent Handbook 61",
  "metadata": {
    "pages": [
      61,
      62
    ],
    "word_count": 681
  }
}