{
  "chunk_id": "Student_Handbook_chunk_0046",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "116-117",
  "page_count": 2,
  "text": " The Bog and all dining facilities;\n Public places;\n Public restrooms, lobbies, reception areas, hallways and other common use areas\nin public buildings, apartment buildings and condominium buildings;\n Within 25 feet of the entrance to enclosed public buildings or places; and\n Recreational areas including enclosed sports arenas, stadiums, swimming pools,\nice and roller rinks, arcades and bowling alleys.\nFurther, Illinois Tech requires students, faculty members, employees and guests wishing to\nsmoke to do so at least 25 feet away from the entrances, windows and air intakes to any\nbuilding.\nViolations of the no smoking policy should be reported to the building representative\nwho shall forward them to the appropriate administrative officer.\nQ. Student Intellectual Property\n1. Work Done for Course Credit or Degree Requirement\nWork done for course credit by students, including IPROs, and work done by a student as a\ndegree requirement, including master’s theses, Ph.D. theses and comparable final\nprojects, as such theses and projects are required to be substantially the original work of\nthe students, are not considered university-owned for purposes of Illinois Tech’s copyright\nand patents policies. All such works belong exclusively to the students, and in such\nsituations, the fact that a faculty member may provide constructive criticisms, editorial\nsuggestions or other forms of guidance does not change this fact, as such undertakings are\na normal and customary part of a faculty member’s duties. Faculty or staff members\nwishing to use any such student-created work for their own purposes or for Illinois Tech\npurposes must obtain the student’s consent and, at a minimum, provide adequate credit\nto the student.\nIn general, if work done for course credit by students is a collaborative effort among a group\nof students (e.g. IPROs), meaning each such student actively participated and contributed\nto the creation of the work, then, each student will likely be deemed a creator/inventor of\nthe work, and each student will have the right to use and allow others to use the work\nStudent Handbook 115\n\nwithout the need to secure the consent of and without obligation to the others. Prior to\ncommencement of a collaborative effort, participating students should consider the merits\nof entering into a written agreement among themselves setting forth various matters\nrelated to the ownership and use of such works, including, without limitation, how and\nwhen such work may be used. In any event, even absent an agreement, students should\nalways give appropriate attribution to all team members involved whenever the work is\nused or authorized for use. The foregoing is intended as merely a general statement.\nStudents must understand that the actual rights of each student participating in a\nparticular collaborative effort will ultimately be determined by applicable patent, copyright\nor other intellectual property rights statutes and the facts and circumstances of the\nparticular collaborative effort.\nNotwithstanding the foregoing, if the course description contained in the Undergraduate or\nGraduate Bulletin clearly states language akin to the following:\n“The applicable academic unit hereby gives notice of its desire to secure a non-exclusive,\nperpetual, royalty-free license solely to use, at its discretion, student-created work\nproduced in [Insert Course Name and Number], with appropriate attribution, for its own\nnon-commercial and educational purposes, including to promote the programs of the\nacademic unit. Unless the student submits a written notice to the Dean of the College\nindicating that they do not agree to grant such a license by the last regularly scheduled day\nof the course, then the student shall be deemed to have granted the foregoing described\nlicense.”\nthen the academic unit may so use work done for course credit by a student. The foregoing\nexception does not apply to work done by a student as a degree requirement, such as a\nmaster’s thesis, Ph.D. thesis and comparable final project.\n2. Work Done with Third-Party Sponsorship\nOwnership of and the right to use work created as part of a research project that is\nsponsored or funded by a third party, whether a government agency, foundation or\ncorporation, generally qualifies as university research, and the ownership of and use rights\nStudent Handbook 116",
  "metadata": {
    "pages": [
      116,
      117
    ],
    "word_count": 681
  }
}