{
  "chunk_id": "Student_Handbook_chunk_0067",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "164-165",
  "page_count": 2,
  "text": "C. Requirements\nAll student and recognized student organization travel falling under this Policy must meet\nthe following requirements:\n1. To assure that travel involving students is consistent with Illinois Tech’s mission and\nthat student safety issues have been addressed, Illinois Tech sponsored student\ntravel must be approved in advance by an appropriate administrator. The organizing\nindividual or group must prepare and provide a travel summary to the appropriate\nadministrator for their review and approval not less than sixty days (60) days prior to\nthe date of the proposed travel. An appropriate administrator may request that a\ntravel summary be supplemented with such additional information as they deem\nappropriate in order for him or her to make an informed decision. In general, for\nIllinois Tech sponsored student travel the purpose of which is academic, such as a\nconference (attending or presenting), competition, or research, involving students\nfrom more than one College, then an appropriate administrator from each College\nmust approve it.\nApproval decisions of an appropriate administrator must be consistent with the provisions\nof this Policy. An appropriate administrator should not approve travel if they determine that\nsafety, security or health conditions pose an undue risk to the traveler(s).\n An appropriate administrator should not approve travel if they determine that safety,\nsecurity or health conditions pose an undue risk to the traveler(s).\n Students shall not be required to study or do research in locations affected by an\nU.S. State Department Travel Warning in order to satisfy a degree requirement or to\nreceive a grade for a class.\n Travel to a country where the U.S. State Department has issued a mandatory\nevacuation order shall not be permitted.\n Recognized student organization travel must be consistent with the organization's\nmission statement and constitution on file with the Office of Student Life, and travel\nmust be planned so as not to create an undue interference with academic\nresponsibilities.\n Students on academic or disciplinary probation or on leave from Illinois Tech should\nnot be approved for any Illinois Tech sponsored student travel.\n Students traveling outside of the United States need to attend a pre-departure\nhealth, safety and security meeting provided by Illinois Tech’s Office of Global\nServices.\nStudent Handbook 163\n\nIf the appropriate administrator approves a travel summary, then they shall sign the travel\nsummary noting their approval and return it to the organizing individual or group and, for\ntravel outside of the United States, provide, as described in 2 below, a copy of the approved\ntravel summary to Illinois Tech’s Office of Global Services. If the appropriate administrator\ndoes not approve a travel summary, then they shall return the travel summary unsigned to\nthe organizing individual or group and notify the organizing individual or group of the reason\nfor the non-approval. In the case of non-approval, the organizing individual or group may\nattempt to modify the travel summary to overcome the objections of the appropriate\nadministrator and resubmit the travel summary to the appropriate administrator.\n The travel summary with the signature of the appropriate administrator must be\nsubmitted to Illinois Tech’s Office of Global Services, no later than thirty (30)\ncalendar days before the scheduled trip. No changes may be made to the travel\nsummary without the approval of the appropriate administrator who initially\nauthorized the travel.\n All students traveling must complete and submit a Voluntary Assumption of Risk\nand Release and Waiver of Liability Agreement and an Emergency Contact and\nMedical Information Form, available from the Office of General Counsel, to Illinois\nTech’s Office of Global Services no later than fifteen (15) calendar days before the\nscheduled trip. Illinois Tech’s Office of Global Services will provide such travel\norientation and/or information as appropriate given the specifics of the trip. In the\nevent that the proposed itinerary includes a location under a U.S. State Department\nTravel warning, the existence of such warning and information related thereto will be\nset forth in the Voluntary Assumption of Risk and Release and Waiver of Liability\nAgreement. Illinois Tech’s Office of Global Services shall maintain these forms for a\nperiod of six (6) months from the conclusion of the travel covered thereby.\n Unless otherwise explicitly approved, all Illinois Tech sponsored student travel must\nbe chaperoned by a faculty or staff member. If approval to travel without such a\nchaperone is granted, then a student officer from the recognized student\norganization must accompany the trip; provided, however, a student may not lead\nIllinois Tech sponsored student travel to a location that is under a travel warning.\nIllinois Tech will view this student officer as the party responsible for the trip. The\nfaculty or staff member or student officer must carry a copy of emergency contact\ninformation for all students participating in the trip as well as relevant Illinois Tech\ncontact numbers.\nStudent Handbook 164",
  "metadata": {
    "pages": [
      164,
      165
    ],
    "word_count": 803
  }
}