{
  "chunk_id": "Student_Handbook_chunk_0038",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "100-101",
  "page_count": 2,
  "text": "Note: Sexual misconduct (as defined in Section N below) is a form of sexual\nharassment, but not all sexual harassment constitutes sexual misconduct. The\nadjudication of claims of sexual misconduct will be handled pursuant to and in\naccordance with the policies and procedures applicable to sexual misconduct under\nArticle II or, if the sexual misconduct constitutes Title IX Sex Discrimination including\nSex-Based Harassment in Appendix A.\na. Informal Resolution\nWhere appropriate, an informal resolution process can be used to resolve allegations of\nsexual harassment and, in some limited cases, sexual misconduct to stop the conduct,\naddress the effects, and prevent its recurrence without implementing the formal action.\nInformal resolution is voluntary, and it must be agreed to by the relevant parties and Illinois\nTech. To this end, after consulting with the reporting party, the party alleged to have\ncommitted the harassment will be met with and be provided the written complaint or a\nsummary thereof. A student has the right to initiate the formal resolution process at any\ntime. The informal resolution process set forth in this Section is available only for\nsexual harassment or sexual misconduct that does not constitute Title IX Sex\nDiscrimination including Sex-Based Harassment. The implementation of this informal\nprocess will be the responsibility of the Dean of Students, with the support of and\npermitted designation of duties to other Illinois Tech officials. The willingness of the parties\nto participate voluntarily in informal resolution will be documented.\nThe informal resolution process is intended to be flexible so as to allow latitude for the\ndevelopment and use of a process that works for the parties. With that, it is typically\nexpected that the party conducting the informal resolution process will meet with both\nparties separately with the aim of reaching a mutually agreed to resolution, but when\nwarranted and agreed to by the parties can conduct joint meetings. A person may be\naccompanied by an advisor during the process, but the advisor is not permitted to speak or\nact for the person during the informal resolution process. If the parties reach an\nunderstanding to resolve the matter informally, their understanding will be memorialized in\nan agreement signed by the parties and Illinois Tech. Either party may request in writing\nthat the informal resolution process be terminated at any time up until a written agreement\nfor resolving the matter has been signed, upon such request the formal action will\ncommence. Illinois Tech may, at its discretion, also commence the formal resolution\nprocess at any time. It is generally expected that the informal resolution process will be\nStudent Handbook 99\n\ncompleted within 30 calendar days, but this period can be extended with the agreement of\nthe parties.\nThe following is a list of examples, which list is not exhaustive, of the possible outcomes of\nthe informal resolution process:\n A Mutual No Contact Order between the parties;\n Educational training for the responding party on issues related to sexual harassment\nor misconduct;\n Volunteering at a community-based organization;\n Changes and accommodations with work and living arrangements;\n Assistance with requesting academic accommodations; and\n An apology letter to the reporting party taking responsibility for harm caused\nOnce a resolution agreement has been executed by the parties, Illinois Tech will neither\nresume nor initiate the formal action with respect to any allegations resolved therein or\narising out of the same facts or circumstances as those allegations. If a party fails to fulfill\nthe terms of the resolution agreement, Illinois Tech may initiate a Code of Conduct\nviolation under Article II of this Student Handbook for Failure to Comply Code of Conduct\ncharge.\nb. Formal Action\nAt their option, a student reporting sexual harassment or misconduct may, at their\ndiscretion, elect to forego or to cease Informal Resolution and to proceed with Formal\nAction. This means that the appropriate, formal Illinois Tech policies and procedures will\nbe utilized to investigate and resolve the complaint. In the case of student-on-student\nsexual harassment and in cases where the accused is a student, such policies and\nprocedures are those provided for in this Student Handbook. If an Illinois Tech faculty or\nstaff member experiences sexual harassment, they should contact the Office of Title IX\nCompliance and refer to such policies and procedures as those provided in the Faculty\nHandbook and Human Resources Policies and Procedures Manual, respectively.\nStudent Handbook 100",
  "metadata": {
    "pages": [
      100,
      101
    ],
    "word_count": 727
  }
}