{
  "chunk_id": "Student_Handbook_chunk_0080",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "184-185",
  "page_count": 2,
  "text": "XLVI. New evidence or information that was not reasonably available at the time the\ndetermination regarding responsibility or dismissal was made, that could affect the\noutcome of the matter;\nXLVII. Claims that the Title IX Coordinator or designee, Investigator(s), or Decision-\nMaker(s) had a conflict of interest or bias for or against complainants or respondents\ngenerally or the individual complainant or respondent that affected the outcome of\nthe matter; and\nXLVIII. The sanction is disproportionate with the violation.\nA complainant or respondent who wishes to appeal must submit a notice of appeal to the\nTitle IX Coordinator within 5 calendar days of the date of the Title IX Decision-Maker’s\ndecision. An appeal must be filed by email to the Title IX Coordinator at\nfoster@illinoistech.edu.\n6. UPON RECEIPT OF AN APPEAL:\nThe Title IX Coordinator or designee must do the following:\nXLIX. Notice of Appeal: Within 5 calendar days of receipt of the appeal, notify the other\nparty in writing that an appeal was filed;\nL. Equal Treatment–Appeal: Implement appeal procedures equally for both parties;\nLI. Different Title IX Appellate Decision-Maker: Ensure that the Appellate Decision-\nMaker is not the same person as the Title IX Decision-maker that reached the\ndetermination regarding responsibility or dismissal, the Title IX Investigator(s) or\nTitle IX Informal Resolution Facilitator, if any, assigned to the Formal Title IX\nComplaint, or the Title IX Coordinator or designee; and\nLII. Appeal Standards Met: Ensure that the Title IX Appellate Decision-maker complies\nwith the standards set forth in this policy for appeals.\nUpon receipt of an appeal, the Title IX Appellate Decision-Maker must do the following:\nLIII. Equal Treatment – Written Statement: Given due consideration to the facts and\ncircumstances of a particular case, give both parties a reasonable, equal opportunity\nto submit a written statement in support of, or challenging, the outcome. In general,\nthis means that each party will be made aware of, on, at least, a summary basis, the\nreason(s) of any appeal filed by the other party and provided the opportunity to\nsubmit a response thereto within 5 calendar days;\nLIV. Written Appeal Decision: Issue a written decision describing the result of the appeal\nand the rationale for the result within 30 calendar days after the Title IX Appellate\nDecision - Maker’s receipt of the last written statement from a party; and\nLV. Notice of Written Appeal Decision: Provide the written decision on appeal\nsimultaneously to both parties.\nIf an appeal is successful, the Title IX Coordinator or designee will remand the matter back to\nthe appropriate member of the Title IX Team to remedy the concern. A determination\nregarding responsibility becomes final on the date that (1) if an appeal is filed, the Title IX\nAppellate Decision-Maker provides the parties with the written determination of the result\nof the appeal upholding the determination; or (2) if an appeal is not filed, the date on which\nan appeal would no longer be considered timely. The Title IX Coordinator or designee is\nresponsible for effective implementation of any remedies.\n18\n\n7. AFTER THE CONCLUSION OF THE SEX DISCRIMINATION/SEX-BASED\nHARASSMENT PROCESS:\nIllinois Tech or the parties may exercise any rights ancillary to this Title IX process as\nnecessary, e.g., disciplinary processes for suspensions or expulsions of students; tenured\nfaculty dismissal proceedings; any other pre-remedy process required by any applicable law,\nagreement, policy, or contract.\nDISMISSAL OF A FORMAL TITLE IX COMPLAINT\nIllinois Tech must investigate the allegations of sex discrimination/sex-based harassment\nreceived in a Title IX Formal Complaint and must dismiss the complaint if one or more of the\nfollowing occurs:\no The conduct alleged in the Formal Complaint would not constitute sex\ndiscrimination/sex-based harassment as defined in this policy even if\nproved;\no The conduct did not occur in Illinois Tech’s educational program or\nactivity;\no The conduct did not occur against a person in the United States;\nIllinois Tech may dismiss the Title IX Formal Complaint or any allegations therein, if at any\ntime during the investigation or hearing:\no The respondent is no longer enrolled in Illinois Tech education program\nor activity or is no longer employed by Illinois Tech;\no A complainant notifies the Title IX Coordinator in writing that the\ncomplainant would like to withdraw the Formal Complaint or any\nallegations therein\no Specific circumstances prevent the recipient from gathering evidence\nsufficient to reach a determination as to the Formal Complaint or\nallegations therein\no Upon dismissal, Illinois Tech must promptly send written notice of the\ndismissal and reason(s) therefore simultaneously.\nAPPEAL THE DISMISSAL OF A FORMAL TITLE IX COMPLAINT\nIllinois Tech will notify the complainant that the Formal Title IX Complaint was received and\ndismissed and may be appealed and will provide the complainant with an opportunity to\nappeal the dismissal. If the dismissal occurs after the respondent has received a Notice of\nAllegations, then Illinois Tech will also notify the respondent that the dismissal of the Formal\nTitle IX Complaint may be appealed.\nIf the dismissal of a Formal Title IX Complaint is appealed, Illinois Tech will:\n• Notify the Complainant of any appeal, including the basis of the appeal, and\nnotify the Respondent only if a Notice of Allegations was sent;\n• Ensure that the Title IX Decision-maker for the appeal has been trained\nconsistent with the 2020 Title IX regulations;\n19",
  "metadata": {
    "pages": [
      184,
      185
    ],
    "word_count": 883
  }
}