{
  "chunk_id": "Student_Handbook_chunk_0039",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "102-103",
  "page_count": 2,
  "text": "5. Relationships between Students and Faculty/Staff\nAs an institution of higher education dedicated to fostering the dignity of each person, the\nuniversity seeks to create an environment that is free of exploitation and unlawful\nharassment or discrimination as well as any appearance of conflict of interest or\nfavoritism. In addition, the university strongly discourages consensual relationships of a\ndating, intimate and/or sexual nature between a university employee and a graduate\nstudent even when no power relationship or ability to influence exists, as any such\nrelationship may give rise to the perception of favoritism or bias, which undermine the\nspirit of trust and mutual respect that is important in an educational environment. The\nUniversity’s policy on relationships with students is at the following\nlink: https://pws.iit.edu/hr/relationships-students.\nN. Sexual Misconduct\nAs provided for in Appendix A and noted in various sections of Article II and this Article IV,\nTitle IX sex discrimination, including sex–based harassment, must be resolved using the\ngrievance process which includes an investigation, adjudication, and a determination of\nresponsibility for policy violations is solely in accordance with Appendix A. Sexual\nmisconduct that does not fall under Title IX in Appendix A. Sexual Harassment complaints\nwill be investigated, adjudicated, and sanction for violations will be imposed in accordance\nwith Article II. The specific policy and procedural provisions in this Section N are only\napplicable to sexual misconduct under the Code of Conduct, and not sex discrimination\nand sex-based harassment which falls under Title IX.\nAs set forth in the Code of Conduct in this Student Handbook, Illinois Tech prohibits acts of\nsexual misconduct, which includes sexual assault, domestic violence, dating violence,\nsexual exploitation, and stalking. Definitions of the foregoing terms and other relevant\ndetails, including support services and procedural considerations, are set forth in this\nSection N. Illinois Tech respects the fact that the decisions whether to inform authorities\nand which authorities to inform rests with the individual who experienced the sexual\nmisconduct.\nAn individual who experienced sexual misconduct and desires to contact an authority\nshould call the Public Safety Department (312.808.6300) or the Chicago Police Department\nStudent Handbook 101\n\n(or relevant local police department) 911 as soon as possible. Help can also be received\nfrom the Student Health and Wellness Center (312.567.7550), Office of Community\nStandards (312.567.5172), the Title IX Coordinator (312.567.5725) (See Section M above for\nadditional details on the Title IX Coordinator), or the Office of Student Affairs\n(312.567.3081). Representatives from these offices are available to assist the victim in\nnotifying law enforcement authorities if the victim so chooses. An individual who\nexperienced sexual misconduct may also wish to contact a community-based sexual\nassault crisis center, and information, including names, addresses, websites and\ntelephone numbers, for such centers is available at\nweb.iit.edu/student-affairs/vawa-save-acts.\n1. REPORTING INSTANCES OF SEXUAL MISCONDUCT\nIf a person accused of sexual misconduct is an Illinois Tech student, a complaint under the\nCode of Conduct may be formally filed with the Office of Student Affairs, the Title IX\nCoordinator, or a Confidential Advisor (see Subsection 4(b) below). (Again, if the alleged\nsexual misconduct qualifies as Title IX sex discrimination including sex-based harassment,\nas defined in Appendix A, then a complaint thereof must be filed in accordance with the\nprocess set forth in Appendix A.) The privacy of the reporting party and responding party\n(the accused student) shall be protected throughout the proceedings to the extent\npossible, (see Subsection 4 below).\nThough individuals are encouraged to come forward and report crimes, reports may be\nmade anonymously by contacting the Public Safety Department at 312-808-6300 or filing a\nreport at www.iit.edu/incidentreport. All reports of sexual misconduct against and by\nstudents will be reviewed by the Office of the Vice Provost for Student Affairs in\ncollaboration with the Title IX Coordinator; however, the University's ability to investigate\nand to address alleged misconduct reported by anonymous sources is generally\nsignificantly limited. Accordingly, the more information that can be provided, the more\nthorough the investigation will likely be.\nIn cases of sexual misconduct, it is important to preserve relevant evidence as failure to do\nso could compromise any subsequent investigation, jeopardize the ability to punish the\naccused and/or complicate the ability to obtain an order of protection. Though the decision\nof whether and when to report is up to the individual who experienced the sexual\nStudent Handbook 102",
  "metadata": {
    "pages": [
      102,
      103
    ],
    "word_count": 717
  }
}