{
  "chunk_id": "Student_Handbook_chunk_0018",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "58-60",
  "page_count": 3,
  "text": " Periods of silence or social isolation;\n Kidnapping, road trips, abandonment, scavenger hunts or any other involuntary\nexcursions;\n Wearing of uniforms or apparel that is conspicuous and not normally in good taste;\n Engaging in degrading or humiliating games, activities, stunts or buffoonery;\nincluding requiring, encouraging or expecting individuals to carry, possess or\nmaintain objects or items;\n Requiring or compelling the consumption of liquid (including alcohol), food, drinks\nor other substances;\n Servitude or placing another in a position of servitude, including requiring,\nencouraging or expecting a new member to do the tasks of, or to do tasks for, an\nexperienced member, or to address members with honorary or formal titles;\n Taking, withholding or interfering with an individual’s personal property;\n Falsely leading an individual or individuals to believe that they will be inducted or\ninitiated by participating in particular activities;\n Depriving an individual of any privileges of membership or affiliation to which one is\nentitled;\n Removing, stealing, taking or damaging public or private property; and\n Requiring, encouraging or expecting individuals to participate in activities that are\nillegal or unlawful or are not consistent with the group’s mission or values or the\npolicies of Illinois Tech, including this Code of Conduct.\n10. Disruptive and Disorderly Conduct\nDisorderly or disruptive conduct that impacts or could have impacted the educational\nenvironment and/or the efficient operations of Illinois Tech. Examples of the type of\nconduct intended to be covered hereby include, but are not limited to:\n Yelling, cursing, or causing a disturbance;\n Participating in an on-campus or off-campus demonstration or activity that disrupts\nthe normal operations of Illinois Tech and/or infringes on the rights and\nopportunities of the members of the Illinois Tech community;\nStudent Handbook 57\n\n Intentional obstruction or disruption of teaching, research, administration,\ndisciplinary proceedings or other Illinois Tech activities and other authorized\nactivities on Illinois Tech premises;\n Leading or inciting others to disrupt scheduled and/or normal activities in the\nclassroom or in any campus building or areas;\n Behavior such as public urination, “streaking”, “mooning”, “flashing”, and indecent\nexposure in a public area is prohibited;\n Unauthorized production of audio, video, or photographic images of a person in a\nlocation in which that person has a reasonable expectation of privacy, including, but\nnot limited to: residence hall rooms, locker rooms and restrooms. This includes the\nuse of devices such as digital cameras, cell phones, Google Glass, iPads/tablets,\nand the like. For safety reasons, Illinois Tech notes that it has security cameras\ninstalled in public areas of its campuses; and\n Flying of an Unmanned Aircraft Systems (UAS) within 10 feet of any Illinois Tech\nbuilding or any individual(s) who are present on Illinois Tech property.\n11. Misrepresentation\nActs of fraud, misrepresentation, or dishonesty, including, but not limited to the following:\n Forgery, alteration, or misuse of Illinois Tech documents, records, identification or\nother materials;\n Knowingly furnishing false, forged or inappropriately altered information to Illinois\nTech, any Illinois Tech official, or emergency response personnel;\n Intentionally misrepresenting to Illinois Tech or any Illinois Tech official, your status\nat Illinois Tech or utilizing Illinois Tech’s brand, trademarks and the like without\npermission;\n Possession, use, manufacture, or distribution of identification cards or devices that\nare false or fraudulent or that misrepresent an individual’s identity, age or other\npersonal characteristics, including using another individual’s identification; and\n Altering or attempting to alter any electronic record of Illinois Tech via any means of\nunauthorized access, including, without limitation, “hacking.”\nStudent Handbook 58\n\nFor matters related to academic dishonesty, please refer to the Code of Academic\nHonesty.\n12. Title IX Sex Discrimination and Sex-Based Harassment\n Title IX Sex Discrimination including Sex–Based Harassment is defined and shall\nhave the meaning set forth, in Appendix A of this Student Handbook. Complaints of\nTitle IX Sex Discrimination including Sex–Based Harassment must be made in\naccordance with the Title IX Process set forth in Appendix A, and any such\ncomplaint will be exclusively investigated, adjudicated, and sanctioned in\naccordance with said Process.\n13. Sexual Misconduct (Non-Title IX)\nExclusive of allegations that would constitute Title IX Sex Discrimination including Sex-\nBased Harassment , violation of Illinois Tech’s policy on Sexual Misconduct (see Article IV,\nSection N and specifically Section N(6), which include the following:\n Sexual penetration without consent (e.g., rape);\n Sexual contact without consent (e.g., fondling);\n Incest;\n Statutory rape;\n Sexual exploitation;\n Stalking; and\n Dating and domestic violence.\n14. Theft\nTheft or unauthorized use of the property of Illinois Tech or an Illinois Tech affiliate,\nemployee, faculty member, student, alumni or guest, including being in possession of\nstolen property.\nStudent Handbook 59",
  "metadata": {
    "pages": [
      58,
      59,
      60
    ],
    "word_count": 781
  }
}