{
  "chunk_id": "Student_Handbook_chunk_0029",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "81-82",
  "page_count": 2,
  "text": "The foregoing penalties are separate and distinct from any legal action that may be brought\nby a content owner or government entity. Illinois Tech will comply with lawfully issued\nsubpoenas from a content owner or government entity seeking to identify the individual to\nwhom the Internet Protocol (IP) Address and/or computer system is registered.\nE. Procedures for Student Grievances Involving Charges of Discrimination\nAny student at Illinois Tech who believes that they have received discriminatory treatment\nin violation of Illinois Tech’s stated policy of equal opportunity in education should\ncommunicate, either in writing or in person, with the Director of Equal Opportunity and\nAffirmative Action (for purposes of this Section E, the “Director”), ILLINOIS TECH Tower, 10\nW. 35th Street, 19th Floor, 312.567.3134. It will be expected that the grievant shall have\nexhausted all available recourse through normal channels of communication for arriving at\na resolution within the department or the organizational unit within which the\ndiscriminatory treatment is alleged to have occurred prior to lodging a formal complaint of\ndiscrimination hereunder. Such complaint shall, in any event, be filed in writing with the\nDirector within 15 calendar days of the occurrence of the alleged treatment. (Note: The\nGrievance Committee procedures outlined in Subsections 2 through 4 below are not\nintended to replace or to serve as a substitute for or to allow for the re-adjudication of\nmatters that have been brought before and resolved by other recognized formal methods\nfor addressing the grievance (as defined below), such as, but not limited to, those provided\nby the Code of Conduct, the Human Resources Policies and Procedures Manual and\ncomparable methods.)\n1. Preliminary Procedures\nThe grievant shall prepare and present to the Director a written statement describing in\ndetail the nature of the grievance and identifying the person, organizational unit or\ninstitutional practice or regulation against which the charge of discrimination is lodged,\nincluding the facts and circumstances that the grievant deems relevant to the charge\n(which will be termed the “grievance”). The Director will inquire into facts pertaining to the\ngrievance and will make informal attempts to resolve the matter to the satisfaction of both\nthe grievant and the person or organizational unit against which the charge of\ndiscrimination has been brought. Subject to any required legal obligations and to the extent\npracticable while still allowing for the investigation of the grievance, this preliminary\nStudent Handbook 80\n\nprocess will be conducted with the degree of confidentiality that the aggrieved person\nwishes.\n2. Composition of Grievance Committee\nIf resolution is not accomplished by informal means, a copy of such grievance shall be sent\nto the individual or organizational unit alleged to have engaged in a discriminatory practice\nand the Director will then refer the grievance to a “Grievance Committee” to be comprised\nas follows:\n A tenured faculty member from within the college, institute or school with which the\ngrievant is associated, to be appointed by the Provost;\n The chair of the University Faculty Council Committee on Student Affairs or a\nmember of that committee whom the chair shall designate to act in the chair’s\nstead;\n The chair of the University Faculty Council Committee on Academic Grievances or a\nmember of the committee whom the chair shall designate to act in the chair’s\nstead;\n A member of the staff from outside the college or school with which the grievant is\nidentified, to be appointed by the Associate Vice President for Human Resources;\nand\n A student not from the same department as the grievant, appointed by Vice Provost\nof Student Affairs and Dean of Students/designee after consultation with the\nStudent Government Association.\nAfter the grievance is disclosed to those selected to serve on the Grievance Committee,\nany member who believes that a conflict of interest might be inferred by their participation\nin hearing the specific grievance may submit to the Provost a request for replacement\nalong with the reasons for making such request. The Provost or designee will make the\ndecision as to whether the member should be excused from or retained on the committee.\nIf the decision is to excuse the petitioner, a replacement will be appointed in the same\nmanner as the person who was excused.\nStudent Handbook 81",
  "metadata": {
    "pages": [
      81,
      82
    ],
    "word_count": 703
  }
}