{
  "chunk_id": "Student_Handbook_chunk_0056",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "140-141",
  "page_count": 2,
  "text": "graduate activity may be substituted for one of the two semesters. Some departments may\nhave additional requirements.\nBB. Safety Intervention Policy Procedures for Risk Assessment, Safety Intervention\nand Involuntary Withdrawal\n1. General. Illinois Tech is an institution that values the safety of each individual in its\ncommunity; therefore, Illinois Tech is committed to maintaining a learning environment\nwhere all persons feel safe to carry out its mission and goals. The procedures described\nbelow establish a process for safety intervention and involuntary withdrawal of students\nwho pose a credible substantial risk of harm to individuals within the University or to the\nUniversity community, or substantially impede the lawful activities, educational process,\nor proper activities or functions of other members of the University community. For\npurposes of this policy, interim safety intervention may include one or more actions\nreasonably intended to ameliorate the concerns that do not otherwise warrant involuntary\nwithdrawal hereunder; such actions may include, but are expressly not limited to, requiring\nevaluation by an appropriate healthcare professional, removal from Illinois Tech residential\nfacilities, restrictions on access to Illinois Tech property and facilities, regular meetings\nwith the Dean of Students or designee, and/or limitations on extracurricular activities\nIn furtherance of the foregoing, Illinois Tech has established a Community Support Team\n(“CST”). With respect to this policy, the primary mission of the CST is to improve\ncommunity safety through collaborative, coordinated, objective, and thoughtful\napproaches to the prevention, identification, assessment, intervention, and management\nof situations that pose, or may reasonably pose, a threat to the safety, security, and well-\nbeing of the campus community and its individual members. Therefore, CST will review and\nevaluate information regarding concerns or issues involving threats to the Illinois Tech\ncommunity by Illinois Tech students, and will act, as necessary, to protect the community\nand its members.\n2. Purpose of and Criteria for Safety Intervention and Risk Assessment. The\nprocedures for a Safety Intervention and Risk Assessment described below establish a\nfact-based investigative and analytical process for intervening with and assessing the risk\npresented by students who: (i) pose a credible substantial risk of harm to individuals within\nIllinois Tech or to the Illinois Tech community as a whole; or (ii) substantially impede the\nlawful activities, the educational process, or the proper activities or functions of other\nStudent Handbook 139\n\nmembers of the Illinois Tech community. Student conduct, judicial, academic or other\nproceedings may continue even when a student is subject to an intervention or involuntary\nwithdrawal pursuant to this policy.\n3. Interim Safety Intervention or Involuntary Withdrawal. If safety is an immediate\nconcern, Illinois Tech is permitted and has the authority to take interim action to protect\nthe well-being of all members of its community, including contacting Public Safety. By\ninterim involuntary withdrawal, Illinois Tech may remove a student from any or all Illinois\nTech premises when, in the professional judgment of the Vice Provost of Student Affairs\nand Dean of Students or designee, after considering the reasonably available information,\na credible substantial threat of immediate harm to an individual or the Illinois Tech\ncommunity is perceived to exist. Interim involuntary withdrawal is a preliminary action\ntaken to protect the health and safety of the Illinois Tech community, and is not a penalty.\nA student withdrawn on an interim basis shall be given an opportunity to appear personally\nbefore the Vice Provost of Student Affairs and Dean of Students or designee within two (2)\nbusiness days from the effective date of the interim involuntary withdrawal, in order to\ndiscuss the reliability of the information concerning the student’s behavior. Following this\nmeeting, the Vice Provost of Student Affairs and Dean of Students or designee for the\ncampus may either continue or cancel the interim involuntary withdrawal.\nIf the interim involuntary withdrawal is canceled, the procedures described in this policy\nregarding Safety Intervention and Involuntary Withdrawal may still proceed. An interim\ninvoluntary withdrawal may remain in effect until a final decision is made pursuant to the\nprocedures outlined in this policy.\n4. Threat Assessment and Safety Committee. The CST assists in evaluating whether\nstudents meet the criteria for Safety Intervention and/or Involuntary Withdrawal. The CST\nwill generally include representatives from the offices of Academic Affairs, Office of\nStudent Affairs, Disability Resources, General Counsel, Human Resources, Public Safety,\nResidence Life, Student Health and Wellness Center as well as a member of the faculty.\nOther members may be added at the discretion of the Provost or Vice Provost of Student\nAffairs and Dean of Students. The composition of the team for a particular case will depend\nupon the specific circumstances; however, the participation of an appropriate healthcare\nStudent Handbook 140",
  "metadata": {
    "pages": [
      140,
      141
    ],
    "word_count": 770
  }
}