{
  "chunk_id": "Student_Handbook_chunk_0028",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "79-80",
  "page_count": 2,
  "text": "tests must be drawn no earlier than 4 weeks prior to arrival. Immunization records must be\nsubmitted to Student Health and Wellness by or before the first day of class. A registration\nhold will be placed on the accounts, which will have the effect of prohibiting registration for\nthe subsequent semester, of all students who are non-compliant with the immunization\nrequirement. As and to the extent allowed by Illinois law, exemption from one or more of\nthe specific requirements may be granted based on documented medical or religious\nreasons. Please complete and submit the appropriate exemption form, which can be found\nonline at https://web.illinoistech.edu/shwc. Anyone with a vaccine exemption may be\nexcluded from Illinois Tech in the event of a measles, rubella, mumps, meningitis or\ndiphtheria outbreak in accordance with public health law. Please contact the Student\nHealth and Wellness Center with any questions regarding the immunization policy or\nrequirements at 312-567-7550 or via e-mail at student.health@illinoistech.edu.\nC. Concealed Carry and Prohibition Regarding Firearms and Weapons\nIllinois Tech has established a Concealed Carry and Prohibition Regarding Firearms and\nWeapons on Campus Policy pursuant to the 2013 Illinois Firearm Concealed Carry Act and\nits enabling regulations. The terms and provisions of this Policy are posted online at\nweb.illinoistech.edu/sites/web/files/departments/generalcounsel/policies/procedure_q9_weapon_prohibition.pdf, are\nincorporated by this reference.\nIn sum, as Illinois Tech is committed to providing a safe and secure environment for the\nIllinois Tech community and its guests, it has established broad restrictions on the ability to\ncarry Firearms or Weapons, concealed or otherwise, on its Campus. In short, this means\nthat no person covered by this Policy, unless authorized by law or specifically exempted by\nfederal or state law or this Policy, is authorized to possess a Weapon or Firearm while\nengaged in Illinois Tech-related business or activities or otherwise present in, on or about\nthe Property of Illinois Tech located on the Campus.\nD. Disciplinary Proceedings Due to Receipt of Digital Millennium Copyright Act Notice\nIf Illinois Tech receives from a content owner a notice of copyright infringement, i.e., a\nDMCA (Digital Millennium Copyright Act) notice, then the person to whom the Internet\nProtocol (IP) Address and/or computer system is registered and to which such notice is\nattached, shall be charged with violating Illinois Tech Procedure No. Q-3, entitled Use of\nTechnology Resources, and its provisions regarding copyright infringement and Item 14 of\nStudent Handbook 78\n\nthe Code of Conduct. (See Section R below and Article II, Section A of this Student\nHandbook, respectively.) Notwithstanding any other provisions of this Student Handbook,\na student so charged shall be subject to discipline in accordance with the following\nprocedures:\nFIRST OFFENSE: If the student has never before been referred to the Office of Community\nStandards for such violations, the student has the option of an “expedited resolution”. To\ntake advantage of this option, the student must accept responsibility for the offense,\ncomplete an on-line tutorial about copyright within 7 days of being notified of the violation\nand pay a fine of $100. Once the tutorial is completed, the matter will be closed with a\n“P2P Warning”.\nSECOND OFFENSE: If the student acknowledges that they are responsible for these\nviolations and they have been referred to the Office of Community Standards previously for\nsuch violations, the student must, within 7 days of being notified of the violations,\nschedule a meeting with the Office of Community Standards to explain their behavior.\nAdditionally, the student must pay a $200 fine and a disciplinary warning will be issued by\nthe Office of Community Standards. This warning will become part of the student's\ndisciplinary file.\nTHIRD OFFENSE: If the student has at least twice previously admitted to improper use of\nthe Illinois Tech computer network (See points 1 and 2 above), the student’s access to the\nIllinois Tech network from the offending IP Address and/or computer can be terminated for\na period of 90 days, and the student may be subject to further disciplinary action\nconsistent with the Code of Discipline.\nIf the student does not believe that they have committed the alleged violations, they may\nsubmit a written appeal within 7 days of being notified of the violation to the Office of\nCommunity Standards. Upon receipt of such appeal, an official of the Office of Community\nStandards will review the evidence to determine whether it is reasonably supported by the\nfacts and circumstances; the decision of the official shall be final.\nIf a student fails to elect one of the punishments provided for above and fails to submit an\nappeal, then their access to the Illinois Tech network from the offending IP Address and/or\ncomputer can automatically be terminated for a period of 90 days, and the student may be\nsubject to further disciplinary action in accordance and consistent with the Code of\nConduct.\nStudent Handbook 79",
  "metadata": {
    "pages": [
      79,
      80
    ],
    "word_count": 799
  }
}