{
  "chunk_id": "Student_Handbook_chunk_0022",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "67-68",
  "page_count": 2,
  "text": "b. Role of Advisor\nIn order to maintain the integrity, civility and efficiency of the process under this Code of\nConduct, any advisor and/or parents attending a meeting or hearing will be limited to\nadvising the student and will not be allowed to participate in the meeting and/or hearing;\nthis includes, but is not limited to, presenting the case, answering questions, questioning\nwitnesses or making statements during the hearing. Failure of an advisor or parent to\nadhere to these standards may result in their removal from the hearing. Illinois Tech, at its\ndiscretion, reserves the right to have a member of its Office of General Counsel present\nduring any part of the disciplinary process, especially when an attorney serves as an\nadvisor to a student.\nc. Meetings and Hearings\ni. Investigatory Meeting.\nPrior to a hearing for violation(s) of the Code of Conduct and as part of its\ninvestigation of a complaint, the Office of Student Affairs may, at its discretion, hold\nan investigatory meeting with the student who has been accused of violating one or\nmore provisions of the Code. This meeting between the accused student and the\nDean of Students or their designee is to discuss the matters in the complaint. (For\nthe avoidance of doubt, any other fact-finding and/or investigatory activities that\nmay occur with respect to any particular alleged violation are not deemed, and shall\nnot be considered, “Investigatory Meetings” as such term is used in this Section\n3(c).) If an investigatory meeting is held, it will generally occur any time within 15\ncalendar days of receipt of the complaint, but in any event, the student will be\nnotified in writing at least three calendar days before the scheduled meeting. (For\nthe avoidance of doubt, this does not mean that an investigation will be completed\nwithin 15 calendar days, only that it is Illinois Tech’s intent that the student who is\nthe subject of the complaint will be asked to attend an Investigatory meeting within\nsuch time frame.) Investigatory meetings shall not be recorded and any notes or\nmaterials of any investigatory meeting made by the Dean of Students or their\ndesignee will be the sole property of Illinois Tech and may, at Illinois Tech’s\ndiscretion, be submitted as evidence at any subsequent conduct hearing.\nIf an investigatory meeting is not held and the alleged misconduct could result in a\nsanction of suspension or expulsion, then, unless waived by the student as provided in (ii)\nbelow, the matter will proceed to a hearing before the Campus Judicial Board. If an\nStudent Handbook 66\n\ninvestigatory meeting is held, but the student fails to attend the investigatory meeting, or\none was not held and the alleged misconduct will not result in a sanction of suspension or\nexpulsion, then the matter may, at the discretion of the Dean of Students or designee, be\nheard administratively and a determination of responsibility made.\nii. Investigatory Meetings in Sexual Misconduct Matters. With respect to an alleged\nviolation of sexual misconduct, the expectation is that an investigatory meeting will\noccur unless the responding party (i) is not a then-registered Illinois Tech student,\n(ii) is incarcerated or otherwise lawfully detained, or (iii) the determination is made\nthat the substantive value of such meeting to the process is outweighed by the\nphysical or mental health or safety risks to the campus or one or more staff\nmembers or students. If an investigatory meeting is held, it will generally occur any\ntime within 15 calendar days of receipt of the complaint, but in any event, the\nstudent will be notified in writing at least three calendar days before the scheduled\nmeeting. (For the avoidance of doubt, this does not mean that an investigation will\nbe completed within 15 calendar days, only that it is Illinois Tech’s intent that the\nstudent who is the subject of the complaint will be asked to attend an Investigatory\nmeeting within such time frame.) With respect to any investigatory meetings and\nhearings related to alleged sexual misconduct violations, but only with respect to\nsuch violations, the Dean of Students will provide or will have provided to both the\nreporting party and responding party as well as appropriate Illinois Tech officials\ninvolved with such matters timely and equal access to any information that will be\nused during such meetings and hearings.\nInvestigations of alleged violations of sexual misconduct will be conducted by individuals\nwho have received training, as required by law, on issues related to dating violence,\ndomestic violence, sexual assault and stalking and how to conduct an investigation that\nprotects the safety of victims and promotes accountability and other such matters.\niii. Types of Hearings\nThere are two types of disciplinary hearings: Administrative Hearings and Campus Judicial\nBoard Hearings. At the discretion of the Dean of Students, any hearing under this Code of\nConduct may be held virtually so long as all parties are able to see, hear and speak to one\nanother.\nStudent Handbook 67",
  "metadata": {
    "pages": [
      67,
      68
    ],
    "word_count": 825
  }
}