{
  "chunk_id": "Student_Handbook_chunk_0023",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "69-70",
  "page_count": 2,
  "text": "Administrative Hearings: A one-on-one meeting between the student and hearing\nadministrator designated by the Dean of Students to discuss the alleged violation(s). The\nstudent may present witnesses and/or witness statement(s) on their behalf. Witnesses are\ndefined as individuals who were at the incident in question and/or have information\npertinent to the incident in question. The administrator may, in their sole discretion,\ndisallow witnesses whose testimony would be redundant or not germane to the charges or\ndo not meet the requirements set forth in the immediately preceding sentence. The\nadministrator determines responsibility and imposes any applicable\nsanction(s). Administrative hearings are typically used for cases that are deemed less\nserious in nature or when health and safety concerns make use of an administrative\nhearing prudent.\nCampus Judicial Board Hearings: The accused student and reporting party (if applicable)\nappear before the Campus Judicial Board to discuss the alleged violations. The Campus\nJudicial Board determines responsibility and imposes any applicable sanction(s). Students\nappearing before the Campus Judicial Board will be notified of a pre-hearing meeting to\nreview the allegations and the process with the Dean of Students or their designee; this\npre-hearing meeting is separate and distinct from an investigatory meeting and conduct\nhearing. The student will be notified of the date of the pre-hearing meeting at least three\ncalendar days in advance of their scheduled hearing date, and their hearing before the\nCampus Judicial Board will proceed regardless of whether they attend the pre-hearing\nmeeting. Campus Judicial Board hearings will be used for cases where the alleged\nviolation(s) could result in sanctions of suspension or expulsion or the allegations are\ndeemed complex in nature. The Dean of Students or their designee may at their sole\ndiscretion determine which cases are deemed complex in nature. Students who are\nreferred to the Campus Judicial Board may waive their right to a board hearing and select\nan administrative hearing. Prior to the student waiving their right to appear before the\nBoard, the Dean of Students or their designee must inform the student if the alleged\nmisconduct could result in a sanction of suspension or expulsion. If such sanctions could\nresult and the student wants the matter to be heard administratively by the Dean of\nStudents or their designee, the student must sign a statement waiving their right to a\nhearing before the Campus Judicial Board.\nHearings are generally expected to commence at any time within 60 calendar days after the\ninvestigatory meeting or 45 calendar days after receipt of the complaint if no investigatory\nhearing is held. However, additional time may well be needed to investigate thoroughly and\nfairly a complaint, especially, by way of example, when the complaint involves multiple\nStudent Handbook 68\n\nparties, requires a number of witnesses to be interviewed, is reported during or shortly\nbefore a break period and/or involves parties or agencies that are not part of the Illinois\nTech community. With respect to alleged violations of sexual misconduct, hearings will be\nconducted by individuals who have received training, as required by law, on issues related\nto dating violence, domestic violence, sexual assault and stalking and how to conduct an\ninvestigation that protects the safety of victims and promotes accountability and other\nsuch matters.\nThe Campus Judicial Board (i) may, as appropriate, be advised by a designee of the Dean of\nStudents, (ii) aim to conduct itself in a manner consistent with applicable policies, and (iii)\nwill be composed of members who do not have a conflict of interest or bias for or against\nthe accuser or the accused. A Campus Judicial Board will generally include two faculty\nmembers, at least one of whom is not in the student’s major department, two students,\none Illinois Tech staff member, and either one Illinois Tech staff member from the Office of\nStudent Affairs or a designee appointed by the Vice Provost for Student Affairs, who will\nserve as chairperson of the Board and preside over the hearing but do so as a non-voting\nmember, though they will be present during deliberations. Parties to the proceeding will be\nalerted to the identity of Campus Judicial Board membership at least three calendar days\nin advance of a hearing, and they must notify, in writing, the Dean of Students or their\ndesignee of any claimed conflict of interest or bias that a member may have against them\nwithin two calendar days thereafter, which notice must specifically detail the nature of the\nalleged conflict or bias. Failure to comply with the foregoing notice provision shall\nconstitute a waiver of one’s right to raise subsequently such an objection. After review of\nany such notification, it is the decision of the Dean of Students or their designee whether to\nremove any member of a Campus Judicial Board. All members of a Campus Judicial Board\nwill be appointed by the Dean of Students or their designee. A member of a Campus\nJudicial Board as well as participants before a Campus Judicial Board may participate by\nteleconference, Microsoft Teams, Zoom or such other electronic or virtual means that\npermits them to see and/or to hear the proceedings and participate in them.\nA student will have the right to submit written documentation for the Campus Judicial\nBoard to review, but in order to have such documentation reviewed, it must be submitted\nto the Dean of Students or their designee at least two calendar days prior to the hearing. At\nthe hearing, a student will have the right to make an oral statement both at the start and the\nconclusion of the hearing. Further, as a general rule, a student will have the right (i) to\npresent and to question any witnesses of their choosing that have information relevant to\nthe charges against them, provided that the chair may, in their sole discretion, disallow\nStudent Handbook 69",
  "metadata": {
    "pages": [
      69,
      70
    ],
    "word_count": 964
  }
}