{
  "chunk_id": "Student_Handbook_chunk_0052",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "130-132",
  "page_count": 3,
  "text": "All students are expected to attend classes regularly. Excessive absences may be grounds\nfor a failing grade. Non-attendance does not constitute an official withdrawal. When illness\nor emergency requires a student to miss an exam and/or more than two days of class, the\nstudent must notify the course instructor. It is also recommended that the student contact\nthe office of the Dean of Students (dos@illinoistech.edu) to request an excused absence. It\nwill be necessary to provide written documentation of the reason for the absence(s). The\nOffice of Student Affairs manages the process for requesting and documenting excused\nabsences but the decision to excuse an absence is generally made by the Professor.\nFaculty members determine their own policies for attendance and make-up work.\nJ. Complaints (Academic)\nStudents should refer concerns about academic matters to the instructor of the course,\nthen to the chair of the department or director of the institute in which the course is\noffered, then to the academic dean, the Associate Vice Provost for Academic Affairs, the\nAssistant Dean at Chicago-Kent College of Law or the Dean at Stuart School of Business.\nThose students who believe they received unfair treatment, as the result of discrimination\nshould follow procedures as outlined in Article IV, Section E of this Student Handbook.\nK. Continued Eligibility for Financial Assistance\nAll students receiving federal and/or state financial aid funds must demonstrate\nreasonable academic progress toward graduation from Illinois Tech. As summarized\nabove, reasonable academic progress includes both a satisfactory cumulative and major\ngrade point average and sufficient credit hours earned each semester toward the\ncompletion of a degree program. Illinois Tech has established a Reasonable Academic\nProgress Policy in compliance with federal and state regulations. Failure to comply with\nIllinois Tech’s Reasonable Academic Progress Policy will lead to the student losing\neligibility for financial assistance.\nStudent Handbook 129\n\nL. Courses at Other Colleges or Universities\nRefer to Residence Requirements set forth in Section AA of this Article V.\nM. Course Numbering – Academic Degree / Certificate Programs\nAcademic Degree Programs\n000 – 099 No Credit\n100 – 299 First/Second Year Undergraduate Level Courses\n300 – 399 Third Year Undergraduate Level Courses\n400 – 499 Advanced Undergraduate/Introductory Graduate Level Courses\n500 – 699 Graduate Level Courses\n700 – 799 Intensive Graduate Level Courses\nNon-Degree / Continuing Education (CEU) Programs*\n001 – 999 Intensive English Program (IEP)\n300 – 999 Information Technology Training Programs (IT)\n300 – 999 Industrial Technology Training Programs (INT)\n001 – 999 Professional Learning Programs (PL)\n001 – 999 Short Courses (SC)\n001 – 999 Short Course Online (SCO)\n*All CEU courses are graded on a pass/fail basis only. Letter grades do not apply\nN. Dean’s List, Undergraduate\nThe names of all undergraduate students who have completed at least 12 graded hours\nand who have a semester grade point average of 3.50 or better appear on the Dean’s List.\nStudent Handbook 130\n\nO. Dropping or Adding Courses\nChanges in a student’s schedule of classes, including a transfer from one course section to\nanother, must be made no later than the relevant semester’s specified Add/Drop deadline.\nPlease consult the Academic Calendar for exact deadlines. A course dropped during the\nfirst two weeks of the semester will not appear on a student’s transcript and tuition will be\nrefunded. Failure to drop a course formally will result in a grade of ‘NA’ (apparent\nwithdrawal due to non-attendance) for that course. A student attending courses without\nbeing formally registered will receive no credit for the course. Students may withdraw from\na course with the grade of ‘W’ (withdraw) until the specified Withdrawal deadline. Please\nconsult the Academic Calendar for exact deadlines.\nP. Final Exams\n1. Final examinations are generally expected to take place during the final exam week\nimmediately following the last week of regular classes. The time and location of the exam\nmay differ from the regularly scheduled room for class meetings. Students should view the\nfinal exam schedule for details at\nweb.iit.edu/registrar/important-dates/final-exam-schedule.\nAll final grades must be submitted online by the primary instructor assigned to the\ncourse. The grading window remains open from the start of final exams until noon on the\nWednesday following finals week. Only students officially registered in the course are\npermitted to attend class, participate, or submit course work for evaluation. All students\nmust abide by the add, drop and withdrawal dates specified in the academic calendar.\n2. Final Exam Conflicts\n Online Exam Conflict: Students who are taking online courses may elect to take the\nfinal exam on campus with the on-campus section. Students who have exam\nconflicts between the online exam and an on-campus exam must contact Charles\nScott, student service manager for the Office of Digital Learning, at\nscott@illinoistech.edu to arrange to take the online final exam with a proctor at\nanother time.\n On-campus Exam Conflict: Students who have an exam conflict between two or\nmore on-campus sections are to contact the instructors of the courses to arrange to\nStudent Handbook 131",
  "metadata": {
    "pages": [
      130,
      131,
      132
    ],
    "word_count": 827
  }
}