{
  "chunk_id": "Student_Handbook_chunk_0054",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "135-136",
  "page_count": 2,
  "text": "Graduate Degree-seeking students who intend to leave Illinois Tech for one semester or\nmore must complete the online leave of absence form in the Illinois Tech portal\n(portal.iit.edu) by selecting the Academics tab, followed by the Graduate Academic Affairs\nchannel. A leave of absence will not be granted for more than one year, at which time, a\nrequest for an extension of leave may be submitted by filing a Form 701 Graduate Student\nPetition. A leave of absence will not extend the time limit required for the completion of a\ndegree. A leave will not be approved after the sixth week of the current semester. A student\nwho has not renewed their leave of absence must petition for reinstatement to the Office of\nAcademic Affairs. Degree-seeking students who do not plan to return to the program\nshould submit a Withdrawal From the University Request, also located as noted above.\nNon-degree students are not required to file a Leave of Absence Form, but will require\nreinstatement by petition on Form G701 after a lapse in\nregistration. Students should consult the procedures for filing a petition under the section\nRight of Appeal by Petition in the Graduate Bulletin.\nNote: International students must comply with additional regulations when requesting a\nleave of absence. See iit.edu/global-services for additional details. International students\nmust also receive approval from the Office of Global Services. If an international student\nwishes not to enroll in a given term, the leave of absence must be approved by the Office of\nGlobal Services, by the registration deadline of that term.\nW. Medical Leave of Absence\n1. The Process. A student should consider a medical leave of absence if their health\nproblems are such that continuing in courses becomes unmanageable. Where a\nmental/physical health condition causes a student (i) to become or reasonably appears to\nbe a threat to others; (ii) to significantly disrupt the Illinois Tech community and/or its safe\nand efficient operation; or (iii) to be unable to comply with the policies generally applicable\nto students, Illinois Tech may recommend and encourage the student to avail themselves\nof the opportunity to take a voluntary medical leave. Illinois Tech may seek an involuntary\nwithdrawal of or other safety intervention measures for a student in accordance with the\npolicy set forth in Section BB below.\nPrior to the grant of a voluntary medical leave of absence, the student must provide a letter\nfrom a health professional, physician or therapist recommending such leave. The student\nStudent Handbook 134\n\nwill be asked to sign a release so that the appropriate Illinois Tech representative may\nspeak with the health professional regarding the student’s condition. Requests for and\napproval of medical leaves of absence must be issued by the last day of classes in the\nsemester. Once classes have ended and exams have begun, a medical leave will not be\ngranted.\nAny student considering a medical leave should speak with the Dean of Students or the\nrelevant Vice Provost as soon as possible to discuss options and initiate the process. If the\nleave is approved, the student will receive the grade of W for each of their classes during\nthe semester. While on leave, the student is expected to use the time for treatment and\nrecovery so that they will be mentally and physically healthy upon their return. A medical\nleave normally will be granted for two semesters (not including summer); however, a\nstudent may request from the Dean of their academic department approval for an\nextended absence. Any need for reinstatement and/or readmission will be handled in\naccordance with the applicable policies of the Office of Undergraduate or Graduate\nAcademic Affairs as appropriate.\nIt is important for a student contemplating a medical leave to inquire about matters such\nas health insurance, housing and tuition contract obligations, financial aid and immigration\n(visa) requirements prior to finalizing their leave. The Office of Student Affairs will assist in\nfacilitating such communication.\n2. Return from Medical Leave. To return from a voluntary medical leave, a student must\nsubmit the requisite documentation to either the Office Academic Affairs prior to the\ndeadline specified on the Illinois Tech academic calendar. The required documentation\nincludes: a statement from the student describing the reasons they believe they should\nreturn to school; a release to allow the Student Health and Wellness Center to obtain\ninformation from the student’s treatment provider; and an assessment by the treatment\nprovider regarding the student’s readiness to return to classes.\nThe Office of Academic Affairs and the Vice Provost of Student Affairs and Dean of\nStudents will meet with the appropriate academic personnel and a decision regarding the\nstudent’s return will be made. The Associate Vice Provost of the Student Health and\nWellness Center or their designee may provide consultation. Based on the treatment\nStudent Handbook 135",
  "metadata": {
    "pages": [
      135,
      136
    ],
    "word_count": 798
  }
}