{
  "chunk_id": "Student_Handbook_chunk_0053",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "133-134",
  "page_count": 2,
  "text": "take one of the final exams at another time. If the exam conflict is not resolved, then\nstudents may contact the Registrar’s Office at registrar@illinoistech.edu where a\nstaff member will assist you and your instructors in resolving the exam conflict.\n Three or More Exams on Same Day: Students who have three or more exams on the\nsame day may request relief by contacting the instructors of the courses to request\none of the exams be rescheduled to a different day. If the issue is not resolved, then\nstudents may contact the Registrar’s Office at registrar@illinoistech.edu where a\nstaff member will assist you and your instructors in making special arrangements\nfor you to take one of the exams on a different day.\nQ. Financial Obligations\nTo the fullest extent allowed by law, any student who is delinquent in the payment of tuition\nor other fees, or against whom Illinois Tech holds a record of indebtedness, is not given a\ndiploma, a certificate of scholastic standing, or a copy of their transcript until such\nindebtedness has been fully paid. While indebted to Illinois Tech, students are not allowed\nto register or attend classes for an ensuing semester. Illinois Tech may affect the\nwithdrawal of any student who, through oversight, has been allowed to register contrary to\nthis regulation. Student loans that are due during a semester or summer session and are\nnot paid or renewed by the end of the term are also subject to this regulation.\nR. Grade Appeal Process, Undergraduate\nThe assignment of letter grades (A, B, C, D, and E) is at the discretion of the course\ninstructor, and except for unusual circumstances, the assigned course grade is\nfinal. Undergraduate students who want to appeal a letter grade assigned in a course\nshould first confer with the course instructor. If the student and instructor cannot come to\nan agreement, the student should contact the chair of the instructor’s department. If\nagreement still is not reached, the student should contact the dean of the instructor’s\ncollege.\nS. Graduate Course Enrollment, Undergraduate\nAll undergraduate students who wish to enroll in a graduate 500-level course must obtain\napproval from their faculty adviser. All undergraduate students who enroll in graduate\ncourses are governed by the graduate grading system for those courses.\nStudent Handbook 132\n\nT. Graduation with Honors\nA student must complete a minimum of 60 graded credit hours at the university in order to\nreceive the award of summa cum laude, magna cum laude, or cum laude. A student who\nhas a GPA of 3.90 and higher will graduate with summa cum laude honors; a student who\nhas a GPA between 3.80-3.899 will graduate with magna cum laude honors; and a student\nwho has a GPA between 3.50-3.799 will graduate with cum laude honors.\nU. Incomplete Grades\nThe “I” grade is a temporary grade requested by the student, or the instructor, through the\nincomplete grade request process, prior to the week of finals. An \"I\" grade is automatically\nposted when the Office of the Registrar receives the approved request. A written agreement\nbetween the student and instructor must detail the remaining requirements for successful\ncompletion of the course. A grade of \"I\" will be assigned only in case of illness or\nunforeseeable circumstances that prevent the student from completing the course\nrequirements by the end of the term. Grades of \"I\" will automatically lapse to \"E\" on the\npublished deadline of the subsequent term.\nV. Leave of Absence From Illinois Tech\nUndergraduate degree-seeking students who wish to withdraw from Illinois Tech with the\nintention of returning to complete their degree program may apply for a Leave of Absence.\nThis request is made through the Undergraduate Academic Affairs channel in the Illinois\nTech portal (portal.iit.edu). All requests for a leave of absence will be reviewed by the Office\nof Academic Affairs and requests must be submitted by the end of the 12th week of the\nsemester to take effect that semester. Any request submitted after the 12th week will take\neffect the following semester; however, exceptions can be made due to extenuating\ncircumstances. In general, a leave of absence cannot exceed one academic year, but a\nleave can, at the discretion of Illinois Tech, be extended if appropriate documentation of\nextenuating circumstances is submitted.\nStudents requesting a leave of absence due to medical reasons must be made and will be\nevaluated in accordance with Section W of this Article\nStudent Handbook 133",
  "metadata": {
    "pages": [
      133,
      134
    ],
    "word_count": 740
  }
}