{
  "chunk_id": "Student_Handbook_chunk_0026",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "75-76",
  "page_count": 2,
  "text": "Pending a hearing, the Dean of Students may issue a temporary suspension when the facts\nand circumstances of the allegations against them are sufficient to reasonably assume,\ngiven the academic and/or campus environment, immediate separation is required to avoid\nor to minimize physical, mental, or emotional pain to one or more other students, to\nmaintain the integrity of the educational environment; an/or to maintain the safety of the\ncampus and its community. Allegations that are sufficiently alarming include, but are not\nlimited to, violations of the Policy on Drugs and Alcohol, Policy and Procedures on Sexual\nHarassment, incidents involving felony-level criminal charges, sexual misconduct and\nmatters that poses a risk to the safety of other students, Illinois Tech property and/or the\nefficient administration of Illinois Tech. Imposition of temporary suspension will be based\nupon a review of the particular facts and circumstances and reasonable efforts, given the\ncircumstances, will be made to meet with a student prior to such imposition so that they\nmay present their case as to why such action should not be taken. A student may appeal\nthe imposition of temporary suspension in writing to the Provost within three calendar days\nof its imposition. The student will remain on temporary suspension during the appeal, and\nthe Provost’s decision regarding the matter will be final. If an appeal is not filed by the\nstudent within the requisite time period, the right to appeal will be deemed waived, and the\ndecision to impose temporary suspension will stand.\nExpulsion. Expulsion is the complete severance of association with Illinois Tech.\nIn addition to the foregoing, additional sanctions, as set forth in Article VI, Section E,\nmay be imposed on student organizations.\n2. Conditions/Restrictions.\nAny of the sanctions set forth in Section C(1), including any temporary sanction, may carry\nadditional conditions and/or restrictions, including, but not limited to, a referral for\ncounseling of specified type and duration as appropriate; a requirement to refrain from\ncontact or communication -- including in person, via email, telephone, text messaging,\nsocial networking, third party, or any other method of communication - with one or more\nindividuals; denial of use of Illinois Tech facilities; denial of parking privileges; being barred\nfrom such activities as representing Illinois Tech on any athletic team or participating or\nholding office in any student organization or committee; or being barred from receiving\nemployment or scholarship aid from Illinois Tech funds.\nStudent Handbook 74\n\n3. Review of Sanction of Suspension or Expulsion\nIn any matter where the Dean of Students or the Campus Judicial Board seeks to impose a\nsanction of suspension or expulsion, the imposition of the sanction will automatically be\nstayed and the matter referred to the Provost for review. With respect to the proposed\nsanction, the Provost, within 21 calendar days of receipt thereof, may make any of the\ndeterminations set forth under Section D(3) below. Once the Provost’s review has been\ncompleted, the Dean of Students’ or the Campus Judicial Board’s proposed sanction, as it\nmay have been modified by the Provost, will become effective. Notwithstanding any other\nprovision of this Student Handbook, no matter referred to the Provost shall be subject to\nany further appeals on the basis that the sanction imposed was inappropriate to the\noffense.\nD. Appeal Procedures\nAn appeal of a sanction for violation of the Code of Conduct must be submitted in writing\nto the Office of Student Affairs (dos@illinoistech.edu) within five calendar days of\nnotification of the decision. Supporting information must be submitted with the appeal. An\nappeal or submission made after this deadline will not be considered, and the student will\nbe deemed to have waived his right thereto. Issues not raised in a timely submitted appeal\nwill be deemed to have been waived. In both cases, this means that any decision(s) and\nsanction(s), as the case may be, shall be final.\n1. Levels of Appeal\nDecisions rendered by the Greek Council or Residence Life Staff, or their respective\ndesignee, may be appealed to the Office of Student Affairs, and the decision of the Dean of\nStudents or its designee with respect to such matters shall be final. Disciplinary sanctions\nimposed on students for misconduct by the Dean of Students or their designee or by the\nCampus Judicial Board may be appealed to the Provost, whose decision shall be final.\n2. Basis for Appeal\nAn appeal may be made only for one of the following reasons:\n The procedures outlined above were not substantially followed and such\noccurrence reasonably could be deemed to have impacted the outcome;\nStudent Handbook 75",
  "metadata": {
    "pages": [
      75,
      76
    ],
    "word_count": 758
  }
}