{
  "chunk_id": "Student_Handbook_chunk_0060",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "149-150",
  "page_count": 2,
  "text": "VI. MIES CAMPUS STUDENT ORGANIZATIONS: POLICIES AND REGULATIONS\nMembership participation in student organizations can be a meaningful part of a student’s\neducational experience. Valuable lessons in leadership, planning and organization are\nsome of the benefits of involvement in organizations on campus. Membership in student\norganizations is open to all regularly enrolled students of Illinois Tech and VanderCook\nCollege of Music.\nA. Organizational Recognition\nStudent organizations must apply for and maintain university recognition with the Office of\nStudent Life. Staff members will work with individuals to form a new student organization\nand/or register a current one. Organizations in the formation stage will be to meet with a\nstaff member in the Office of Student Life and are required to meet with the Office of\nStudent Life staff prior to arranging a meeting with SGA (sga.illinoistech.edu). After the\npotential new organization is approved during a Student Government Association Senate\nmeeting, the new organization will need to attend a student organization training with a\nStudent Life staff member to complete the formal recognition. The Office of Student Life\nreserves the right, in its sole discretion, to withhold recognition from those prospective\norganizations whose purpose is deemed to be in conflict with the institutional mission or\noperation of Illinois Tech.\nRecognized organizations can maintain their recognition by registering the organization\nwith the Office of Student Life at the beginning of the academic year. Registration requires\nan organization to accomplish to the satisfaction of the Office of Student Life each of the\ntasks listed below.\nComplete the online registration through the Office of Student Life\n Submit a list of all officers and the faculty/staff advisor(s) for the organization on\nsuitable. All organizations must have a faculty or staff advisor in order to achieve or\nmaintain recognition.\n Attend student organization training workshops each semester; topics include\nprogramming, finance, event management and more. Presidents and treasurers\nmust attend.\nStudent Handbook 148\n\n Remain in good standing with the Office of Student Life; organization status is\nevaluated by professional staff in areas of finance, behavior, academics and judicial\naffairs.\n Organization must maintain a minimum of 7 members to be an active organization.\nContact the Office of Student Life via email (welcomedesk@illinoistech.edu) with any\nquestions regarding the registration process.\nRecognized organizations are eligible for support and services, such as reservation of\nspace for meetings and events, send packages to MTCC, account management, advising\nsupport from the Office of Student Life, announcements in OCL newsletter, slides on the\nTV screens around campus (UPshow), and the ability to apply for funding from the Student\nActivities Fund.\nB. Officers\nOfficers (appointed and elected) and executive board members of organizations must be\nregularly enrolled students in good academic and judicial standing. General membership\nmust generally be open to all full-time and part-time students.\nC. Student Activities Fund\nThe Student Activities Fund (SAF) is derived from the student activity fee paid by each\nstudent taking classes on the Mies, Rice, and Moffett campuses. The SAF exists to support\nthe operations and programming efforts of student organizations. Finance Board, an\nappointed committee of SGA, is charged with allocating and distributing money in the SAF\namong student organizations. OSL oversees final decisions on funding choice made by\nFinance Board. Any recognized and registered organization may apply to Finance Board for\nfinancial support. Any programs, property, equipment, and supplies purchased through the\nSAF must be accessible and available to all students. All materials purchased by the SAF\nare property of the university. Throughout the year, Finance Board conducts workshops to\nhelp organizations understand the policies and procedures for receiving funding from the\nSAF. Recognized organizations in good standing may apply for and receive funding (twice a\nyear) according to Finance Board Guidelines, which can be found under the Finance Board\ntab at sga.illinoistech.edu.\nStudent Handbook 149",
  "metadata": {
    "pages": [
      149,
      150
    ],
    "word_count": 632
  }
}