{
  "chunk_id": "Student_Handbook_chunk_0041",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "106-107",
  "page_count": 2,
  "text": "investigate the same and to respond in a way that limits the effects of the sexual\nmisconduct and prevents its reoccurrence, even if the individual who experienced the\nsexual misconduct has elected as is their right, not to pursue it or has declined to\ncooperate.\nAccordingly, subject to any additional expressed obligations or limitations set forth\nelsewhere in this Student Handbook, including Appendix A, Illinois Tech reserves the right\nto share information during or after an investigation with people who reasonably need to\nknow it in order to promote campus safety; comply with law; provide for a prompt, fair and\nimpartial resolution; and/or institute accommodations or protective measure. Such\nindividuals may include Illinois Tech officials, faculty members, staff, investigators,\nCampus Judicial Board members, witnesses, the individual who experienced the sexual\nmisconduct and their advisor, and the person accused of committing such misconduct\nand their advisor. If an individual who experienced sexual misconduct is unsure of\nsomeone's duties and abilities to maintain his or her privacy, he or she should ask the\nindividual before speaking to them. As detailed further in Subsection 4(b) below, certain,\nlimited staff members in certain Illinois Tech departments are generally obligated by law to\nmaintain confidentiality, including certain licensed health professionals acting in their\nprofessional capacity; pastoral counselors, meaning individuals who are associated with a\nreligious order or denomination, recognized by that order or denomination as people who\nprovide confidential counseling and acting within the scope of that recognition; designated\nconfidential advisors; and staff of local rape and domestic violence crisis centers.\nb. Persons with the Legal Ability to Maintain Confidentiality\nIllinois Tech's Student Health and Wellness Center has licensed health professionals who\ncan meet with victims on a professional basis and discuss matters in confidence. Staff\nmembers of the Student Health and Wellness Center, whose official responsibilities\ninclude providing mental health counseling to members of the student body, when acting\nwithin the scope of their license or certification, are generally obligated by law to maintain\nconfidentiality, and these individuals when so acting are not required by law to report\ncriminal offenses, including sexual misconduct, about which they are informed.\nIn addition, Illinois law has established the recognized role of \"Confidential Advisor\", which\nis as an individual retained by a higher education institution that has certain mandated\ntraining and has the duty and ability to provide emergency and ongoing support to students\nStudent Handbook 105\n\nwho have experienced sexual misconduct. Illinois Tech has elected to contract for\nConfidential Advisor services. The provider of such services is:\n Resilience, located 180 N Michigan Avenue, Suite 600, Chicago, Illinois 60601. The\nphone number for students needing to access Resilience's 24-hour Confidential\nAdvisor services is 773-275.8340.\nUnder Illinois law, communications between a Confidential Advisor and an individual who\nhas experienced sexual misconduct and all records related thereto are to remain\nconfidential, unless (i) the survivor consents to a disclosure in writing, (ii) disclosure is\nmandated by law or court order, or (iii) failure to disclose such communication would result\nin a clear, imminent risk of serious physical injury to or death of the individual or another. In\naddition, a Confidential Advisor shall periodically report to Illinois Tech's Title IX\nCoordinator the number and type of incidents of sexual misconduct reported exclusively to\nthe Confidential Advisor so as to permit Illinois Tech to fulfill its crime reporting obligations\nunder state and federal law.\nIn the course of working with an individual who has experienced sexual misconduct, a\nConfidential Advisor will (i) inform him or her of the choice of possible next steps regarding\nreporting options and possible outcomes, whether through Illinois Tech's policies and\nprocedures or local law enforcement; (ii) notify him or her of the resources and services\navailable to him or her, both on and off campus; (iii) discuss with him or her orders of\nprotection and no contact orders; (iv) provide confidential services to and have privileged,\nconfidential communications with him or her in accordance with Section 8-804 of the\nIllinois Code of Civil Procedure; and (v) at his or her request, liaise with and assist in\ncontacting and reporting to Illinois tech officials, local law enforcement or community-\nbased sexual assault crisis centers as well as to secure accommodations (as defined\nbelow) from Illinois Tech.\n5. SUPPORT OPTIONS\nIn an effort to advance the cause of deterrence and reduce the possibility of a student\nexperiencing sexual misconduct, information concerning sexual misconduct, sexual\nmisconduct prevention options and warning signs, and safe and positive options for\nbystander intervention is available at web.iit.edu/student-affairs/vawa-save-acts. In\nStudent Handbook 106",
  "metadata": {
    "pages": [
      106,
      107
    ],
    "word_count": 758
  }
}