{
  "chunk_id": "Student_Handbook_chunk_0042",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "108-109",
  "page_count": 2,
  "text": "addition, a description of (i) Illinois Tech's ongoing sexual misconduct prevention and\nawareness campaigns for members of the Illinois Tech community, (ii) existing counseling,\nhealth, mental health, victim advocacy, legal assistance and other services available for\nvictims of sexual misconduct both on campus and in the area, and (iii) options for, and\navailable assistance in, changing academic, living, dining, transportation and working\nsituations (collectively, \"accommodations\") will be made available. Illinois Tech will\nprovide accommodations if they are so requested by the victim and if they are reasonably\navailable under the particular circumstances. Requests for accommodations should be\nmade to the Dean of Students (312-567-3080; MTCC, Room 209). The option to seek\naccommodations is available regardless of whether the victim has elected to report the\ncrime to campus police or local law enforcement. (A person who experiences sexual\nmisconduct that qualifies as Title IX Sex Discrimination including Sex-Based Harassment is\nentitled to Support Measures as defined and provided for in Appendix A.)\nUpon learning that a student has experienced sexual misconduct, whether the offense\noccurred on or off campus, the student will be provided (and in the case of electronic\nreports, the reported will be responded to with) the following information in writing: (i) the\npossible sanctions or protective measures that could be imposed upon an individual\nfound, after a disciplinary proceeding pursuant to the Code of Conduct or the Title IX Sex\nDiscrimination including Sex-Based Harassment Process, to have committed such an\noffense after a disciplinary proceeding; (ii) procedures an individual who has experienced\nsexual misconduct should consider, including, but not limited to, information about the\nimportance of preserving evidence, to whom the alleged offense should be reported, and\noptions regarding law enforcement and campus public safety authorities, including\nnotifying the same, how Illinois Tech staff can assist with making such notification and the\nindividual's right to decline to notify such authorities; (iii) the ability of an individual who\nhas experienced sexual misconduct seek to secure an order of protection or no contact\norders under Illinois law; (iv) detailed information concerning Illinois Tech's disciplinary\nprocess for cases of sexual misconduct, including the victim's rights and options\nthereunder; (v) information about how and to what extent Illinois Tech can and will protect\nthe confidentiality of victims; (vi) available counseling, physical and mental health\ntreatment options, victim advocacy, legal assistance, visa and immigration assistance,\nstudent financial aid and other services available for victims of sexual misconduct both on\ncampus and in the area; (vii) options for, and available assistance in, changing academic,\nliving, dining transportation and working situations (collectively, known as\n\"accommodations\") or Supportive Measures pursuant to the Title IX Sex Discrimination\nincluding Sex-Based Harassment Process; and (viii) contact information for Illinois Tech's\nStudent Handbook 107\n\nTitle IX Coordinator, Confidential Advisors, Department of Public Safety as well as local law\nenforcement and community-based sexual assault crisis centers.\n6. DEFINITIONS APPLICABLE TO SEXUAL MISCONDUCT UNDER THE CODE OF\nCONDUCT (DEFINITIONS APPLICABLE TO THE TITLE IX SEXUAL HARASSMENT\nPROCESS ARE SET FORTH IN ARTILCE III).\na. Consent\nConsent represents the cornerstone of respectful and healthy intimate relationships.\nIllinois Tech strongly encourages its community members to communicate – openly,\nhonestly and clearly – about their actions, wishes, and intentions when it comes to sexual\nbehavior, and to do so before engaging in intimate conduct. It is always the requirement of\nthe individual initiating sexual contact (or undertaking a new type of sexual activity) to\nensure that consent is present before acting and is present during sexual activity.\nWhen determining whether consent was present, Illinois Tech will consider whether a\nreasonable person in the same circumstances should have known whether the other party\ncould or could not consent to the sexual activity. Thus, to have sex with someone who you\nknow to be, or should have known to be incapable of making a rational, reasonable\ndecision about a sexual situation is a violation of this policy. Consent is not present when\nan individual does not have the capacity to give consent, voluntarily or involuntarily, due to\nage (younger than 17 in Illinois), physical condition, or disability that impairs the\nindividual's ability to give consent. Reasons why one could lack capacity to give consent\ndue to a physical condition include, but are not limited to, incapacitation due to the\nconsumption of drugs or alcohol (voluntarily or involuntarily) or being in a state of\nunconsciousness, sleep, or other state in which the person is unaware that sexual activity\nis occurring. To be clear, a person may appear to be giving consent but may not have the\ncapacity to do so; in which case, the apparent consent is not effective. If there is any doubt\nas to another person's capacity to give consent, one should assume that the other person\ndoes not have the capacity to give consent. Being intoxicated or impaired by drugs or\nalcohol does not excuse one from the responsibility to obtain consent.\nWith the foregoing, consent means the existence of clearly understandable words or\nactions that manifest a knowing, active, voluntary, and present and ongoing agreement to\nStudent Handbook 108",
  "metadata": {
    "pages": [
      108,
      109
    ],
    "word_count": 845
  }
}