{
  "chunk_id": "Student_Handbook_chunk_0069",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "168-168",
  "page_count": 1,
  "text": "A person who is alleged to be the victim of conduct that could constitute sex discrimination\nincluding sex-based harassment.\nII. CONFIDENTIAL ADVISERS\nConfidential Advisors are the only individuals who generally have an obligation to\nmaintain privacy and confidentiality and not to report information that they may learn\nregarding sex discrimination/sex-based harassment. In addition, Illinois law has\nestablished the recognized role of Confidential Advisor, which is an individual\nretained by a higher education institution that has certain mandated training and has\nthe duty and ability to provide emergency and ongoing support to students who have\nexperienced sex discrimination/sex-based harassment. Illinois Tech has elected to\ncontract for Confidential Advisor services. Illinois Tech’s Confidential Advisers are:\na. Resilience\nb. 180 North Michigan Avenue, Ste 600\nc. (773) 275-8340 (24 hours)\nd. Illinois Tech’s Student Health and Wellness Center *\ne. Email: studenthealth@illinoistech.edu\nf. (312)567-7550\n*Illinois Tech's Student Health and Wellness Center has licensed health professionals who can\nmeet with victims on a professional basis and discuss matters in confidence. Staff members of\nthe Student Health and Wellness Center, whose official responsibilities include providing mental\nhealth counseling to members of the student body, when acting within the scope of their license\nor certification, are generally obligated by law to maintain confidentiality, and these individuals\nwhen so acting are not required by law to report information they come to learn regarding\nalleged criminal offenses, including some sex discrimination/sex-based harassment.\n3. CONSENT\nConsent represents the cornerstone of respectful and healthy intimate relationships.\nIllinois Tech strongly encourages its community members to communicate – openly,\nhonestly, and clearly – about their actions, wishes, and intentions when it comes to\nsexual behavior, and to do so before engaging in sexual behavior or other forms of\nintimate conduct. It is always the requirement of the individual initiating intimate\nconduct (or undertaking a new type of sexual behavior) to ensure that consent is\npresent before acting and is present during the intimate conduct.\nWhen determining whether consent was present, Illinois Tech will consider whether\na reasonable person in the same circumstances should have known whether the other\nparty could or could not consent to the sexual activity. Thus, to have sex with someone\nwho you know to be, or should have known to be incapable of knowingly, voluntarily,\nand clearly giving permission, by words and/or actions to engage in sexual behavior\nis a violation of this policy. Consent is not present when an individual cannot give\npermission, voluntarily or involuntarily, due to age (younger than 17 in Illinois),\nphysical condition, or disability that impairs the individual's ability to give consent.\nReasons why one could lack the capacity to give consent due to a physical condition\ninclude, but are not limited to, incapacitation due to the consumption of drugs or\nalcohol (voluntarily or involuntarily) or being in a state of unconsciousness, sleep, or\nother state in which the person is unaware that sexual activity is occurring. To be\nclear, a person may appear to be giving consent but may not have the capacity to do\n2",
  "metadata": {
    "pages": [
      168
    ],
    "word_count": 504
  }
}