{
  "chunk_id": "Student_Handbook_chunk_0020",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "63-64",
  "page_count": 2,
  "text": "expected that any reporting will be done in good faith. Amnesty matters will be determined\nby the Dean of Students or designee.\na. Applicability\nThe Amnesty Policy acknowledges that as members of this community, students have a\nresponsibility to each other. Therefore, students should directly seek medical assistance\nfor another person (or for themselves) during an alcohol or other drug-related\nemergency. In such an instance, the student who seeks medical assistance will not face\ndisciplinary action for the mere possession or use of alcohol or drugs, if they remain with\nthe individual until medical assistance arrives and the person can be assisted. In order to\nqualify under the Policy, the student, after securing medical assistance, must also contact\nthe appropriate administrative department or authority. Depending on the facts and\ncircumstances, a student who seeks medical assistance for another may be required to\nmeet with a member of the Student Affairs staff and/or a counselor. As long as the student\ncomplies with all directives, they will not face disciplinary actions for the mere possession\nor use of alcohol and/or drug; failure to comply can result in the revocation of the amnesty\nand referral to the normal disciplinary process.\nb. Limits of the Amnesty Policy\nThe Amnesty Policy applies only to alcohol or other drug-related medical emergencies but\ndoes not apply to other prohibited conduct under the Code of Conduct. If other prohibited\nconduct occurs, then a student can be charged with a violation of the Code of Conduct.\nThe use and/or abuse of alcohol or drugs will not be considered a mitigating circumstance\nfor any other violation of this Code of Conduct. In cases where an individual fails to seek\nemergency medical assistance when it is clearly needed, disciplinary action may be taken\nagainst the individual.\nReporting pursuant to the Amnesty Policy will be monitored, and the Dean of Students\nretains the authority to pursue, in accordance with the Code of Conduct and applicable\nlaw, disciplinary action against and/or contact the parents of the students who abuse it.\nThe Amnesty Policy applies only to Illinois Tech’s response to a medical\nemergency. Criminal/police action may still occur separately from the Dean of Students\noffice.\nStudent Handbook 62\n\n2. Complaints\nAnyone – student, staff member, faculty member or non-Illinois Tech individual – may\ninitiate a complaint under the Code of Conduct against an admitted or enrolled student for\nmisconduct. (A complaint may also take the form of an Illinois Tech Department of Public\nSafety Incident Report regarding student conduct.) Complaints must be in writing and may\nbe filed at www.iit.edu/incidentreport or with any of the following offices:\nOffice of Student Affairs;\nOffice of Residence Life;\nOffice of Community Standards;\nPublic Safety; or\nGreek Council.\nThough individuals are encouraged to come forward and report complaints, reports may\nalso be made anonymously by contacting the Public Safety Department at 312-808-6300 or\nby filing a report at www.iit.edu/incidentreport. All complaints will be reviewed by the\nOffice of Student Affairs; however, Illinois Tech’s ability to investigate and to address\nanonymously reported complaints is generally significantly limited, which may inhibit\nIllinois Tech’s ability to pursue disciplinary proceedings against potential or alleged\nresponsible parties. Accordingly, the more information that can be provided, the more\nthorough the investigation will likely be.\nAll complaints will be processed through the Office of Student Affairs. This Office will\nreview and investigate, as it deems appropriate, the complaints to determine if the\ngathered evidence provides a reasonable basis upon which a determination that a violation\nof this Code of Conduct may have occurred could be made (i.e., merit) and, if so, to\ndetermine the appropriate course of action. It is possible that the initial facts and\ncircumstances known or discovered by Illinois Tech may be deemed to have sufficient\nmerit so as to warrant an investigation and/or interim measures, including an investigatory\nmeeting with the responding party; nonetheless, the facts and circumstances developed\nas a result of such an investigation may cause or result in Illinois Tech concluding that\nStudent Handbook 63",
  "metadata": {
    "pages": [
      63,
      64
    ],
    "word_count": 668
  }
}