{
  "chunk_id": "Student_Handbook_chunk_0065",
  "source_file": "Student_Handbook",
  "chunk_type": "student_handbook_section",
  "page_range": "160-161",
  "page_count": 2,
  "text": "The Assistant Director of Student life oversees and advises all chapters as well as Greek\nCouncil. Each fraternity and sorority must also have a staff, faculty, or alumni advisor. All\nadvisors must be pre-approved by the Office of Student Life and listed each term on the\nfraternity and sorority membership lists. The Office of Student Life can assist a fraternity or\nsorority in finding an advisor. It is the function of both the faculty/staff and RAs to\nencourage the scholastic, social, and cultural growth of fraternity and sorority members.\n5. Greek Council. Greek Council represents all social fraternities and sororities at Illinois\nTech. Each social fraternity and sorority must be recognized by both Student Government\nAssociation and Greek Council to receive official recognition as a student\norganization. The council coordinates fraternity and sorority events, scholarship programs,\nGreek Week and recruitment, as well as other campus-wide events. Greek Council is a\ngoverning body advised by the Assistant Director of Student Life. The council works in\ncollaboration with the Office of Community Standards to monitor its own members in\naccordance with Illinois Tech procedures, rules and policies, as well as the codes of\nconduct contained in its own constitution and bylaws. Fraternity and sorority organizations\nare responsible for complying with all procedures, rules and policies applicable to Illinois\nTech student organizations. Illinois Tech maintains the right to initiate its judicial process\nindependently of Greek Council actions and independent organizations and/or individuals.\n6. Hazing. As set forth in more detail in the Code of Conduct, hazing includes treating\nprospective members differently than active or alumni members. Refer to the Hazing Policy\nin this Student Handbook for more information. Organizations found responsible for\nparticipating in hazing may have their recognition revoked. Any questions regarding\nactivities that may constitute hazing should be directed to the Office of Student Life. All\nstudents, faculty, and staff have a responsibility to immediately report any questionable\nactivities to the Office of Student Life, Office of Residence Life, Office of Community\nStandards, and/or the Department of Public Safety.\n7. Indebtedness to Fraternities or Sororities. Fraternities and sororities are expected to\ntake all necessary action to collect debts owed to them by their members. Unless the debt\nowed by a member is actually one owed to Illinois Tech, Illinois Tech does not have\nstanding either to collect the debt from the member on behalf of the affected fraternity or\nsorority or to assist the affected fraternity or sorority with the collection efforts, and it will\nStudent Handbook 159\n\ntake no action nor provide any assistance to a fraternity or sorority to collect money owed\nto it by its members. To the extent that the debt is one actually owed to Illinois Tech, such\nas a failure to pay board for living in Illinois Tech owned and operated housing or using\nIllinois Tech sponsored meal plan, a member who is so delinquent may be subject to\npenalties, including, but not limited to, denial of housing in subsequent semesters.\n8. Initiation. The fraternity or sorority must instruct all new/associate members to\ncomplete the New Member bid form to check eligibility after the new/associate member\nhas accepted a bid.\n9. Membership. Membership in social fraternities and sororities is open to all regularly\nenrolled undergraduate students who are registered for classes at Illinois Tech. In some\ncase, graduate students are eligible to join as well. Regularly enrolled undergraduate\nstudents at VanderCook College of Music are eligible to join the social fraternities and\nsororities as long as such membership is not in conflict with national organization\nregulations. Fraternity and sorority membership rosters must be submitted to the Assistant\nDirector of Student Life at the beginning of each semester. The roster must include all\ninitiated/active members and new/associate members, as well as indicate whether they\nlive in the chapter house, a residence hall, or off campus. After membership lists have\nbeen submitted for the semester, the Office of Student Life must be notified in writing,\nwithin 48 hours, of any changes in the lists.\n10. New/Associate Members. The formal recruitment period takes place at the beginning\nof the fall and/or spring semester; however, chapters may also recruit new members\noutside of this period. This is known as informal recruitment. Chapters must follow all\nGreek Council policies pertaining to recruitment. Any student enrolled for at least 12 credit\nhours at Illinois Tech or at VanderCook College of Music is eligible to join. The names of all\nstudents who are potential new/associate members must be submitted to the Office of\nStudent Life at least three calendar days after bids are extended. A student on academic,\nconduct, or disciplinary probation is not eligible to join. The name of any student who is\ndisaffiliated at any time must be reported in writing to the Assistant Director of Student Life.\n11. Expansion. The purpose of the Fraternity and Sorority Expansion Policy is to open the\nGreek Council at Illinois Tech for expansion to additional inter/national fraternity or sorority\nStudent Handbook 160",
  "metadata": {
    "pages": [
      160,
      161
    ],
    "word_count": 829
  }
}