{
  "url": "https://www.iit.edu/registrar/policies-and-procedures/compressed-term-courses",
  "title": "Compressed Term Courses",
  "category": "registrar_policy",
  "chunks": [
    {
      "section": "Overview",
      "content": "Home Office of the Registrar Policies and Procedures Compressed Term Courses All compressed courses must follow government-mandated guidelines on effort hours. The federal definition of \"credit hour\" is based on the Carnegie Unit of academic credit and is defined in 34 CFR 600.2 (and further modified in 34 CFR 668.8 (k) and (l)) as \"an amount of work represented in intended learning outcomes and verified by evidence of student achievement that is an institutionally established equivalency that reasonably approximates not less than: One hour of classroom or direct faculty instruction and a minimum of two hours of out-of-class student work each week for approximately fifteen weeks for one semester or trimester hour of credit, or ten to twelve weeks for one quarter hour of credit, or the equivalent amount of work over a different amount of time; or At least an equivalent amount of work as required in paragraph (1) of this definition for other academic activities as established by the institution, including laboratory work, internships, practica, studio work, and other academic work leading to the award of credit hours.\" All compressed courses must be assessed using the same methods as semester courses. Compressed course schedules must adhere to federal guidelines and HLC policies regarding academic scheduling. Per federal regulations, the maximum number of days before or after the start and end dates of the term (as shown on the Academic Calendar) in which instruction can occur across the university is 14; in addition, classes beyond the end of a semester or term cannot overlap a subsequent term with the exception of winter term classes may overlap into spring semester. Note: Illinois Tech's policy, in compliance with federal regulations, on contact and credit hours can be found at www.iit.edu/registrar/policies-and-procedures/contact-and-credit-hours. Advisors should be alert to workload expectations for compressed courses; some"
    },
    {
      "section": "Overview",
      "content": "situations may be considered an overload and require a permit. For example: Permits for compressed courses offered during existing terms (i.e., fall or spring semester) should be used when the compressed course creates an overload situation (more than 18 credit hours of load at any point) during all or part of the term. Summer session loads involving compressed courses should follow the established load guidelines: www.iit.edu/registrar/registration/credit-hour-limits. For winter term courses, three credit hours is considered a full load for each session. So, if, for example, the university were to offer two j-term sessions during winter break and the terms are not overlapping, a student could take three credit hours in the first session and three credit hours in the second session, but could not take six hours in the first session. Load during winter term courses should be considered distinct from semester loads."
    },
    {
      "section": "Example of Compliant Compressed Course Structure",
      "content": "Three credit hours, compressed format, max/min compression option:\nCourse meets for 14 days\nMax 10 hours per day of work, including class\nOnly 6 contiguous class days without a break\n45 hours of class time, 90 hours of work time, 135 total hours"
    },
    {
      "section": "Winter Courses",
      "content": "Winter courses are a select group of courses within a compressed schedule that are part of either the fall or spring term. For example, when registering for these courses, if students select the spring term, only the winter courses offered in the spring will display. Winter courses are not part of a special term.\nWinter courses are full-credit-hour courses, but it is important to note that they will not count towards a student's full-time status in any given term. For example, if an undergraduate student wishes to fulfill their requirement of 12 credit hours in order to be considered full time, they will need to take a total of 12 credit hours per the policy (refer to the Full-time Status page), without a winter course included in that total for the semester. Students cannot take nine credit hours and add a winter course that can be three credit hours and assume their status is full time. Students will need to keep in mind that in order to have a full-time status, a winter course would be an addition to their 12 credit-hour total for the semester."
    }
  ]
}