{
  "url": "https://www.iit.edu/registrar/policies-and-procedures/contact-and-credit-hours",
  "title": "Contact and Credit Hours",
  "category": "registrar_policy",
  "chunks": [
    {
      "section": "Overview",
      "content": "Home\nOffice of the Registrar\nPolicies and Procedures\nContact and Credit Hours\nIllinois Tech complies with the federal definition of a credit hour. The federal definition is consistent with the university's historical practice in developing degree programs, courses bearing academic credit, and the scheduling of courses."
    },
    {
      "section": "Federal Definition of a Credit Hour",
      "content": "For purposes of the application of this policy and in accord with federal regulations, a credit hour is an institutionally established equivalency that reasonably approximates some minimum amount of student work reflective of the amount of work expected in a Carnegie Unit: key phrases being \"institutionally established,\" \"equivalency,\" \"reasonably approximate,\" and \"minimum amount.\" This includes laboratory work, internships, practicum, studio work, and other academic work leading toward the awarding of credit hours. These standards apply to both undergraduate and graduate courses. A contact hour is a measure that represents an hour of scheduled instruction given to students, and is distinct from the credit hour, which instead reflects student time commitment. One credit hour should involve an input of approximately three hours per week for the average student (e.g. one hour of classroom or direct faculty instruction and a minimum of two hours of out-of-class student work each week) for approximately 15 weeks. This definition applies to all delivery formats, and a three credit-hour class thus involves the reasonable expectation of 135 hours of total student time commitment. This basic measure may be adjusted proportionately to reflect modified academic calendars and formats of study. For a lecture class, a credit hour is normally granted for satisfactory completion of one 50-minute session (equivalent to one contact hour, i.e. a 10-minute passing period is counted within the hour) of classroom instruction per week for a semester of 15 weeks, along with delivery of educational material (studying, reading, writing, completion of assignments) understood to require two additional hours of effort. Typically, a three semester-credit-hour course meets three 50-minute sessions per week for 15 weeks for a total of 45 sessions (or two 75-minute sessions per week for 15 weeks for a total of 30 sessions). For labs and practicum classes, there may be more"
    },
    {
      "section": "Federal Definition of a Credit Hour",
      "content": "in-person contact hours utilized, with concomitantly less out-of-class effort. For instance, lab classes may meet for two hours/credit hour per week, and only have the expectation of one hour out-of-class preparation or report writing. Alternately, the practicum may be conversely organized but with the total student effort accounted for and outlined. For compressed sessions, the same total effort should be accounted for. For instance, a three credit-hour class that expects two 75-minute periods and six hours of out-of-class work per week in a 15-week semester, could be offered in a compressed six-week summer session (2.5x accelerated) as three 125-minute sessions and 15 hours of out-of-class work per week. For other delivery methods, such as asynchronous, online, or flipped classroom modalities, it is important that the total student effort be considered in assigning credit hour values to any course. It is also important to note that achievement of learning, while important for assessment, is not the same as a credit hour assignment. If an educational objective can be achieved with less student effort, this should be done, but the course should be assigned the appropriate credit hour value. This is important for Title IV compliance purposes, since the federal government underwrites significant expenses which are accounted for by compliance with this standard."
    }
  ]
}