{
  "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
  "content_type": "application/pdf",
  "title": "co-terminal-student-handbook.pdf",
  "pdf_pages": [
    {
      "page_num": 1,
      "text": "Co-Terminal Student Handbook"
    },
    {
      "page_num": 2,
      "text": "2 Updated September 2020 Contents I. What is a co-terminal degree? ................................................................. 3 II. Applying ................................................................................................... 4 III. Advising ................................................................................................... 5 IV. Academic Planning ................................................................................. 6 V. Academic Standing .................................................................................. 8 VI. Leaves of Absence .................................................................................. 9 VII. Degree Conferral ................................................................................. 10 VIII. Transferring to a Different Co-Terminal Program .............................. 10 IX. Withdrawing from the Co-Terminal Program ....................................... 11 X. Resources ............................................................................................... 12 XI. Contact Information ............................................................................. 13"
    },
    {
      "page_num": 3,
      "text": "3 Updated September 2020 I. What is a co-terminal degree? Co-terminal degrees allow Illinois Tech students to simultaneously complete both an undergraduate and graduate degree (Bachelor’s degree and Master’s degree). Co-terminal students maintain their undergraduate student status while completing graduate coursework, and can maintain financial aid eligibility when applicable. Co-terminal degrees provide an opportunity for students to gain greater knowledge in specialized areas while completing a smaller number of credit hours with increased scheduling flexibility than the completion of two degrees separately. Because most co-terminal degrees allow students to share course credit (a maximum of nine credit hours), students may complete both a Bachelor’s and Master’s degree in as few as five years. All degree requirements must be completed within six years of undergraduate matriculation, or the student will be dismissed from the co-terminal degree program. Please consult the Graduate Bulletin for a list of legacy co-terminal degree pairings: http://bulletin.iit.edu/graduate/graduate-education/academic-programs/. Students may also work with advisers to identify alternate bachelor's and master's degree pairings, pending the approval of the prospective graduate program and the student's undergraduate program."
    },
    {
      "page_num": 4,
      "text": "4 Updated September 2020 II. Applying Students applying to co-terminal studies must have completed at least 60 credit hours of undergraduate study and a least one full-time semester at Illinois Tech. Applicants must be at least one semester (12 credit hours) away from undergraduate graduation in order to apply. Applicants must also have a GPA of at least 3.0/4.0 or 3.25/4.0; however, please note that academic units may vary in terms of their GPA admission requirements. Co-terminal applications are coordinated through Illinois Tech’s Office of Graduate Admission. The co-terminal application is accessed from the my.iit.edu portal/academics tab/undergraduate academic affairs channel. Co-terminal admission deadlines are as follows, with no exception: • Fall semester admission: August 1 • Spring semester admission: December 1 • Summer semester admission: May 1 Upon admission to co-terminal studies, students are required to meet with the Office of Financial Aid and encouraged to meet with the International Center (if applicable) to discuss the effect co-terminal studies will have on their financing and immigration status. Financial Aid Illinois Tech considers co-terminal students to be degree-seeking, full-time, undergraduate students, and most Illinois Tech undergraduate scholarships will automatically be extended to the end of a co-terminal program. However, financial aid guidelines and regulations for co- terminal students can differ from non-co-terminal students as aid may be applied differently throughout the course of the program based on student enrollment. Please consult the Office of Financial Aid website for the current financial aid guidelines for co- terminal study: http://web.iit.edu/financial-aid/policies-procedures/co-terminal-student-policy"
    },
    {
      "page_num": 5,
      "text": "5 Updated September 2020 III. Advising Academic Advising Co-terminal students are assigned a co-terminal adviser who will oversee academic advising and course selection for their graduate degree. Co-terminal students will continue to work with their major adviser on undergraduate degree concerns. Co-terminal students should work with their co-terminal adviser to develop their plan for graduate degree completion. All questions regarding graduate course selections, concentrations, specializations, or proposed project and thesis research should be directed to the student’s co-terminal adviser. Co-terminal students are encouraged to meet with their co- terminal adviser each semester prior to registration. Students should not contact their major adviser for questions about their graduate studies. Co-terminal students with concerns about their academic status or co-terminal policies should contact the Office of Graduate Academic Affairs at cotermdegrees@iit.edu or 312.567.3024. Financial Advising All newly admitted co-terminal students who are eligible for federal financial aid are required to meet with a financial aid staff member to review the rules and regulations for financial aid as it pertains to the co-terminal program. Prior to their required meeting, students must meet with both undergraduate and co-terminal advisers to develop a projected course schedule to degree completion using the Co-Terminal Program Planning Worksheet.* This worksheet is essential for the Office of Financial Aid to adequately review how federal and institutional aid will be applied to the student’s individual co-terminal degree plan. Note that this worksheet is not your academic Co-Terminal Shared and Non-Shared Courses eForm. All newly admitted co-terminal students who are not federal aid recipients will be invited to attend a Co-Terminal Live session to review the rules and regulations for financial aid as it pertains to the co-terminal program. Details of the session will be emailed to the student by the Office of Financial Aid. Alternatively, if a student is not able to attend the live session, they may schedule an appointment to meet with a financial aid staff member to satisfy this requirement. Co-terminal students with any concerns about their financial aid should directly contact the Office of Financial Aid at finaid@iit.edu or 312.567.7219. *The Co-Terminal Program Planning Worksheet can be found on the Financial Aid website."
    },
    {
      "page_num": 6,
      "text": "6 Updated September 2020 IV. Academic Planning Co-Terminal Degree Pairings A number of formal co-terminal degree pairings exist, and can be viewed in the Undergraduate Bulletin. These legacy degree pairings have specific curricular and shared credit requirements. Students may alternatively work with advisers to identify customized bachelor’s and master’s degree pairings, pending the approval of the prospective graduate program and the student’s undergraduate program. In these cases, shared credit is approved on an individual basis. Declaration of Intent Students who wish to enroll in a co-terminal program should file a Declaration of Intent their first semester of enrollment at the university. This declaration signals an intent to apply to a co- terminal program in the student's junior year, should academic criteria be met. This declaration is especially critical for students who wish to pursue a customized co-terminal degree pairing and will help identify any deficiencies or prerequisite courses for the prospective graduate degree program. The Office of Undergraduate Academic Affairs will monitor the student's declaration until such time as the student may apply to be fully admitted to a co-terminal master's degree in their junior year, subject to the admission policies of the graduate academic unit. Co-Terminal Shared and Non-Shared Credit Form The Co-Terminal Shared and Non-Shared Courses eForm is the vehicle for establishing each co-terminal student’s graduate degree plan with the Office of Graduate Academic Affairs. An official Co-Terminal Shared and Non-Shared Courses eForm is mandatory for co-terminal graduate degree programs and must be filed by a co-terminal student, for final approval, in the first semester of co-terminal enrollment and no later than the day after add/drop for the term. Failure to comply will result in the student being blocked from registering for the next terms courses. Co-terminal students may access eForms for Degree Works via the eForms tab within the university’s Graduate Degree Works system, located in the myIIT portal (https://my.iit.edu). The Co-Terminal Shared and Non-Shared Courses eForm should include all current and future courses needed to complete the graduate portion of the co-terminal degree. If you have completed graduate-level coursework that you would like to use toward your graduate degree requirements, you should indicate this by including those courses in the Co-Terminal Shared and Non-Shared Courses eForm. The university requires a minimum of 30 credit hours for a professional Master’s or Master of Engineering degree and 32 credit hours for a Master of Science degree; however, please consult individual co-terminal advisers for program-specific details."
    },
    {
      "page_num": 7,
      "text": "7 Updated September 2020 Shared Credit Illinois Tech allows co-terminal students to share up to nine credit hours between their undergraduate and graduate programs. However, some co-terminal programs allow a smaller amount of shared credit or no shared credit. Shared courses should be included in the Co-Terminal Shared and Non-Shared Courses eForm, using the “Shared (Used in both programs)” descriptor. Shared credit courses must be completed with a grade of “C” or better to be applied to the graduate degree requirements of a co-terminal program. A minimum cumulative graduate GPA of 3.0/4.0 is required to maintain good graduate academic standing. Paired Programs For students who are enrolled in formally paired programs, the shared credits are pre- determined. Please contact your co-terminal adviser to identify what your options are. Unpaired Programs Students may pair programs that have not been previously, formally paired. Shared courses need to exist in the rules of both the undergraduate and graduate programs as stated in the undergraduate and graduate bulletins. Courses cannot be substituted within the programs. External Transfer Credit A maximum of nine graduate-level credit hours taken elsewhere and not applied toward any earned degree, subject to restrictions on shared and graduate transfer credit (http://bulletin.iit.edu/graduate/academic-policies-procedures/academic-progress/transfer- credit/), which were passed with grades of “B” or better, may be transferred towards the graduate portion of the co-terminal degree program, subject to the advance approval of the academic unit. Requested transfer credit must be verified through the submission of the official transcript outlining the requested credit. If the requested transfer credit is from a foreign institution, the official attested transcript must be sent directly from the institution to World Education Services (www.wes.org). World Education Services (WES) will submit the credential evaluation results directly to Illinois Tech. NOTE ON RESIDENCY REQUIREMENT: Co-terminal students, like Illinois Tech undergraduate students, are required to complete their last 45 hours of undergraduate coursework at Illinois Tech. These hours may include approved co-terminal shared credit hours, but not purely graduate coursework."
    },
    {
      "page_num": 8,
      "text": "8 Updated September 2020 V. Academic Standing Co-terminal degrees are awarded simultaneously, but need not be completed simultaneously. The undergraduate degree requirements may be completed in advance of the graduate degree requirements. In such cases, the undergraduate degree will be held until the completion of the graduate degree. Graduate degree requirements must be completed within 12 months of the undergraduate degree requirements, or else the student will be dismissed from the co-terminal program. Co-terminal students must complete all degree requirements within six years of their undergraduate matriculation, or the student will be dismissed from the co-terminal program. Probation Co-terminal students must maintain satisfactory grade point averages and a satisfactory rate of progress towards the completion of their co-terminal degrees. Illinois Tech considers co-terminal students to have an undergraduate student status throughout the course of their studies; however, students are subject to both undergraduate and graduate student probation policies. Co-terminal students who do not earn at least a 2.0 cumulative GPA, a 1.85 term GPA, a 2.0 major GPA, or who do not maintain satisfactory academic progress in their bachelor’s program are placed on undergraduate academic probation. Co-terminal students who are placed on undergraduate academic probation will be dismissed from the co-terminal program. Graduate academic standing review will be initiated when a co-terminal student completes declared graduate or shared coursework. In order to remain in good academic standing on the graduate level, co-terminal students must maintain a cumulative GPA of 3.0/4.0 for their graduate coursework. Students who achieve a graduate cumulative GPA of less than 3.0/4.0 will be placed on graduate academic probation. Students are required to submit a G702 probation contract before they will be allowed to register each semester they are on graduate academic probation. The G702 probation contract must be approved by the student’s co-terminal adviser and department. Co-terminal students on graduate academic probation will be allowed to register for a maximum of 12 credit hours per semester in order to maintain their full-time undergraduate status and financial aid eligibility. If the co-terminal student fails to make the requisite academic progress in the graduate degree program in accordance with graduate academic standing rules, they may be dismissed in a subsequent semester. A student dismissed from co-terminal degree status may still complete the undergraduate degree following the academic rules of undergraduate study. A student who is dismissed from co-terminal degree status may apply for Accelerated Master's Program admission consideration in the future."
    },
    {
      "page_num": 9,
      "text": "9 Updated September 2020 Course Repeats Co-terminal students may repeat up to two distinct courses for their graduate degree program. Co-terminal students may also repeat a maximum of three 100 and 200-level courses, and a maximum of three 300- and 400-level courses for their undergraduate degree program. If a student applies for a course repeat for a course being used for shared undergraduate and graduate degree credit, the course repeat will be double counted (counted once towards the two-course graduate course repeat maximum and again towards the three-course undergraduate upper-level course repeat maximum). Course repeats must be used for distinct courses with each course being repeated once for a change of grade. Both grades will be maintained on your student record; however only the most recent grade recorded for the repeated course will be calculated in your institutional GPA. A course repeat request must be submitted at the time of registration using the appropriate undergraduate or graduate academic affairs procedures. For the complete course repeat policy, please refer to the course repeat policy at https://web.iit.edu/registrar/registration/course-repeat-policy. VI. Leaves of Absence Like all undergraduate students, co-terminal degree-seeking students who wish to withdraw from the university with the intention of returning to complete their degree program may apply for a leave of absence. All requests for a leave of absence begin with the Office of Undergraduate Academic Affairs. A leave of absence cannot exceed one academic year, however it may be extended if the proper documentation is submitted. Students will still be considered part of the Illinois Tech community while on a leave and any Illinois Tech scholarships will be held until the student’s return. Students returning from a medical leave of absence are required to submit appropriate documentation from their medical provider. Please contact the Office of Undergraduate Academic Affairs for more information. International students must comply with additional regulations when requesting a leave of absence. Please contact the International Center with any questions regarding this issue. For more information on leaves of absence, please contact the Office of Undergraduate Academic Affairs (ugaa@iit.edu or 312.567.3300). NOTE ON DEGREE COMPLETION: All co-terminal degree requirements must be completed within six years of undergraduate matriculation, or the student will be dismissed from the co-terminal degree program. Time elapsed during a student’s leave of absence will not extend the total allowed time for co-terminal degree completion; it will remain six years."
    },
    {
      "page_num": 10,
      "text": "10 Updated September 2020 VII. Degree Conferral Co-terminal degrees are awarded simultaneously, and students may not receive their first degree before the requirements of the second degree are satisfied. In such cases, the conferral of the first degree will be held until the completion of the second degree. In the last semester of their co-terminal degree studies, students must apply for undergraduate graduation by the published deadline in the academic calendar or a late fee will be assessed. The Office of Undergraduate Academic Affairs will convey the co-terminal graduation application information to the Office of Graduate Academic Affairs. To apply for graduation, please visit the myIIT Portal at my.iit.edu. Choose the “Academics” tab, followed by the “Student Records” link. You may then select “Apply to Graduate.” Commencement Graduating co-terminal students may attend the main commencement ceremony and one departmental commencement ceremony. Accordingly, those students receiving degrees from two different academic units will need to choose which departmental ceremony to attend. VIII. Transferring to a Different Co-Terminal Program Enrolled co-terminal students may transfer to another co-terminal program before the completion of their degree. Co-terminal students who wish to transfer to an equivalent degree or from a research to a professional degree within the same academic unit (M.S. to M.S., ME, or MAS; ME to ME; or MAS to MAS) may be required to complete a new co-terminal application. For certain degree programs a student may request the change by filing the Change of Degree, Major, and/or Declare Concentration, Project or Thesis form in eForms for Degree Works. Check eForms for restrictions. The change of degree request will be reviewed and approved by the proposed new co-terminal adviser and academic department before the change is recorded. Once a degree change is recorded, students are required to file a new Co-Terminal Shared and Non-Shared Courses eForm. Instructions for completing a new Co-Terminal Shared and Non- Shared Courses eForm are detailed in the Academic Planning section of this handbook. Co-terminal students who wish to transfer from a professional degree to a research degree (ME or MAS to M.S.) in the same academic unit or to a degree in a different academic unit must submit a new co-terminal application. Instructions for applying to co-terminal studies are detailed in the Applying section of this handbook."
    },
    {
      "page_num": 11,
      "text": "11 Updated September 2020 IX. Withdrawing from the Co-Terminal Program Students may request to withdraw from the co-terminal program before the completion of the degree requirements. To place a withdrawal request, students may complete the Co-Terminal Withdrawal Form (G218) available at the Graduate Academic Affairs website (http://web.iit.edu/gaa/students/student-forms). Students who choose to withdraw from the co-terminal program will be converted to an undergraduate student status only and will be able to complete their undergraduate degree pursuant to Undergraduate Academic Affairs policies. These students may apply for Accelerated Master’s Program admission consideration in the future."
    },
    {
      "page_num": 12,
      "text": "12 Updated September 2020 X. Resources I have a question about: Please contact: Applying Office of Graduate Admission Billing Student Accounting Co-terminal policies Office of Graduate Academic Affairs Commencement Illinois Tech Commencement Degree plan (Co-Terminal Shared and Non-Shared Courses eForm) Office of Graduate Academic Affairs Diploma distribution Office of the Registrar Graduate courses Co-terminal adviser Graduate probation Office of Graduate Academic Affairs Financial aid Office of Financial Aid I-20 changes International Center Leaves of absence Office of Undergraduate Academic Affairs Registration Office of the Registrar Scholarships Office of Financial Aid Undergraduate courses Major adviser Undergraduate probation Office of Undergraduate Academic Affairs Withdrawing from co-terminal program Office of Graduate Academic Affairs Visa/international status inquiries International Center Important Links Co-terminal Degrees: http://web.iit.edu/gaa/co-terminal-degrees Graduate Academic Affairs: http://web.iit.edu/gaa/ Undergraduate Academic Affairs: http://web.iit.edu/ugaa Graduation Application: my.iit.edu Choose the “Academics” tab, followed by the “Student Records” link. You may then select “Apply to Graduate.”"
    },
    {
      "page_num": 13,
      "text": "13 Updated September 2020 XI. Contact Information Office of Graduate Academic Affairs IIT Tower, Suite 7D7-1 phone: 312.567.3024 email: gradcoll@iit.edu Office of Undergraduate Academic Affairs IIT Tower, Suite 2F9-1 phone: 312.567.3300 email: ugaa@iit.edu Center for Disability Resources Tech South, IC3-2 phone: 312.567.5744 email: disabilities@iit.edu Illinois Tech Commencement http://www.iit.edu/commencement/ email: commencement@iit.edu International Center MTCC, Room 202 phone: 312.567.3680 email: icenter@iit.edu Office of Financial Aid Perlstein Hall, 206 phone: 312.567.7219 email: finaid@iit.edu Office of Graduate Admission Perlstein, Room 203 phone: 312.567.3020 email: grad.admission@iit.edu Office of the Registrar Tech South, Suite 2022 phone: 312.567.3100 email: registrar@iit.edu One Stop MTCC, Room 106 phone: 312.567.3810 email: onestop@iit.edu Student Accounting Tech Central, 4th Floor phone: 312.567.3794 email: sa@iit.edu Student Affairs MTCC, Room 209 phone: 312.567.3081 email: dos@iit.edu Student Health and Wellness Center IIT Tower, 3rd Floor phone: 312.567.7550 email: student.health@iit.edu"
    }
  ],
  "chunks": [
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off0",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "Co-Terminal Student Handbook 2 Updated September 2020 Contents I. What is a co-terminal degree? ................................................................. 3 II. Applying ................................................................................................... 4 III. Advising ................................................................................................... 5 IV. Academic Planning ................................................................................. 6 V. Academic Standing .................................................................................. 8 VI. Leaves of Absence .................................................................................. 9 VII. Degree Conferral ................................................................................. 10 VIII. Transferring to a Different Co-Terminal Program ........................."
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off900",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "..... 10 IX. Withdrawing from the Co-Terminal Program ....................................... 11 X. Resources ............................................................................................... 12 XI. Contact Information ............................................................................. 13 3 Updated September 2020 I. What is a co-terminal degree? Co-terminal degrees allow Illinois Tech students to simultaneously complete both an undergraduate and graduate degree (Bachelor’s degree and Master’s degree). Co-terminal students maintain their undergraduate student status while completing graduate coursework, and can maintain financial aid eligibility when applicable. Co-terminal degrees provide an opportunity for students to gain greater knowledge in specialized areas while completing a smaller number of credit hours with increased scheduling flexibility than the comple"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off1800",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "tion of two degrees separately. Because most co-terminal degrees allow students to share course credit (a maximum of nine credit hours), students may complete both a Bachelor’s and Master’s degree in as few as five years. All degree requirements must be completed within six years of undergraduate matriculation, or the student will be dismissed from the co-terminal degree program. Please consult the Graduate Bulletin for a list of legacy co-terminal degree pairings: http://bulletin.iit.edu/graduate/graduate-education/academic-programs/. Students may also work with advisers to identify alternate bachelor's and master's degree pairings, pending the approval of the prospective graduate program and the student's undergraduate program. 4 Updated September 2020 II. Applying Students applying to co-terminal studies must have completed at least 60 credit hours of undergraduate study and a least o"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off2700",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "ne full-time semester at Illinois Tech. Applicants must be at least one semester (12 credit hours) away from undergraduate graduation in order to apply. Applicants must also have a GPA of at least 3.0/4.0 or 3.25/4.0; however, please note that academic units may vary in terms of their GPA admission requirements. Co-terminal applications are coordinated through Illinois Tech’s Office of Graduate Admission. The co-terminal application is accessed from the my.iit.edu portal/academics tab/undergraduate academic affairs channel. Co-terminal admission deadlines are as follows, with no exception: • Fall semester admission: August 1 • Spring semester admission: December 1 • Summer semester admission: May 1 Upon admission to co-terminal studies, students are required to meet with the Office of Financial Aid and encouraged to meet with the International Center (if applicable) to discuss the effect"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off3600",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "co-terminal studies will have on their financing and immigration status. Financial Aid Illinois Tech considers co-terminal students to be degree-seeking, full-time, undergraduate students, and most Illinois Tech undergraduate scholarships will automatically be extended to the end of a co-terminal program. However, financial aid guidelines and regulations for co- terminal students can differ from non-co-terminal students as aid may be applied differently throughout the course of the program based on student enrollment. Please consult the Office of Financial Aid website for the current financial aid guidelines for co- terminal study: http://web.iit.edu/financial-aid/policies-procedures/co-terminal-student-policy 5 Updated September 2020 III. Advising Academic Advising Co-terminal students are assigned a co-terminal adviser who will oversee academic advising and course selection for their"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off4500",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "graduate degree. Co-terminal students will continue to work with their major adviser on undergraduate degree concerns. Co-terminal students should work with their co-terminal adviser to develop their plan for graduate degree completion. All questions regarding graduate course selections, concentrations, specializations, or proposed project and thesis research should be directed to the student’s co-terminal adviser. Co-terminal students are encouraged to meet with their co- terminal adviser each semester prior to registration. Students should not contact their major adviser for questions about their graduate studies. Co-terminal students with concerns about their academic status or co-terminal policies should contact the Office of Graduate Academic Affairs at cotermdegrees@iit.edu or 312.567.3024. Financial Advising All newly admitted co-terminal students who are eligible for federal fina"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off5400",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "ncial aid are required to meet with a financial aid staff member to review the rules and regulations for financial aid as it pertains to the co-terminal program. Prior to their required meeting, students must meet with both undergraduate and co-terminal advisers to develop a projected course schedule to degree completion using the Co-Terminal Program Planning Worksheet.* This worksheet is essential for the Office of Financial Aid to adequately review how federal and institutional aid will be applied to the student’s individual co-terminal degree plan. Note that this worksheet is not your academic Co-Terminal Shared and Non-Shared Courses eForm. All newly admitted co-terminal students who are not federal aid recipients will be invited to attend a Co-Terminal Live session to review the rules and regulations for financial aid as it pertains to the co-terminal program. Details of the session"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off6300",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "will be emailed to the student by the Office of Financial Aid. Alternatively, if a student is not able to attend the live session, they may schedule an appointment to meet with a financial aid staff member to satisfy this requirement. Co-terminal students with any concerns about their financial aid should directly contact the Office of Financial Aid at finaid@iit.edu or 312.567.7219. *The Co-Terminal Program Planning Worksheet can be found on the Financial Aid website. 6 Updated September 2020 IV. Academic Planning Co-Terminal Degree Pairings A number of formal co-terminal degree pairings exist, and can be viewed in the Undergraduate Bulletin. These legacy degree pairings have specific curricular and shared credit requirements. Students may alternatively work with advisers to identify customized bachelor’s and master’s degree pairings, pending the approval of the prospective graduate pr"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off7200",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "ogram and the student’s undergraduate program. In these cases, shared credit is approved on an individual basis. Declaration of Intent Students who wish to enroll in a co-terminal program should file a Declaration of Intent their first semester of enrollment at the university. This declaration signals an intent to apply to a co- terminal program in the student's junior year, should academic criteria be met. This declaration is especially critical for students who wish to pursue a customized co-terminal degree pairing and will help identify any deficiencies or prerequisite courses for the prospective graduate degree program. The Office of Undergraduate Academic Affairs will monitor the student's declaration until such time as the student may apply to be fully admitted to a co-terminal master's degree in their junior year, subject to the admission policies of the graduate academic unit. Co"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off8100",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "-Terminal Shared and Non-Shared Credit Form The Co-Terminal Shared and Non-Shared Courses eForm is the vehicle for establishing each co-terminal student’s graduate degree plan with the Office of Graduate Academic Affairs. An official Co-Terminal Shared and Non-Shared Courses eForm is mandatory for co-terminal graduate degree programs and must be filed by a co-terminal student, for final approval, in the first semester of co-terminal enrollment and no later than the day after add/drop for the term. Failure to comply will result in the student being blocked from registering for the next terms courses. Co-terminal students may access eForms for Degree Works via the eForms tab within the university’s Graduate Degree Works system, located in the myIIT portal (https://my.iit.edu). The Co-Terminal Shared and Non-Shared Courses eForm should include all current and future courses needed to comple"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off9000",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "te the graduate portion of the co-terminal degree. If you have completed graduate-level coursework that you would like to use toward your graduate degree requirements, you should indicate this by including those courses in the Co-Terminal Shared and Non-Shared Courses eForm. The university requires a minimum of 30 credit hours for a professional Master’s or Master of Engineering degree and 32 credit hours for a Master of Science degree; however, please consult individual co-terminal advisers for program-specific details. 7 Updated September 2020 Shared Credit Illinois Tech allows co-terminal students to share up to nine credit hours between their undergraduate and graduate programs. However, some co-terminal programs allow a smaller amount of shared credit or no shared credit. Shared courses should be included in the Co-Terminal Shared and Non-Shared Courses eForm, using the “Shared (Use"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off9900",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "d in both programs)” descriptor. Shared credit courses must be completed with a grade of “C” or better to be applied to the graduate degree requirements of a co-terminal program. A minimum cumulative graduate GPA of 3.0/4.0 is required to maintain good graduate academic standing. Paired Programs For students who are enrolled in formally paired programs, the shared credits are pre- determined. Please contact your co-terminal adviser to identify what your options are. Unpaired Programs Students may pair programs that have not been previously, formally paired. Shared courses need to exist in the rules of both the undergraduate and graduate programs as stated in the undergraduate and graduate bulletins. Courses cannot be substituted within the programs. External Transfer Credit A maximum of nine graduate-level credit hours taken elsewhere and not applied toward any earned degree, subject to"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off10800",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "restrictions on shared and graduate transfer credit (http://bulletin.iit.edu/graduate/academic-policies-procedures/academic-progress/transfer- credit/), which were passed with grades of “B” or better, may be transferred towards the graduate portion of the co-terminal degree program, subject to the advance approval of the academic unit. Requested transfer credit must be verified through the submission of the official transcript outlining the requested credit. If the requested transfer credit is from a foreign institution, the official attested transcript must be sent directly from the institution to World Education Services (www.wes.org). World Education Services (WES) will submit the credential evaluation results directly to Illinois Tech. NOTE ON RESIDENCY REQUIREMENT: Co-terminal students, like Illinois Tech undergraduate students, are required to complete their last 45 hours of underg"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off11700",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "raduate coursework at Illinois Tech. These hours may include approved co-terminal shared credit hours, but not purely graduate coursework. 8 Updated September 2020 V. Academic Standing Co-terminal degrees are awarded simultaneously, but need not be completed simultaneously. The undergraduate degree requirements may be completed in advance of the graduate degree requirements. In such cases, the undergraduate degree will be held until the completion of the graduate degree. Graduate degree requirements must be completed within 12 months of the undergraduate degree requirements, or else the student will be dismissed from the co-terminal program. Co-terminal students must complete all degree requirements within six years of their undergraduate matriculation, or the student will be dismissed from the co-terminal program. Probation Co-terminal students must maintain satisfactory grade point ave"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off12600",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "rages and a satisfactory rate of progress towards the completion of their co-terminal degrees. Illinois Tech considers co-terminal students to have an undergraduate student status throughout the course of their studies; however, students are subject to both undergraduate and graduate student probation policies. Co-terminal students who do not earn at least a 2.0 cumulative GPA, a 1.85 term GPA, a 2.0 major GPA, or who do not maintain satisfactory academic progress in their bachelor’s program are placed on undergraduate academic probation. Co-terminal students who are placed on undergraduate academic probation will be dismissed from the co-terminal program. Graduate academic standing review will be initiated when a co-terminal student completes declared graduate or shared coursework. In order to remain in good academic standing on the graduate level, co-terminal students must maintain a c"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off13500",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "umulative GPA of 3.0/4.0 for their graduate coursework. Students who achieve a graduate cumulative GPA of less than 3.0/4.0 will be placed on graduate academic probation. Students are required to submit a G702 probation contract before they will be allowed to register each semester they are on graduate academic probation. The G702 probation contract must be approved by the student’s co-terminal adviser and department. Co-terminal students on graduate academic probation will be allowed to register for a maximum of 12 credit hours per semester in order to maintain their full-time undergraduate status and financial aid eligibility. If the co-terminal student fails to make the requisite academic progress in the graduate degree program in accordance with graduate academic standing rules, they may be dismissed in a subsequent semester. A student dismissed from co-terminal degree status may sti"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off14400",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "ll complete the undergraduate degree following the academic rules of undergraduate study. A student who is dismissed from co-terminal degree status may apply for Accelerated Master's Program admission consideration in the future. 9 Updated September 2020 Course Repeats Co-terminal students may repeat up to two distinct courses for their graduate degree program. Co-terminal students may also repeat a maximum of three 100 and 200-level courses, and a maximum of three 300- and 400-level courses for their undergraduate degree program. If a student applies for a course repeat for a course being used for shared undergraduate and graduate degree credit, the course repeat will be double counted (counted once towards the two-course graduate course repeat maximum and again towards the three-course undergraduate upper-level course repeat maximum). Course repeats must be used for distinct courses wi"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off15300",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "th each course being repeated once for a change of grade. Both grades will be maintained on your student record; however only the most recent grade recorded for the repeated course will be calculated in your institutional GPA. A course repeat request must be submitted at the time of registration using the appropriate undergraduate or graduate academic affairs procedures. For the complete course repeat policy, please refer to the course repeat policy at https://web.iit.edu/registrar/registration/course-repeat-policy. VI. Leaves of Absence Like all undergraduate students, co-terminal degree-seeking students who wish to withdraw from the university with the intention of returning to complete their degree program may apply for a leave of absence. All requests for a leave of absence begin with the Office of Undergraduate Academic Affairs. A leave of absence cannot exceed one academic year, ho"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off16200",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "wever it may be extended if the proper documentation is submitted. Students will still be considered part of the Illinois Tech community while on a leave and any Illinois Tech scholarships will be held until the student’s return. Students returning from a medical leave of absence are required to submit appropriate documentation from their medical provider. Please contact the Office of Undergraduate Academic Affairs for more information. International students must comply with additional regulations when requesting a leave of absence. Please contact the International Center with any questions regarding this issue. For more information on leaves of absence, please contact the Office of Undergraduate Academic Affairs (ugaa@iit.edu or 312.567.3300). NOTE ON DEGREE COMPLETION: All co-terminal degree requirements must be completed within six years of undergraduate matriculation, or the student"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off17100",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "will be dismissed from the co-terminal degree program. Time elapsed during a student’s leave of absence will not extend the total allowed time for co-terminal degree completion; it will remain six years. 10 Updated September 2020 VII. Degree Conferral Co-terminal degrees are awarded simultaneously, and students may not receive their first degree before the requirements of the second degree are satisfied. In such cases, the conferral of the first degree will be held until the completion of the second degree. In the last semester of their co-terminal degree studies, students must apply for undergraduate graduation by the published deadline in the academic calendar or a late fee will be assessed. The Office of Undergraduate Academic Affairs will convey the co-terminal graduation application information to the Office of Graduate Academic Affairs. To apply for graduation, please visit the my"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off18000",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "IIT Portal at my.iit.edu. Choose the “Academics” tab, followed by the “Student Records” link. You may then select “Apply to Graduate.” Commencement Graduating co-terminal students may attend the main commencement ceremony and one departmental commencement ceremony. Accordingly, those students receiving degrees from two different academic units will need to choose which departmental ceremony to attend. VIII. Transferring to a Different Co-Terminal Program Enrolled co-terminal students may transfer to another co-terminal program before the completion of their degree. Co-terminal students who wish to transfer to an equivalent degree or from a research to a professional degree within the same academic unit (M.S. to M.S., ME, or MAS; ME to ME; or MAS to MAS) may be required to complete a new co-terminal application. For certain degree programs a student may request the change by filing the Ch"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off18900",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "ange of Degree, Major, and/or Declare Concentration, Project or Thesis form in eForms for Degree Works. Check eForms for restrictions. The change of degree request will be reviewed and approved by the proposed new co-terminal adviser and academic department before the change is recorded. Once a degree change is recorded, students are required to file a new Co-Terminal Shared and Non-Shared Courses eForm. Instructions for completing a new Co-Terminal Shared and Non- Shared Courses eForm are detailed in the Academic Planning section of this handbook. Co-terminal students who wish to transfer from a professional degree to a research degree (ME or MAS to M.S.) in the same academic unit or to a degree in a different academic unit must submit a new co-terminal application. Instructions for applying to co-terminal studies are detailed in the Applying section of this handbook. 11 Updated Septemb"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off19800",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "er 2020 IX. Withdrawing from the Co-Terminal Program Students may request to withdraw from the co-terminal program before the completion of the degree requirements. To place a withdrawal request, students may complete the Co-Terminal Withdrawal Form (G218) available at the Graduate Academic Affairs website (http://web.iit.edu/gaa/students/student-forms). Students who choose to withdraw from the co-terminal program will be converted to an undergraduate student status only and will be able to complete their undergraduate degree pursuant to Undergraduate Academic Affairs policies. These students may apply for Accelerated Master’s Program admission consideration in the future. 12 Updated September 2020 X. Resources I have a question about: Please contact: Applying Office of Graduate Admission Billing Student Accounting Co-terminal policies Office of Graduate Academic Affairs Commencement Ill"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off20700",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "inois Tech Commencement Degree plan (Co-Terminal Shared and Non-Shared Courses eForm) Office of Graduate Academic Affairs Diploma distribution Office of the Registrar Graduate courses Co-terminal adviser Graduate probation Office of Graduate Academic Affairs Financial aid Office of Financial Aid I-20 changes International Center Leaves of absence Office of Undergraduate Academic Affairs Registration Office of the Registrar Scholarships Office of Financial Aid Undergraduate courses Major adviser Undergraduate probation Office of Undergraduate Academic Affairs Withdrawing from co-terminal program Office of Graduate Academic Affairs Visa/international status inquiries International Center Important Links Co-terminal Degrees: http://web.iit.edu/gaa/co-terminal-degrees Graduate Academic Affairs: http://web.iit.edu/gaa/ Undergraduate Academic Affairs: http://web.iit.edu/ugaa Graduation Applica"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off21600",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "tion: my.iit.edu Choose the “Academics” tab, followed by the “Student Records” link. You may then select “Apply to Graduate.” 13 Updated September 2020 XI. Contact Information Office of Graduate Academic Affairs IIT Tower, Suite 7D7-1 phone: 312.567.3024 email: gradcoll@iit.edu Office of Undergraduate Academic Affairs IIT Tower, Suite 2F9-1 phone: 312.567.3300 email: ugaa@iit.edu Center for Disability Resources Tech South, IC3-2 phone: 312.567.5744 email: disabilities@iit.edu Illinois Tech Commencement http://www.iit.edu/commencement/ email: commencement@iit.edu International Center MTCC, Room 202 phone: 312.567.3680 email: icenter@iit.edu Office of Financial Aid Perlstein Hall, 206 phone: 312.567.7219 email: finaid@iit.edu Office of Graduate Admission Perlstein, Room 203 phone: 312.567.3020 email: grad.admission@iit.edu Office of the Registrar Tech South, Suite 2022 phone: 312.567.3100"
    },
    {
      "chunk_id": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf::pdf::off22500",
      "source_url": "https://webmaster.iit.edu/files/graduate-academic-affairs/co-terminal-student-handbook.pdf",
      "content_type": "application/pdf",
      "title": "co-terminal-student-handbook.pdf",
      "page_h1": "",
      "section_heading": "PDF",
      "text": "email: registrar@iit.edu One Stop MTCC, Room 106 phone: 312.567.3810 email: onestop@iit.edu Student Accounting Tech Central, 4th Floor phone: 312.567.3794 email: sa@iit.edu Student Affairs MTCC, Room 209 phone: 312.567.3081 email: dos@iit.edu Student Health and Wellness Center IIT Tower, 3rd Floor phone: 312.567.7550 email: student.health@iit.edu"
    }
  ]
}