{
  "url": "https://www.iit.edu/registrar/policies-and-procedures/physical-or-financial-hardship-withdrawal-policy",
  "title": "Physical or Financial Hardship Withdrawal Policy",
  "category": "registrar_policy",
  "chunks": [
    {
      "section": "Overview",
      "content": "Home\nOffice of the Registrar\nPolicies and Procedures\nPhysical or Financial Hardship Withdrawal Policy\nConsistent with the Illinois Student Debt Assistance Act, this policy establishes processes and procedures to assist students in limiting their student debt when a physical or financial hardship requires the student to withdraw from Illinois Tech after the 100% tuition add/drop deadline has passed, as well as implementing requirements of the Act as it pertains to access to student transcripts. This policy should be read in conjunction with other university policies related to student financial aid and student accounts."
    },
    {
      "section": "Official and Unofficial Transcripts",
      "content": "Pursuant to and in compliance with the Act, Illinois Tech will not (i) refuse to provide an unofficial transcript to a current or former student on the grounds that the student owes a debt; (ii) condition the provision of an unofficial transcript on the payment of a debt, other than a fee charged to provide the transcript; or (iii) charge a higher fee for obtaining an unofficial transcript or provide less favorable treatment of a request for an unofficial transcript because a current or former student owes a debt.\nFor official transcripts, the university (i) will provide an official transcript of a current or former student to a current or potential employer, even if the current or former student owes a debt to the university; (ii) will not condition the provision of an official transcript to a current or potential employer on the payment of a debt, other than a fee charged to provide the transcript; and (iii) will not charge a higher fee for transferring an official transcript to a current or potential employer or provide less favorable treatment for such a request because a current or former student owes a debt.\nIf a hold has been placed on a student's transcript for reasons other than a debt owed, the student must contact the appropriate department to resolve the hold."
    },
    {
      "section": "Physical or Financial Hardship Withdrawal Request",
      "content": "A student may apply for a hardship withdrawal from their academic enrollment at Illinois Tech due to an unforeseeable and documented circumstance that occurs after the 100% tuition refund deadline date (published on Illinois Tech's Academic Calendar), which had a significant impact on the student's ability to continue in their course of study and be successful. Examples of a physical or financial hardship include: (i) serious injury or illness; (ii) chronic illness; (iii) a serious medical issue of a family member (spouse or partner, child, parent or guardian, grandparent, or sibling) for which the student is a part-time or full-time caretaker of that family member; (iv) a mental health condition of the student; (v) a sudden or consistent lack of transportation that prohibits a student's presence in class; or (vi) a significant, non-elective cost of living increase for the student. To request a hardship withdrawal under this policy, the student must complete the Hardship Withdrawal Request Form and submit supporting documentation of the physical/financial hardship evidencing the significant physical or financial hardship prior to the end of the term/semester in which they intend to withdraw. Hardship withdrawal submissions will be reviewed by the Office of the Registrar in conjunction with Academic Affairs, Financial Aid, and Student Accounting. Students will be considered for a full or partial refund of the original tuition, fee, and any other charges for the term of the withdrawal. Outcomes will be based on the information submitted along with university records including but not limited to enrollment, financial aid, and billing. Students will receive communication regarding the review outcome or any requests for further information within two weeks of submission. As a general rule, students are not eligible for hardship withdrawals if they have completed all course requirements (e.g., attended the final exam or submitted the final"
    },
    {
      "section": "Physical or Financial Hardship Withdrawal Request",
      "content": "project/paper/portfolio). A student receiving federal and/or state financial assistance should contact the Office of Financial Aid to address any possible financial implications, including those related to Title IV funding. Hardship withdrawal requests will be processed according to the last date of course attendance. A student who files or attempts to file a fraudulent application for a withdrawal under this policy in order to avoid a failing grade or disciplinary action may be considered in violation of the Code of Conduct. Questions regarding the Illinois Tech Hardship Withdrawal Policy should be emailed to the Office of the Registrar at registrar@illinoistech.edu."
    }
  ]
}