{
  "url": "https://www.iit.edu/registrar/students-and-alumni/preferred-first-name-policy",
  "title": "Preferred First Name Policy",
  "category": "registrar_policy",
  "chunks": [
    {
      "section": "Overview",
      "content": "Home Office of the Registrar Students and Alumni Preferred First Name Policy Illinois Institute of Technology provides students with the option to select a preferred first name that will be displayed in certain university systems as identified below. Illinois Tech recognizes that students may use names other than their legal name to identify themselves. Except when an individual's legal first name is required by law, policy, or business needs, individuals may choose to be identified in certain university systems by the preferred first name that they have designated in accordance with this policy. Note: Students are not required to indicate a preferred name. If a student does not indicate a preferred name, the student's legal name will be displayed. Once a request is submitted, the preferred first name will appear instead of the student's legal first name in university-related systems and documents, except where the use of the legal name is required by university business or legal need. Preferred name only applies to the student's first name. If the student would like to change their middle or last name on their university record, they would need to change their legal name. Student's preferred first name will be displayed in the following areas: Class lists Faculty grade entry Student portal Banner Self Service Canvas PNC (student health and wellness system) ID cards Out of concern for the safety and privacy of students, Illinois Tech does not use preferred names on any communication or documentation that will be viewed outside the campus community. This approach is followed to protect against the possible inadvertent disclosure of a preferred name that a student may not have yet chosen to use outside of IIT. Setting a preferred first name does not automatically change the name that will be listed on a diploma or used at"
    },
    {
      "section": "Overview",
      "content": "Commencement/Convocation Ceremonies. Acceptable use of preferred first name includes: A middle name instead of a first name An abbreviated name (e.g., Chris instead of Christopher, Liz instead of Elizabeth) An Americanized name (e.g., Wendy instead of Haiyan) A name that better reflects one's ethnic, racial, or gender identity A name to which you are in the process of legally changing"
    },
    {
      "section": "Definitions",
      "content": "Preferred Name—The name by which a person wishes to be known and to have appear in selected university systems. The preferred name will consist of a preferred first name and legal last name.\nLegal Name—The name that is recorded on legal identification (such as a passport, driver's license, or official government-issued identification card) and used on formal legal records, other documents, and systems at the university, such as in tax documents, contracts, academic transcripts, diplomas, health records, etc."
    },
    {
      "section": "How to Set Your Preferred First Name",
      "content": "To set or change your preferred first name, complete the Preferred First Name Request Form. The university does not require any information about the reason for the change. Submissions will require that a copy of the legal ID be included. The legal last name must match the current student record. The submission form is for system update purposes only.\nPlease note that the preferred first name should not be any of the following:\nProfane or offensive language\nOnly symbols\nA submission for another individual"
    },
    {
      "section": "How long will it take for my preferred first name to show up in the Illinois Tech student portal?",
      "content": "The submission of a preferred first name change will take three to five business days to appear in university systems."
    },
    {
      "section": "Where can I seek assistance regarding my preferred first name change request?",
      "content": "If you have any questions about preferred first name or legal name change, please contact the Office of the Registrar at 312.567.3100 or registrar@illinoistech.edu."
    }
  ]
}